{
  "title": "User Guide",
  "subtitle": "Learn all features of ReeeeecallStudy",
  "searchPlaceholder": "Search features (e.g., SRS, Import, Share...)",
  "tableOfContents": "Table of Contents",
  "noResults": "No results for \"{{query}}\".",
  "sections": {
    "getting-started": {
      "title": "Getting Started",
      "items": {
        "login": {
          "title": "Login",
          "body": "Log in with your email and password. When you sign up, a verification email is sent — click the link to complete registration. You can receive a reset link if you forget your password."
        },
        "dashboard": {
          "title": "Home (Dashboard)",
          "body": "After login, the dashboard appears. See total cards, today's review cards, study streak, and mastery rate at a glance. Check the study heatmap to see if you've been studying consistently, and use the review forecast chart to predict upcoming study volume."
        },
        "navigation": {
          "title": "Navigation",
          "body": "On PC, use the top menu bar; on mobile, tap the hamburger (☰) menu. Available menus: Quick Study, Dashboard, Decks, Market, Cards (Templates), Study History, Settings."
        }
      }
    },
    "decks": {
      "title": "Deck Management",
      "items": {
        "create": {
          "title": "Create a Deck",
          "body": "On the Decks page, press the 'New Deck' button. Set the name, description, icon, and color. A deck is like a folder that groups flashcards by topic."
        },
        "detail": {
          "title": "Deck Detail View",
          "body": "Click a deck to see its card list. Use the top buttons to add cards, import, export, share, or edit the deck. Filtering by card status (new/learning/review/suspended) and search are also supported."
        },
        "edit": {
          "title": "Edit Deck",
          "body": "On the deck edit page, change the name, description, icon, color, and default template. SRS settings (Again/Hard/Good/Easy intervals) can be adjusted per deck. Deck statistics (card status distribution, mastery rate, study heatmap) are shown at the bottom."
        },
        "delete": {
          "title": "Delete Deck",
          "body": "Press the delete icon on the deck list to see a confirmation dialog. Deleting a deck also removes all its cards — be careful."
        }
      }
    },
    "cards": {
      "title": "Card Management",
      "items": {
        "add": {
          "title": "Add Cards",
          "body": "Press 'Add Card' on the deck detail page. Fill in the fields defined in the template (e.g., front, back). Add tags separated by commas for later search and filtering."
        },
        "editDelete": {
          "title": "Edit & Delete Cards",
          "body": "Click a card in the list to open the edit modal. Modify field content and tags. You can delete individual cards or select multiple for bulk deletion."
        },
        "searchFilter": {
          "title": "Search & Filter",
          "body": "Enter keywords in the search bar at the top of the deck detail page to search across all fields and tags. Select a status filter (new, learning, review, suspended) to view only specific cards."
        },
        "srsReset": {
          "title": "SRS Reset",
          "body": "Resetting a card's SRS status returns it to 'new' status. Use this when you want to start learning from scratch."
        }
      }
    },
    "templates": {
      "title": "Card Templates",
      "items": {
        "what": {
          "title": "What is a Template?",
          "body": "A template defines a card's structure — which fields it has and how they're arranged on front and back. For example, an 'English Vocab' template might have fields for word, meaning, and example sentence. One template can be shared across multiple decks."
        },
        "createEdit": {
          "title": "Create & Edit Templates",
          "body": "Press 'New Template' in the Cards menu. Add fields and set name, type (text/image/audio). Drag to reorder fields. Add descriptions to fields as guides for card creation."
        },
        "layout": {
          "title": "Front & Back Layout",
          "body": "Default mode: Place fields on front/back sides and set style (primary, secondary, hint, detail, media) and font size. Custom HTML mode: Use {{fieldName}} syntax for freeform HTML layout."
        },
        "tts": {
          "title": "TTS (Text-to-Speech)",
          "body": "Enable TTS per field and select a language (Korean, English, Japanese, Chinese, etc.). When studying, cards auto-read when flipped, or press the speaker button for manual playback. Toggle auto-read in Settings."
        }
      }
    },
    "study": {
      "title": "Study",
      "items": {
        "modes": {
          "title": "Study Modes",
          "body": "• SRS (Spaced Repetition): Automatically adjusts review timing based on memory curve. Wrong cards reappear within the same session. The most efficient method for long-term memorization.\n• Sequential Review: Studies all new cards plus a configurable number of review cards. Cycles back to the beginning after reaching the end.\n• Random: Randomly draws cards from the deck.\n• Sequential: Studies cards in order. Remembers your position to continue.\n• By Date: Studies only cards added on a specific date.\n• Cramming Mode: Intensive round-based review until all cards are mastered. Does not affect your SRS schedule."
        },
        "srsScience": {
          "title": "The Science Behind SRS",
          "body": "SRS (Spaced Repetition System) is a learning method based on how human memory works.\n\nEbbinghaus's Forgetting Curve\nGerman psychologist Hermann Ebbinghaus discovered the \"forgetting curve\" through experiments in 1885:\n• 20 minutes after learning: ~42% forgotten\n• 1 hour after: ~56% forgotten\n• 1 day after: ~67% forgotten\n• 1 week after: ~75% forgotten\n• 1 month after: ~79% forgotten\n\nIn other words, information studied only once is forgotten rapidly over time.\n\nThe Core Principle of Spaced Repetition\nThe key to SRS is \"reviewing just before you forget\":\n1. First study → review after 1 day\n2. Remembered after 1 day → review after 3 days\n3. Remembered after 3 days → review after 7 days\n4. Remembered after 7 days → review after 21 days\n\nBy gradually increasing review intervals, you can store information in long-term memory with minimal effort. Research shows this is 2-3x more efficient than simple rote repetition.\n\nReeeeecallStudy's SRS is based on the SM-2 algorithm proven by Anki, analyzing each card's difficulty and study history to automatically calculate the optimal review timing."
        },
        "srsMethod": {
          "title": "SRS Study Method — Complete Button Guide",
          "body": "See the card front, recall the answer, then flip. After checking the back, press one of 4 buttons to self-evaluate.\n\nAgain (Red Button)\n\"I didn't remember at all\"\n• New card: Reappears after 10 minutes (within the same session)\n• Review card: Interval resets, reappears after 10 minutes\n• Ease factor decreases by -0.20\n• Repetition count resets to 0\n→ If you don't remember, press it honestly. Forcing another button actually reduces learning efficiency.\n\nHard (Orange Button)\n\"I recalled it, but it was difficult\"\n• New card: Review after 1 day\n• Review card: Reviewed at ~1.2x the current interval (minimum +1 day)\n• Ease factor decreases by -0.15\n→ If you struggled for several seconds before barely recalling, choose Hard.\n\nGood (Blue Button)\n\"I remembered reasonably well\"\n• New card: Review after 1 day\n• Second review: At least 3 days later\n• After that: Current interval × ease factor (typically 2.5x)\n• Ease factor stays unchanged\n→ If you recalled naturally within 1-2 seconds, choose Good. This is the button you'll press most often.\n\nEasy (Green Button)\n\"I remembered instantly and perfectly\"\n• New card: Review after 4 days\n• Review card: Current interval × ease factor × 1.3\n• Ease factor increases by +0.15\n→ Only press Easy when the answer comes to mind the instant you see the card.\n\nTip: When in doubt, press Good. For most cards, Good is the most appropriate rating."
        },
        "srsCardStates": {
          "title": "Understanding Card States",
          "body": "In SRS study, cards go through 3 states:\n\nNew\nCards that haven't been studied yet.\n• They appear for the first time in a study session\n• After the first rating, they move to \"Learning\" or \"Review\" state\n• The \"New Card Limit\" in settings controls how many appear per session\n\nLearning\nCards that haven't been fully memorized yet (rated Again or Hard).\n• They reappear at short intervals (10 min to 1 day)\n• Rating Good or above \"graduates\" them to Review state\n• They can appear multiple times within the same session\n\nReview\nCards that have entered long-term memory (rated Good or Easy).\n• Intervals grow progressively (1 day → 3 days → 7 days → 21 days → ...)\n• Pressing Again sends them back to \"Learning\"\n• Well-memorized cards may have intervals of months or even years\n\nThanks to this 3-stage system, you focus time on cards you don't know while minimizing review of cards you've already mastered."
        },
        "srsIntervals": {
          "title": "Review Intervals & Ease Factor",
          "body": "The heart of SRS is the \"Ease Factor\" and \"Review Interval.\"\n\nWhat is the Ease Factor?\nA number assigned individually to each card (default: 2.50).\n• Again: -0.20 decrease (minimum 1.30)\n• Hard: -0.15 decrease (minimum 1.30)\n• Good: No change\n• Easy: +0.15 increase (maximum 4.00)\n\nReview intervals grow by multiplying the ease factor:\nExample: Card with 10-day interval, ease factor 2.50, rated Good → next interval = 10 × 2.50 = 25 days\n\nReal Study Example (Default Settings)\nPressing Good consistently on a new card:\n1st: After 1 day → 2nd: After 3 days → 3rd: After 8 days → 4th: After 20 days → 5th: After 50 days → ...\n\nPressing Again first, then Good:\n1st (Again): After 10 min → 2nd (Good): After 1 day → 3rd (Good): After 3 days → ...\n\nInterval Guarantee Rules\n• Hard's interval always increases by at least 1 day from the previous\n• Good's interval is always greater than Hard's\n• Easy's interval is always greater than Good's\n\nThis system ensures frequently missed cards appear more often, while well-known cards appear less frequently."
        },
        "quickStudy": {
          "title": "Quick Study",
          "body": "Select a deck directly on the Quick Study page to start. Each deck shows new/review card counts for quick decision-making."
        },
        "sessionFlow": {
          "title": "Study Session Flow",
          "body": "1. Select deck → Set study mode → Start\n2. See card front → Tap/click to flip → Choose rating\n3. After all cards, a summary shows study count, time spent, and rating distribution.\n\nKeyboard shortcuts: Space (flip), 1 (Again), 2 (Hard), 3 (Good), 4 (Easy)"
        },
        "swipeMode": {
          "title": "Swipe Mode",
          "body": "Switch answer mode to 'Swipe' in Settings to rate cards by swiping. Assign ratings to each direction (up/down/left/right). Great for one-handed mobile study."
        },
        "srsCustom": {
          "title": "Customizing SRS Settings",
          "body": "Adjust Again/Hard/Good/Easy default intervals (days) on the deck edit page. For example, increasing Easy interval to 7 days reduces review frequency for easy cards. The 'New Card Limit' in Settings controls how many new cards appear per session."
        },
        "cramming": {
          "title": "Cramming Mode",
          "body": "Cramming Mode is designed for intensive, last-minute study — perfect before exams or when you need to quickly review all cards.\n\nHow It Works\n1. All selected cards are presented in Round 1\n2. Rate each card as \"Got It\" or \"Didn't Get It\"\n3. Missed cards reappear within the round after a short gap\n4. Cards never answered \"Got It\" move to the next round\n5. Session ends when all cards are mastered (or time runs out)\n\nKey Features\n• Card Filter: Study all cards, weak cards only (low ease factor), or cards due soon\n• Time Limit: Optional — set 15/30/60 minutes or no limit\n• Shuffle: Randomize card order each round\n• Mastery Tracking: Real-time mastery percentage and round progress\n\nSRS Safety\nCramming Mode does NOT affect your SRS schedule. Your ease factors, intervals, and next review dates remain unchanged. Study logs are still recorded for history tracking.\n\nKeyboard Shortcuts\n• Space or → : Got It\n• ← : Didn't Get It\n\nWhen to Use Cramming vs SRS\n• Use SRS for daily, long-term learning\n• Use Cramming for exam prep, quick review, or refreshing forgotten material"
        }
      }
    },
    "import-export": {
      "title": "Import & Export",
      "items": {
        "jsonImport": {
          "title": "JSON Import",
          "body": "On the deck detail page, click 'Import' → select a JSON file. JSON files exported from ReeeeecallStudy can be directly imported, ideal for backup and restore. Includes deck metadata and template info."
        },
        "csvImport": {
          "title": "CSV Import",
          "body": "CSV files (saved from Excel) can also be imported. A mapping step appears to match column names to template fields, with auto-matching. A 'Tags' column with semicolons (;) is auto-recognized."
        },
        "duplicates": {
          "title": "Duplicate Handling",
          "body": "When importing, existing cards with identical content are flagged as duplicates. You can skip, overwrite, or add them. Preview valid/invalid/duplicate card counts before final import."
        },
        "jsonExport": {
          "title": "JSON Export",
          "body": "Deck detail → 'Export' → JSON downloads the deck info, template, and all cards as one JSON file. Use for transferring to other devices/accounts or backup."
        },
        "csvExport": {
          "title": "CSV Export",
          "body": "CSV format can be opened directly in Excel/Google Sheets. Includes BOM for proper Korean display in Excel."
        }
      }
    },
    "sharing": {
      "title": "Deck Sharing",
      "items": {
        "copy": {
          "title": "Share Mode: Copy",
          "body": "Gives the recipient an independent copy of the deck. They can freely edit, add, and delete cards. After sharing, the original and copy don't affect each other. Best for customization."
        },
        "subscribe": {
          "title": "Share Mode: Subscribe",
          "body": "The recipient 'subscribes' to your deck. When you add cards, subscribers get them too. However, study progress (SRS) is tracked independently. Subscribers can't edit cards. Great for teacher↔student or study groups."
        },
        "snapshot": {
          "title": "Share Mode: Snapshot",
          "body": "Creates a read-only copy of the deck at the current point in time. Recipients can only study, not edit. Future updates to the original aren't reflected. Use when you want to share 'the exact current state'."
        },
        "inviteLink": {
          "title": "Sending Invite Links",
          "body": "Deck detail → Share button → Select share mode → 'Generate Invite Link' creates a unique link. Send via messenger, email, etc. The recipient clicks to accept."
        },
        "manage": {
          "title": "Managing Shares",
          "body": "Check sent/received shares on the 'My Shares' page near Settings. You can revoke active shares or unsubscribe from subscriptions."
        }
      }
    },
    "marketplace": {
      "title": "Marketplace",
      "items": {
        "what": {
          "title": "What is the Marketplace?",
          "body": "A space to search and get decks shared by other users. Filter by category (language, certification, programming, etc.) and tags, sort by popularity or newest."
        },
        "getDeck": {
          "title": "Getting a Deck",
          "body": "Click a deck in the marketplace to see details. Preview the first 10 cards, then press 'Get' to add it to your decks. Behavior varies by share mode (copy/subscribe/snapshot)."
        },
        "publish": {
          "title": "Publishing Your Deck",
          "body": "Deck detail → Share → 'Publish to Market'. Set title, description, category, tags, and share mode. Once published, all users can search for it. You can unpublish anytime."
        }
      }
    },
    "history": {
      "title": "Study History & Statistics",
      "items": {
        "viewHistory": {
          "title": "Viewing Study History",
          "body": "View all study sessions by date on the Study History page. Click a session to see per-card details (rating, time spent). Filter by deck or mode."
        },
        "deckProgress": {
          "title": "Deck Progress",
          "body": "Deck progress cards appear at the top of Study History. See completion rate and card counts by status (new/learning/review) at a glance."
        },
        "dashboardStats": {
          "title": "Dashboard Statistics",
          "body": "Switch between period tabs (1W/1M/3M/6M/1Y) on the dashboard to view the study heatmap, daily study volume chart, and review forecast."
        }
      }
    },
    "settings": {
      "title": "Settings",
      "items": {
        "profile": {
          "title": "Profile",
          "body": "Set your display name. Email cannot be changed."
        },
        "srsLimit": {
          "title": "SRS New Card Limit",
          "body": "Set the maximum number of new cards added per SRS session. Review cards are not affected by this limit. Adjust to control your study volume."
        },
        "answerMode": {
          "title": "Answer Mode (Button/Swipe)",
          "body": "Button mode: Rate by pressing buttons at the bottom.\nSwipe mode: Rate by swiping cards. Assign ratings (Again/Hard/Good/Easy) to each direction."
        },
        "autoTts": {
          "title": "Auto TTS",
          "body": "Auto-reads TTS-enabled fields when flipping cards. Even when off, the speaker button for manual playback is always available."
        },
        "apiKey": {
          "title": "API Key",
          "body": "Generate an API key to access ReeeeecallStudy data from external tools (scripts, apps). The key is shown only once — be sure to copy it. Up to 1 key allowed."
        }
      }
    },
    "api": {
      "title": "API Guide (Auto-Generate Cards with AI)",
      "items": {
        "whatSimple": {
          "title": "What is an API? (Simple Explanation)",
          "body": "An API is \"a way for programs to talk to each other.\"\n\nJust like you click buttons in the app to create cards, an API lets you do the same thing with text commands.\n\nThink of it like a restaurant:\n• Menu = API documentation (describes what requests you can make)\n• Ordering = API request (\"Show me my decks\", \"Add 100 cards\")\n• Receiving food = API response (the data or result you requested)\n\nThe best part? You can ask AI tools like ChatGPT, Gemini, or Claude to send these commands for you!\nThe AI creates the card content AND registers them via API automatically."
        },
        "whyApi": {
          "title": "Why Use the API?",
          "body": "Compare making cards one by one vs. using the API:\n\nManual: 30 seconds per card x 100 cards = ~50 minutes\nAPI + AI: 100 cards at once = ~3-5 minutes\n\nWhat you can do with the API:\n• Tell AI \"Create 100 TOEIC vocabulary cards\" and they're instantly generated\n• \"Make 50 JLPT N3 kanji cards\" — done in one request\n• Upload data from Excel or text files in bulk\n• No programming needed — just chat with AI!\n\nFollow this guide and anyone can create 100 cards in 5 minutes."
        },
        "getKey": {
          "title": "Getting Your API Key",
          "body": "To use the API, you first need an API key. It's like a password that lets you access the API from your account.\n\nHow to get one:\n1. Log in to the ReeeeecallStudy app\n2. Go to \"Settings\" from the top-right menu\n3. Scroll down to the \"API Key\" section\n4. Click \"Generate New API Key\"\n5. Enter a name for your key (e.g., \"My AI Integration\")\n6. A key starting with rc_ will be displayed\n\nIMPORTANT: The key is shown only once on this screen!\nMake sure to copy and save it somewhere safe.\n\nYour API key is like a password. Never share it with others."
        },
        "step1Prepare": {
          "title": "Step 1: Prepare Your Deck and Card Template",
          "body": "Before adding cards via API, first create a deck and card template in the app.\n\n1. Create a Deck\n• In the app, go to \"Decks\" → \"Create New Deck\"\n• Enter a name (e.g., \"TOEIC Vocabulary\")\n• Enter a description (e.g., \"Essential TOEIC words\")\n\n2. Create a Card Template\n• Go to \"Templates\" → \"New Template\"\n• Enter a name (e.g., \"Vocabulary Detail\")\n• Add fields:\n  - word: text type\n  - meaning: text type\n  - example: text type\n• Place \"word\" on the front layout\n• Place \"meaning\" and \"example\" on the back layout\n\n3. Set Default Template for Your Deck\n• In deck edit, select the template you just created as the default\n\nTip: Remember the field key names (word, meaning, example)!\nYou'll use these exact keys when creating cards via API."
        },
        "step2Query": {
          "title": "Step 2: Find Your Deck/Template IDs with AI",
          "body": "To add cards, you need your deck ID and template ID.\nLet's ask AI to look them up!\n\nOpen ChatGPT, Gemini, or Claude and paste the following:\n\n─────────────────────────────\nI'm using a flashcard app called ReeeeecallStudy.\nHere's my API info:\n• API URL: https://reeeeecallstudy.xyz/api/v1\n• API Key: rc_PASTE_YOUR_API_KEY_HERE\n\nPlease make these two requests:\n1. List my decks: GET https://reeeeecallstudy.xyz/api/v1/decks\n2. List my templates: GET https://reeeeecallstudy.xyz/api/v1/templates\n\nInclude the header: Authorization: Bearer rc_PASTE_YOUR_API_KEY_HERE\nShow me each deck's id and name, and each template's id, name, and fields.\n─────────────────────────────\n\nReplace \"rc_PASTE_YOUR_API_KEY_HERE\" with your actual API key!\n\nThe AI will show you info like:\n• Deck ID: a1b2c3d4-xxxx-xxxx-xxxx-xxxxxxxxxxxx\n• Deck name: TOEIC Vocabulary\n• Template ID: e5f6g7h8-xxxx-xxxx-xxxx-xxxxxxxxxxxx\n• Template fields: word, meaning, example\n\nCopy these IDs — you'll need them in the next step!"
        },
        "step3AiGenerate": {
          "title": "Step 3: Ask AI to Create and Register Cards",
          "body": "This is the key step! Ask AI to create cards and register them directly.\n\nCopy the prompt below, replace the marked parts with your info, and send it to AI:\n\n─────────────────────────────\nCreate flashcards using the ReeeeecallStudy API.\n\nAPI Info:\n• Base URL: https://reeeeecallstudy.xyz/api/v1\n• API Key: (paste your API key here)\n• Deck ID: (paste your deck ID from Step 2)\n• Template ID: (paste your template ID from Step 2)\n\nCard creation endpoint:\nPOST https://reeeeecallstudy.xyz/api/v1/decks/(deck ID)/cards\nHeaders:\n  Authorization: Bearer (API key)\n  Content-Type: application/json\nBody (JSON array, max 100):\n[\n  {\n    \"template_id\": \"(template ID)\",\n    \"field_values\": {\n      \"word\": \"English word\",\n      \"meaning\": \"definition\",\n      \"example\": \"example sentence\"\n    },\n    \"tags\": [\"tag\"]\n  }\n]\n\nRequest:\nCreate 50 essential TOEIC vocabulary cards and register them via the API above.\nEach card should have:\n• word: English word\n• meaning: concise definition\n• example: one example sentence using the word\n• tags: difficulty level (beginner / intermediate / advanced)\n─────────────────────────────\n\nChange \"50 essential TOEIC vocabulary cards\" to any topic you want!\nExamples:\n• \"30 JLPT N3 kanji cards\"\n• \"40 basic Spanish travel phrases\"\n• \"50 world history timeline events\"\n• \"30 Python programming terms\"\n• \"50 medical anatomy terms\"\n\nNeed more cards? Just say \"Create 50 more without duplicates!\""
        },
        "aiExamples": {
          "title": "Tips for Each AI (ChatGPT / Gemini / Claude)",
          "body": "Each AI has slightly different strengths. Use the best one for your needs!\n\nChatGPT (chat.openai.com)\n• Can run code to call the API directly via Code Interpreter\n• Tip: Say \"Run Python code to call the API directly\" and it will execute real code to register cards\n• Best for: Direct API calls\n\nGoogle Gemini (gemini.google.com)\n• Integrated with Google Search for up-to-date information\n• Tip: Great for cards needing current info like \"2025 current affairs vocabulary\"\n• Best for: Cards requiring latest trends\n\nClaude (claude.ai)\n• Excellent at handling long text and generating accurate JSON\n• Tip: Can create 100 cards at once without breaking the JSON format\n• Best for: Bulk generation, complex card structures\n\nCommon Tips:\n• If AI fails to call the API → Ask \"Just show me the JSON data.\" Then copy it and use the manual registration method (see next section)\n• Say \"Create 50 more without overlapping previous cards\" for continuous additions\n• Maximum 100 cards per request. For more, split into multiple requests"
        },
        "step4Manual": {
          "title": "When AI Can't Call the API Directly (Manual Method)",
          "body": "If the AI can't call the API directly, don't worry!\nJust copy the JSON data the AI created and send it yourself.\n\nMethod 1: Swagger UI (Easiest, Recommended)\n1. Open https://reeeeecallstudy.xyz/api/ui in your browser\n2. Click \"Authorize\" at the top → Enter your API key → Confirm\n3. Find and expand POST /v1/decks/{deckId}/cards\n4. Click \"Try it out\"\n5. Enter your deck ID in the deckId field\n6. Paste the JSON array from AI into the Request body\n7. Click \"Execute\" → Done!\n\nMethod 2: Terminal / Command Prompt\nOpen Terminal (Mac) or PowerShell (Windows) and run:\n\ncurl -X POST \"https://reeeeecallstudy.xyz/api/v1/decks/YOUR_DECK_ID/cards\" \\\n  -H \"Authorization: Bearer rc_YOUR_API_KEY\" \\\n  -H \"Content-Type: application/json\" \\\n  -d '[{\"template_id\":\"YOUR_TEMPLATE_ID\",\"field_values\":{\"word\":\"apple\",\"meaning\":\"a round fruit\",\"example\":\"I eat an apple every day.\"},\"tags\":[\"beginner\"]}]'\n\nFor long JSON, save to a file first:\ncurl -X POST \"https://reeeeecallstudy.xyz/api/v1/decks/YOUR_DECK_ID/cards\" \\\n  -H \"Authorization: Bearer rc_YOUR_API_KEY\" \\\n  -H \"Content-Type: application/json\" \\\n  -d @cards.json\n\nMaximum 100 cards per request."
        },
        "docsPage": {
          "title": "Full API Documentation",
          "body": "For more detailed API information:\n\n• In-app API docs: \"API\" in the top menu or /api-docs\n• Swagger UI (interactive testing): https://reeeeecallstudy.xyz/api/ui\n• Public API docs: https://reeeeecallstudy.xyz/docs/api\n\nAll available endpoints:\n• Deck API: List, detail, create\n• Card API: List, detail, create (bulk supported), update, delete\n• Template API: List, detail, create, update, delete\n• Study API: Due cards, study history, statistics\n• Marketplace API: List, publish, delete\n• Sharing API: Create share, accept invite, list, revoke"
        },
        "rateLimits": {
          "title": "Rate Limits (Good to Know)",
          "body": "Request counts are limited for API stability.\n\nFree tier:\n• Daily API requests: 1,000\n• API calls per minute: 60\n• Card creates per minute: 30\n\nExceeding limits returns 429 Too Many Requests.\nWait a moment and try again.\n\nNote: 100 cards count as just 1 API call (bulk creation).\nWith 1,000 daily calls, you could theoretically create up to 100,000 cards per day!"
        }
      }
    },
    "tips": {
      "title": "Study Tips",
      "items": {
        "daily": {
          "title": "Study a Little Every Day",
          "body": "SRS is most effective with daily consistency. 10–20 minutes a day is enough. Fill up the study heatmap on your dashboard!"
        },
        "again": {
          "title": "Don't Be Afraid of Again",
          "body": "In SRS, 'Again' isn't failure. Honestly marking cards you don't remember as 'Again' helps the system show them at the right time. Forcing 'Good' actually reduces effectiveness."
        },
        "concise": {
          "title": "Keep Cards Concise",
          "body": "Put just one concept per card. Short, clear cards like 'apple = 사과' are far more effective than 'apple, pear, grape, strawberry...'."
        },
        "tags": {
          "title": "Use Tags",
          "body": "Add tags for quick filtering later. Examples: 'grammar', 'verbs', 'Chapter1', etc."
        }
      }
    }
  }
}
