{"0:abjure": {"vi_meaning": "từ bỏ", "vi_example": "Giám đốc điều hành quyết định cắt bỏ mọi quan hệ với nhà cung cấp gây tranh cãi.", "th_meaning": "งดออกเสียง", "th_example": "ซีอีโอตัดสินใจยกเลิกความสัมพันธ์ทั้งหมดกับซัพพลายเออร์ที่มีข้อขัดแย้ง", "id_meaning": "mengharamkan", "id_example": "CEO memutuskan untuk membatalkan semua hubungan dengan pemasok kontroversial tersebut."}, "1:abnegate": {"vi_meaning": "từ bỏ", "vi_example": "Cô chọn cách từ bỏ lợi ích cá nhân vì lợi ích của tập thể.", "th_meaning": "ละทิ้ง", "th_example": "เธอเลือกที่จะสละผลประโยชน์ส่วนตัวเพื่อประโยชน์ของทีม", "id_meaning": "melepaskan diri", "id_example": "Dia memilih untuk mengabaikan keuntungan pribadi demi kepentingan tim."}, "2:abrogate": {"vi_meaning": "bãi bỏ", "vi_example": "Hội đồng đã bỏ phiếu bãi bỏ chính sách việc làm lỗi thời.", "th_meaning": "ยกเลิก", "th_example": "คณะกรรมการลงมติให้ยกเลิกนโยบายการจ้างงานที่ล้าสมัย", "id_meaning": "membatalkan", "id_example": "Dewan memilih untuk membatalkan kebijakan ketenagakerjaan yang sudah ketinggalan zaman."}, "3:abstain": {"vi_meaning": "kiêng", "vi_example": "Một số giám đốc đã chọn bỏ phiếu trắng về việc sáp nhập.", "th_meaning": "งดเว้น", "th_example": "กรรมการหลายคนเลือกที่จะงดออกเสียงในการควบรวมกิจการ", "id_meaning": "menjauhkan diri", "id_example": "Beberapa direktur memilih abstain dalam pemungutan suara terkait merger tersebut."}, "4:accolade": {"vi_meaning": "giải thưởng", "vi_example": "Cô đã nhận được giải thưởng cao nhất cho nghiên cứu đột phá của mình.", "th_meaning": "รางวัล", "th_example": "เธอได้รับรางวัลสูงสุดจากการวิจัยที่ก้าวล้ำของเธอ", "id_meaning": "penghargaan", "id_example": "Dia menerima penghargaan tertinggi untuk penelitian inovatifnya."}, "5:acquiesce": {"vi_meaning": "bằng lòng", "vi_example": "Công đoàn không có lựa chọn nào khác ngoài việc chấp nhận các yêu cầu của ban quản lý.", "th_meaning": "ยอม", "th_example": "สหภาพแรงงานไม่มีทางเลือกนอกจากต้องยอมรับข้อเรียกร้องของฝ่ายบริหาร", "id_meaning": "menyetujui", "id_example": "Serikat pekerja tidak punya pilihan selain menyetujui tuntutan manajemen."}, "6:acrimonious": {"vi_meaning": "chua cay", "vi_example": "Tranh chấp gay gắt giữa các đối tác đã dẫn đến việc giải thể công ty.", "th_meaning": "เผ็ดร้อน", "th_example": "ข้อพิพาทที่รุนแรงระหว่างหุ้นส่วนนำไปสู่การยุบบริษัท", "id_meaning": "sengit", "id_example": "Perselisihan sengit antara mitra menyebabkan pembubaran perusahaan."}, "7:admonish": {"vi_meaning": "khiển trách", "vi_example": "Người giám sát đã phải khiển trách nhân viên vì liên tục đi trễ.", "th_meaning": "ตักเตือน", "th_example": "ผู้บังคับบัญชาต้องตักเตือนพนักงานว่ามาสายซ้ำแล้วซ้ำเล่า", "id_meaning": "menegur", "id_example": "Supervisor harus menegur karyawan tersebut jika terlambat berulang kali."}, "8:adversarial": {"vi_meaning": "đối địch", "vi_example": "Giọng điệu đối nghịch của các cuộc đàm phán đã cản trở mọi tiến bộ thực sự.", "th_meaning": "ฝ่ายตรงข้าม", "th_example": "น้ำเสียงที่เป็นปฏิปักษ์ของการเจรจาขัดขวางความก้าวหน้าที่แท้จริง", "id_meaning": "bermusuhan", "id_example": "Nada perundingan yang bersifat permusuhan menghambat kemajuan nyata."}, "9:aesthetic": {"vi_meaning": "thẩm mỹ", "vi_example": "Công ty đã đầu tư rất nhiều vào tính thẩm mỹ của sản phẩm.", "th_meaning": "เกี่ยวกับความงาม", "th_example": "บริษัทลงทุนมหาศาลเพื่อความสวยงามของผลิตภัณฑ์", "id_meaning": "estetis", "id_example": "Perusahaan berinvestasi besar-besaran pada daya tarik estetika produknya."}, "10:affable": {"vi_meaning": "niềm nở", "vi_example": "Phong cách niềm nở của anh ấy khiến anh ấy được lòng khách hàng và đồng nghiệp.", "th_meaning": "เป็นกันเอง", "th_example": "ท่าทางสุภาพของเขาทำให้เขาเป็นที่นิยมในหมู่ลูกค้าและเพื่อนร่วมงาน", "id_meaning": "ramah", "id_example": "Sikapnya yang ramah membuatnya populer di kalangan klien dan kolega."}, "11:aggregate": {"vi_meaning": "tổng hợp", "vi_example": "Tổng doanh thu từ tất cả các bộ phận vượt quá mong đợi trong quý này.", "th_meaning": "รวม", "th_example": "รายได้รวมจากทุกแผนกเกินความคาดหมายในไตรมาสนี้", "id_meaning": "agregat", "id_example": "Pendapatan agregat dari semua divisi melampaui ekspektasi pada kuartal ini."}, "12:albeit": {"vi_meaning": "mặc dù", "vi_example": "Đề xuất đã được chấp nhận, mặc dù có một số sửa đổi quan trọng.", "th_meaning": "แม้ว่า", "th_example": "ข้อเสนอนี้ได้รับการยอมรับแล้ว แม้ว่าจะมีการแก้ไขที่สำคัญหลายประการก็ตาม", "id_meaning": "walaupun", "id_example": "Proposal tersebut diterima, meskipun dengan beberapa perubahan penting."}, "13:allocate": {"vi_meaning": "phân bổ", "vi_example": "Ban quản lý quyết định phân bổ kinh phí bổ sung cho bộ phận nghiên cứu.", "th_meaning": "จัดสรร", "th_example": "ฝ่ายบริหารตัดสินใจจัดสรรเงินทุนเพิ่มเติมให้กับแผนกวิจัย", "id_meaning": "mengalokasikan", "id_example": "Manajemen memutuskan untuk mengalokasikan dana tambahan ke departemen penelitian."}, "14:allude": {"vi_meaning": "ám chỉ", "vi_example": "Người nói không trực tiếp đề cập đến mà ám chỉ đến đợt sa thải sắp tới.", "th_meaning": "พาดพิง", "th_example": "วิทยากรไม่ได้กล่าวถึงโดยตรง แต่เป็นการพาดพิงถึงการเลิกจ้างที่กำลังจะเกิดขึ้น", "id_meaning": "menyinggung", "id_example": "Pembicara tidak menyebutkan secara langsung tetapi menyinggung PHK yang akan terjadi."}, "15:amalgamate": {"vi_meaning": "hỗn hợp", "vi_example": "Hai công ty đã đồng ý hợp nhất hoạt động của họ trong năm tài chính tới.", "th_meaning": "การควบรวมกิจการ", "th_example": "บริษัททั้งสองตกลงที่จะควบรวมการดำเนินงานในปีงบประมาณหน้า", "id_meaning": "menggabungkan", "id_example": "Kedua perusahaan sepakat untuk menggabungkan operasi mereka pada tahun fiskal depan."}, "16:ambiguous": {"vi_meaning": "mơ hồ", "vi_example": "Ngôn ngữ hợp đồng được cố tình mơ hồ để cho phép giải thích linh hoạt.", "th_meaning": "ไม่ชัดเจน", "th_example": "ภาษาสัญญามีความคลุมเครืออย่างจงใจเพื่อให้สามารถตีความได้อย่างยืดหยุ่น", "id_meaning": "ambigu", "id_example": "Bahasa kontrak sengaja dibuat ambigu untuk memungkinkan interpretasi yang fleksibel."}, "17:ameliorate": {"vi_meaning": "cải thiện", "vi_example": "Các chính sách mới được đưa ra nhằm cải thiện điều kiện làm việc trong các nhà máy.", "th_meaning": "ผดุง", "th_example": "มีการนำเสนอนโยบายใหม่เพื่อปรับปรุงสภาพการทำงานในโรงงาน", "id_meaning": "memperbaiki", "id_example": "Kebijakan baru diperkenalkan untuk memperbaiki kondisi kerja di pabrik."}, "18:amicable": {"vi_meaning": "thân thiện", "vi_example": "Cả hai bên đã đạt được thỏa thuận hòa giải mà không cần ra tòa.", "th_meaning": "เป็นกันเอง", "th_example": "ทั้งสองฝ่ายบรรลุข้อตกลงฉันมิตรโดยไม่ต้องขึ้นศาล", "id_meaning": "ramah tamah", "id_example": "Kedua belah pihak mencapai penyelesaian secara damai tanpa melalui pengadilan."}, "19:analogous": {"vi_meaning": "tương tự", "vi_example": "Tình hình tương tự như những gì đã xảy ra trong cuộc suy thoái trước đó.", "th_meaning": "คล้ายคลึงกัน", "th_example": "สถานการณ์คล้ายคลึงกับสิ่งที่เกิดขึ้นในช่วงภาวะเศรษฐกิจถดถอยครั้งก่อน", "id_meaning": "sejalan", "id_example": "Situasi ini analog dengan apa yang terjadi pada resesi sebelumnya."}, "20:ancillary": {"vi_meaning": "phụ trợ", "vi_example": "Các dịch vụ phụ trợ như phục vụ ăn uống và dọn dẹp đều được thuê ngoài hoàn toàn.", "th_meaning": "อุปกรณ์เสริม", "th_example": "บริการเสริมเช่นการจัดเลี้ยงและการทำความสะอาดได้รับการว่าจ้างจากภายนอกทั้งหมด", "id_meaning": "tambahan", "id_example": "Layanan tambahan seperti katering dan pembersihan sepenuhnya dialihdayakan."}, "21:anomaly": {"vi_meaning": "sự bất thường", "vi_example": "Các kiểm toán viên đã đánh dấu giao dịch này là một bất thường về tài chính đáng để điều tra.", "th_meaning": "ความผิดปกติ", "th_example": "ผู้ตรวจสอบบัญชีระบุว่าการทำธุรกรรมดังกล่าวเป็นความผิดปกติทางการเงินที่ควรค่าแก่การตรวจสอบ", "id_meaning": "anomali", "id_example": "Auditor menandai transaksi tersebut sebagai anomali keuangan yang perlu diselidiki."}, "22:antagonize": {"vi_meaning": "chống đối", "vi_example": "Quy định mới có thể gây phản cảm đối với các chủ doanh nghiệp nhỏ trên toàn khu vực.", "th_meaning": "เป็นปฏิปักษ์", "th_example": "กฎระเบียบใหม่อาจทำให้เจ้าของธุรกิจขนาดเล็กทั่วทั้งภูมิภาคเป็นศัตรูกัน", "id_meaning": "bermusuhan", "id_example": "Peraturan baru ini dapat menimbulkan kebencian terhadap pemilik usaha kecil di seluruh wilayah."}, "23:antithesis": {"vi_meaning": "phản đề", "vi_example": "Phong cách quản lý của anh ấy trái ngược với phương pháp hợp tác mà chúng tôi ưa thích.", "th_meaning": "สิ่งที่ตรงกันข้าม", "th_example": "สไตล์การบริหารจัดการของเขาเป็นสิ่งที่ตรงกันข้ามกับแนวทางการทำงานร่วมกันที่เราชอบ", "id_meaning": "antitesis", "id_example": "Gaya manajemennya merupakan kebalikan dari pendekatan kolaboratif yang kami sukai."}, "24:apathy": {"vi_meaning": "thờ ơ", "vi_example": "Sự thờ ơ của nhân viên đối với sáng kiến ​​mới là mối quan tâm lớn của ban lãnh đạo.", "th_meaning": "ไม่แยแส", "th_example": "ความไม่แยแสของพนักงานต่อความคิดริเริ่มใหม่เป็นปัญหาสำคัญสำหรับความเป็นผู้นำ", "id_meaning": "apati", "id_example": "Sikap apatis karyawan terhadap inisiatif baru ini merupakan kekhawatiran utama bagi para pemimpin."}, "25:appease": {"vi_meaning": "xoa dịu", "vi_example": "Công ty đã đề nghị hoàn lại tiền để xoa dịu những khách hàng không hài lòng sau đợt thu hồi.", "th_meaning": "เอาใจ", "th_example": "บริษัทเสนอการคืนเงินเพื่อเอาใจลูกค้าที่ไม่พอใจหลังจากการเรียกคืน", "id_meaning": "menenangkan", "id_example": "Perusahaan menawarkan pengembalian uang untuk menenangkan pelanggan yang tidak puas setelah penarikan kembali."}, "26:apprehensive": {"vi_meaning": "e ngại", "vi_example": "Các nhà đầu tư vẫn lo ngại về tình trạng bất ổn của các thị trường mới nổi.", "th_meaning": "วิตกกังวล", "th_example": "นักลงทุนยังคงวิตกเกี่ยวกับสถานะที่ผันผวนของตลาดเกิดใหม่", "id_meaning": "gelisah", "id_example": "Investor masih khawatir terhadap kondisi pasar negara berkembang yang bergejolak."}, "27:arbitrary": {"vi_meaning": "tùy ý", "vi_example": "Người quản lý bị chỉ trích vì đưa ra quyết định tùy tiện mà không tham khảo ý kiến.", "th_meaning": "โดยพลการ", "th_example": "ผู้จัดการถูกวิพากษ์วิจารณ์ว่าตัดสินใจโดยพลการโดยไม่ได้รับคำปรึกษา", "id_meaning": "sewenang-wenang", "id_example": "Manajer dikritik karena membuat keputusan sewenang-wenang tanpa konsultasi."}, "28:arduous": {"vi_meaning": "gian truân", "vi_example": "Quá trình đàm phán gian khổ kéo dài hơn sáu tháng.", "th_meaning": "ลำบาก", "th_example": "กระบวนการเจรจาที่ยากลำบากกินเวลานานกว่าหกเดือน", "id_meaning": "sulit", "id_example": "Proses negosiasi yang sulit ini berlangsung lebih dari enam bulan."}, "29:articulate": {"vi_meaning": "nói rõ ràng", "vi_example": "Cô ấy đã có thể trình bày rõ ràng tầm nhìn của công ty một cách rõ ràng.", "th_meaning": "พูดชัดแจ้ง", "th_example": "เธอสามารถถ่ายทอดวิสัยทัศน์ของบริษัทได้อย่างชัดเจนอย่างน่าทึ่ง", "id_meaning": "pandai berbicara", "id_example": "Dia mampu mengartikulasikan visi perusahaan dengan sangat jelas."}, "30:ascertain": {"vi_meaning": "xác định", "vi_example": "Nhóm cần xác định rõ nguyên nhân gốc rễ trước khi đề xuất giải pháp.", "th_meaning": "ตรวจสอบ", "th_example": "ทีมงานจำเป็นต้องค้นหาสาเหตุที่แท้จริงก่อนเสนอแนวทางแก้ไข", "id_meaning": "memastikan", "id_example": "Tim perlu memastikan akar permasalahan sebelum mengusulkan solusi."}, "31:aspire": {"vi_meaning": "khao khát", "vi_example": "Nhiều chuyên gia trẻ khao khát vai trò lãnh đạo trong các tập đoàn đa quốc gia.", "th_meaning": "ทะเยอทะยาน", "th_example": "มืออาชีพรุ่นใหม่จำนวนมากปรารถนาที่จะมีบทบาทเป็นผู้นำในบริษัทข้ามชาติ", "id_meaning": "bercita-cita", "id_example": "Banyak profesional muda bercita-cita menjadi pemimpin di perusahaan multinasional."}, "32:assertive": {"vi_meaning": "quyết đoán", "vi_example": "Phong cách giao tiếp quyết đoán là điều cần thiết để quản lý dự án hiệu quả.", "th_meaning": "กล้าแสดงออก", "th_example": "รูปแบบการสื่อสารที่กล้าแสดงออกเป็นสิ่งสำคัญสำหรับการจัดการโครงการที่มีประสิทธิภาพ", "id_meaning": "asertif", "id_example": "Gaya komunikasi yang tegas sangat penting untuk manajemen proyek yang efektif."}, "33:astute": {"vi_meaning": "sắc sảo", "vi_example": "Nhà đầu tư sắc sảo đã nhận ra cơ hội trước khi bất kỳ ai khác nhận ra.", "th_meaning": "ฉลาด", "th_example": "นักลงทุนที่ชาญฉลาดยอมรับโอกาสนี้ก่อนใครๆ", "id_meaning": "cerdik", "id_example": "Investor yang cerdik mengenali peluang tersebut sebelum orang lain menyadarinya."}, "34:attrition": {"vi_meaning": "sự hao mòn", "vi_example": "Tỷ lệ nghỉ việc cao buộc công ty phải điều chỉnh lại chiến lược giữ chân nhân viên.", "th_meaning": "การขัดสี", "th_example": "อัตราการออกจากงานที่สูงทำให้บริษัทต้องปรับปรุงกลยุทธ์การรักษาลูกค้า", "id_meaning": "erosi", "id_example": "Tingkat peralihan yang tinggi memaksa perusahaan untuk mengubah strategi retensinya."}, "35:audacious": {"vi_meaning": "táo bạo", "vi_example": "Kế hoạch táo bạo nhằm phá vỡ thị trường của công ty khởi nghiệp này đã thu hút các nhà đầu tư lớn.", "th_meaning": "กล้าหาญ", "th_example": "แผนการอันกล้าหาญของสตาร์ทอัพที่จะพลิกโฉมตลาดดึงดูดนักลงทุนรายใหญ่", "id_meaning": "berani", "id_example": "Rencana berani startup ini untuk mengganggu pasar menarik investor besar."}, "36:auspicious": {"vi_meaning": "tốt lành", "vi_example": "Thu nhập hàng quý mạnh mẽ là một dấu hiệu tốt lành cho CEO mới.", "th_meaning": "เป็นมงคล", "th_example": "ผลประกอบการรายไตรมาสที่แข็งแกร่งถือเป็นสัญญาณอันดีสำหรับซีอีโอคนใหม่", "id_meaning": "menguntungkan", "id_example": "Pendapatan kuartalan yang kuat merupakan pertanda baik bagi CEO baru."}, "37:austere": {"vi_meaning": "khắc khổ", "vi_example": "Công ty đã áp dụng các biện pháp ngân sách khắc khổ trong thời kỳ kinh tế suy thoái.", "th_meaning": "เคร่งครัด", "th_example": "บริษัทได้ใช้มาตรการด้านงบประมาณที่เข้มงวดในช่วงที่เศรษฐกิจตกต่ำ", "id_meaning": "keras", "id_example": "Perusahaan mengadopsi langkah-langkah penganggaran yang ketat selama krisis ekonomi."}, "38:autonomous": {"vi_meaning": "tự trị", "vi_example": "Mỗi văn phòng khu vực hoạt động như một đơn vị tự trị với quyền ra quyết định tại địa phương.", "th_meaning": "เป็นอิสระ", "th_example": "สำนักงานภูมิภาคแต่ละแห่งดำเนินงานเป็นหน่วยงานอิสระและมีการตัดสินใจในท้องถิ่น", "id_meaning": "otonom", "id_example": "Setiap kantor regional beroperasi sebagai unit otonom dengan pengambilan keputusan lokal."}, "39:aversion": {"vi_meaning": "ác cảm", "vi_example": "Hội đồng quản trị bày tỏ sự phản đối mạnh mẽ đối với bất kỳ hình thức tiếp quản thù địch nào.", "th_meaning": "ความเกลียดชัง", "th_example": "คณะกรรมการแสดงความรังเกียจอย่างยิ่งต่อการเทคโอเวอร์ที่ไม่เป็นมิตรทุกรูปแบบ", "id_meaning": "keengganan", "id_example": "Dewan menyatakan penolakan yang kuat terhadap segala bentuk pengambilalihan yang tidak bersahabat."}, "40:axiom": {"vi_meaning": "tiên đề", "vi_example": "Đó là một tiên đề kinh doanh cho rằng sự hài lòng của khách hàng sẽ thúc đẩy lợi nhuận lâu dài.", "th_meaning": "สัจพจน์", "th_example": "เป็นสัจพจน์ทางธุรกิจที่ว่าความพึงพอใจของลูกค้าเป็นตัวขับเคลื่อนความสามารถในการทำกำไรในระยะยาว", "id_meaning": "aksioma", "id_example": "Ini adalah aksioma bisnis bahwa kepuasan pelanggan mendorong profitabilitas jangka panjang."}, "41:belated": {"vi_meaning": "muộn màng", "vi_example": "Phản ứng muộn màng trước cuộc khủng hoảng đã làm tổn hại đến hình ảnh của công ty trước công chúng.", "th_meaning": "ล่าช้า", "th_example": "การตอบสนองที่ล่าช้าต่อวิกฤติได้ทำลายภาพลักษณ์ของบริษัท", "id_meaning": "terlambat", "id_example": "Respons yang terlambat terhadap krisis ini merusak citra perusahaan di mata masyarakat."}, "42:benevolent": {"vi_meaning": "nhân từ", "vi_example": "Người sáng lập từ thiện đã thành lập quỹ học bổng cho học sinh có hoàn cảnh khó khăn.", "th_meaning": "มีเมตตา", "th_example": "ผู้ก่อตั้งใจดีได้จัดตั้งกองทุนทุนการศึกษาสำหรับนักเรียนที่ด้อยโอกาส", "id_meaning": "penuh kebajikan", "id_example": "Pendiri yang baik hati ini mendirikan dana beasiswa untuk siswa kurang mampu."}, "43:bilateral": {"vi_meaning": "song phương", "vi_example": "Hiệp định thương mại song phương mang lại lợi ích cho lĩnh vực sản xuất của cả hai quốc gia.", "th_meaning": "ทวิภาคี", "th_example": "ข้อตกลงการค้าทวิภาคีเป็นประโยชน์ต่อภาคการผลิตของทั้งสองประเทศ", "id_meaning": "bilateral", "id_example": "Perjanjian perdagangan bilateral menguntungkan sektor manufaktur kedua negara."}, "44:bolster": {"vi_meaning": "củng cố", "vi_example": "Bằng chứng mới đã được đưa ra để củng cố lập luận của nhóm pháp lý.", "th_meaning": "หมอนข้าง", "th_example": "มีการนำเสนอหลักฐานใหม่เพื่อสนับสนุนข้อโต้แย้งของทีมกฎหมาย", "id_meaning": "memperkuat", "id_example": "Bukti-bukti baru dihadirkan untuk memperkuat argumentasi tim kuasa hukum."}, "45:brevity": {"vi_meaning": "ngắn gọn", "vi_example": "Nhà tư vấn được khen ngợi vì sự ngắn gọn và rõ ràng trong báo cáo của cô ấy.", "th_meaning": "ความกะทัดรัด", "th_example": "ที่ปรึกษาได้รับการยกย่องในเรื่องความกระชับและความชัดเจนของรายงานของเธอ", "id_meaning": "keringkasan", "id_example": "Konsultan tersebut dipuji karena singkatnya dan kejelasan laporannya."}, "46:bureaucratic": {"vi_meaning": "quan liêu", "vi_example": "Các thủ tục quan liêu quá mức đã làm chậm đáng kể quá trình phê duyệt sản phẩm.", "th_meaning": "ระบบราชการ", "th_example": "กระบวนการราชการที่มากเกินไปทำให้กระบวนการอนุมัติผลิตภัณฑ์ช้าลงอย่างมาก", "id_meaning": "birokratis", "id_example": "Prosedur birokrasi yang berlebihan memperlambat proses persetujuan produk secara signifikan."}, "47:burgeon": {"vi_meaning": "đang phát triển", "vi_example": "Lĩnh vực công nghệ tiếp tục phát triển bất chấp những bất ổn kinh tế toàn cầu.", "th_meaning": "ออกดอก", "th_example": "ภาคเทคโนโลยียังคงเติบโตอย่างต่อเนื่อง แม้ว่าเศรษฐกิจโลกจะมีความไม่แน่นอนก็ตาม", "id_meaning": "berkembang", "id_example": "Sektor teknologi terus berkembang meskipun ada ketidakpastian ekonomi global."}, "48:candid": {"vi_meaning": "thẳng thắn", "vi_example": "Giám đốc điều hành đã đưa ra đánh giá thẳng thắn về những thách thức tài chính của công ty.", "th_meaning": "ตรงไปตรงมา", "th_example": "CEO ให้การประเมินความท้าทายทางการเงินของบริษัทอย่างตรงไปตรงมา", "id_meaning": "jujur", "id_example": "CEO memberikan penilaian jujur ​​terhadap tantangan keuangan perusahaan."}, "49:capitalize": {"vi_meaning": "viết hoa", "vi_example": "Công ty đã nhanh chóng tận dụng các điều kiện thị trường thuận lợi.", "th_meaning": "ใช้ทุน", "th_example": "บริษัทดำเนินการอย่างรวดเร็วเพื่อใช้ประโยชน์จากสภาวะตลาดที่เอื้ออำนวย", "id_meaning": "menggunakan huruf besar", "id_example": "Perusahaan bergerak cepat untuk memanfaatkan kondisi pasar yang menguntungkan."}, "50:capacious": {"vi_meaning": "có sức chứa", "vi_example": "Nhà kho mới rộng rãi có thể chứa gấp đôi lượng hàng tồn kho hiện tại của chúng tôi.", "th_meaning": "กว้างขวาง", "th_example": "คลังสินค้าใหม่ที่มีความจุกว้างขวางนี้สามารถรองรับสินค้าคงคลังปัจจุบันของเราได้เป็นสองเท่า", "id_meaning": "luas", "id_example": "Gudang baru yang luas ini dapat menampung dua kali lipat inventaris kami saat ini."}, "51:catalyze": {"vi_meaning": "xúc tác", "vi_example": "Việc sáp nhập dự kiến ​​​​sẽ thúc đẩy sự đổi mới trên cả hai tổ chức.", "th_meaning": "กระตุ้น", "th_example": "การควบรวมกิจการนี้คาดว่าจะช่วยกระตุ้นนวัตกรรมทั่วทั้งองค์กรทั้งสอง", "id_meaning": "mengkatalisis", "id_example": "Penggabungan ini diharapkan dapat mengkatalisasi inovasi di kedua organisasi."}, "52:caustic": {"vi_meaning": "chất ăn da", "vi_example": "Những nhận xét cay đắng của ông về đề xuất này đã xúc phạm một số thành viên hội đồng quản trị.", "th_meaning": "กัดกร่อน", "th_example": "คำพูดที่กัดกร่อนของเขาเกี่ยวกับข้อเสนอนี้ทำให้สมาชิกคณะกรรมการหลายคนขุ่นเคือง", "id_meaning": "pedas", "id_example": "Pernyataan pedasnya mengenai usulan tersebut menyinggung beberapa anggota dewan."}, "53:caveat": {"vi_meaning": "báo trước", "vi_example": "Luật sư đã thêm một cảnh báo quan trọng vào các điều khoản của thỏa thuận.", "th_meaning": "ข้อแม้", "th_example": "ทนายความได้เพิ่มคำเตือนที่สำคัญในเงื่อนไขของข้อตกลง", "id_meaning": "peringatan", "id_example": "Pengacara menambahkan peringatan penting pada ketentuan perjanjian."}, "54:cede": {"vi_meaning": "nhượng lại", "vi_example": "Công ty buộc phải nhường lại thị phần cho các đối thủ cạnh tranh mới mạnh mẽ.", "th_meaning": "ยกให้", "th_example": "บริษัทถูกบังคับให้ยกส่วนแบ่งการตลาดให้กับคู่แข่งรายใหม่ที่ก้าวร้าว", "id_meaning": "menyerahkan", "id_example": "Perusahaan terpaksa menyerahkan pangsa pasarnya kepada pesaing baru yang agresif."}, "55:circumscribe": {"vi_meaning": "giới hạn", "vi_example": "Các quy định giới hạn phạm vi hoạt động được phép của cố vấn tài chính.", "th_meaning": "จำกัดขอบเขต", "th_example": "กฎระเบียบจำกัดขอบเขตของกิจกรรมที่ได้รับอนุญาตสำหรับที่ปรึกษาทางการเงิน", "id_meaning": "membatasi", "id_example": "Peraturan membatasi rentang aktivitas yang diizinkan bagi penasihat keuangan."}, "56:circumvent": {"vi_meaning": "tránh né", "vi_example": "Công ty đã tìm ra cách để lách các quy định hạn chế thương mại.", "th_meaning": "หลีกเลี่ยง", "th_example": "บริษัทพบวิธีหลีกเลี่ยงกฎเกณฑ์ทางการค้าที่เข้มงวด", "id_meaning": "mengelakkan", "id_example": "Perusahaan menemukan cara untuk menghindari peraturan perdagangan yang membatasi."}, "57:clandestine": {"vi_meaning": "bí mật", "vi_example": "Cuộc gặp bí mật giữa các giám đốc điều hành làm dấy lên lo ngại về giao dịch nội gián.", "th_meaning": "ลับๆ", "th_example": "การประชุมลับระหว่างผู้บริหารทำให้เกิดความกังวลเกี่ยวกับการซื้อขายหลักทรัพย์โดยใช้ข้อมูลภายใน", "id_meaning": "rahasia", "id_example": "Pertemuan rahasia antara para eksekutif menimbulkan kekhawatiran mengenai insider trading."}, "58:coalesce": {"vi_meaning": "kết lại", "vi_example": "Nhiều bộ phận khác nhau bắt đầu liên kết lại xung quanh tầm nhìn chiến lược mới.", "th_meaning": "รวมตัวกัน", "th_example": "หน่วยงานต่างๆ เริ่มรวมตัวกันตามวิสัยทัศน์เชิงกลยุทธ์ใหม่", "id_meaning": "bersatu", "id_example": "Berbagai departemen mulai bersatu dalam visi strategis baru."}, "59:coerce": {"vi_meaning": "ép buộc", "vi_example": "Không nhân viên nào bị ép buộc ký hợp đồng bất lợi.", "th_meaning": "บังคับ", "th_example": "ไม่ควรบังคับให้พนักงานลงนามในสัญญาที่ไม่เอื้ออำนวย", "id_meaning": "memaksa", "id_example": "Tidak ada karyawan yang boleh dipaksa menandatangani kontrak yang tidak menguntungkan."}, "60:cogent": {"vi_meaning": "thuyết phục", "vi_example": "Nhà tư vấn đã trình bày một lập luận thuyết phục về việc tái cơ cấu chuỗi cung ứng.", "th_meaning": "ตรงประเด็น", "th_example": "ที่ปรึกษาได้นำเสนอข้อโต้แย้งที่สำคัญสำหรับการปรับโครงสร้างห่วงโซ่อุปทาน", "id_meaning": "kuat", "id_example": "Konsultan menyampaikan argumen yang kuat untuk merestrukturisasi rantai pasokan."}, "61:cohesive": {"vi_meaning": "gắn kết", "vi_example": "Xây dựng một nhóm gắn kết đòi hỏi sự tin tưởng, giao tiếp và chia sẻ mục tiêu.", "th_meaning": "เหนียว", "th_example": "การสร้างทีมที่เหนียวแน่นต้องอาศัยความไว้วางใจ การสื่อสาร และเป้าหมายร่วมกัน", "id_meaning": "kompak", "id_example": "Membangun tim yang kohesif membutuhkan kepercayaan, komunikasi, dan tujuan bersama."}, "62:commensurate": {"vi_meaning": "tương xứng", "vi_example": "Mức lương được đưa ra tương xứng với kinh nghiệm dày dặn trong ngành của cô.", "th_meaning": "สมส่วน", "th_example": "เงินเดือนที่เสนอนั้นเหมาะสมกับประสบการณ์ในอุตสาหกรรมที่กว้างขวางของเธอ", "id_meaning": "sepadan", "id_example": "Gaji yang ditawarkan sepadan dengan pengalaman industrinya yang luas."}, "63:compelling": {"vi_meaning": "thuyết phục", "vi_example": "Nhóm tiếp thị đã tạo ra một câu chuyện hấp dẫn xung quanh việc ra mắt sản phẩm mới.", "th_meaning": "น่าสนใจ", "th_example": "ทีมการตลาดสร้างเรื่องราวที่น่าสนใจเกี่ยวกับการเปิดตัวผลิตภัณฑ์ใหม่", "id_meaning": "menarik", "id_example": "Tim pemasaran menciptakan narasi menarik seputar peluncuran produk baru."}, "64:complacent": {"vi_meaning": "tự mãn", "vi_example": "Công ty đã phát triển một cách tự mãn sau nhiều năm thống trị thị trường không bị thách thức.", "th_meaning": "พึงพอใจ", "th_example": "บริษัทเริ่มพึงพอใจมากขึ้นหลังจากครองตลาดอย่างไม่มีใครทักท้วงมานานหลายปี", "id_meaning": "berpuas diri", "id_example": "Perusahaan semakin berpuas diri setelah bertahun-tahun mendominasi pasar tanpa tertandingi."}, "65:complement": {"vi_meaning": "bổ sung", "vi_example": "Phần mềm mới bổ sung hoàn hảo cho cơ sở hạ tầng phần cứng hiện có.", "th_meaning": "เสริม", "th_example": "ซอฟต์แวร์ใหม่นี้ช่วยเสริมโครงสร้างพื้นฐานฮาร์ดแวร์ที่มีอยู่ได้อย่างสมบูรณ์แบบ", "id_meaning": "melengkapi", "id_example": "Perangkat lunak baru ini secara sempurna melengkapi infrastruktur perangkat keras yang ada."}, "66:compliance": {"vi_meaning": "Tuân thủ", "vi_example": "Đảm bảo tuân thủ quy định là ưu tiên hàng đầu của các tổ chức tài chính.", "th_meaning": "การปฏิบัติตาม", "th_example": "การปฏิบัติตามกฎระเบียบเป็นสิ่งสำคัญที่สุดสำหรับสถาบันการเงิน", "id_meaning": "kepatuhan", "id_example": "Memastikan kepatuhan terhadap peraturan adalah prioritas utama bagi lembaga keuangan."}, "67:comprehensive": {"vi_meaning": "toàn diện", "vi_example": "Công ty đã tiến hành đánh giá toàn diện các giao thức bảo mật nội bộ của mình.", "th_meaning": "ครอบคลุม", "th_example": "บริษัทได้ทำการตรวจสอบโปรโตคอลความปลอดภัยภายในอย่างครอบคลุม", "id_meaning": "luas", "id_example": "Perusahaan tersebut melakukan tinjauan komprehensif terhadap protokol keamanan internalnya."}, "68:concede": {"vi_meaning": "thừa nhận", "vi_example": "Sau một thời gian dài cân nhắc, CEO đã phải thừa nhận quan điểm này.", "th_meaning": "ยอมรับ", "th_example": "หลังจากใคร่ครวญอยู่นาน CEO ก็ต้องยอมรับประเด็นนี้", "id_meaning": "mengakui", "id_example": "Setelah pertimbangan panjang, CEO harus mengakui maksudnya."}, "69:conciliatory": {"vi_meaning": "hòa giải", "vi_example": "Người quản lý đã áp dụng giọng điệu hòa giải để giải quyết xung đột tại nơi làm việc.", "th_meaning": "ประนีประนอม", "th_example": "ผู้จัดการใช้น้ำเสียงประนีประนอมเพื่อแก้ไขข้อขัดแย้งในที่ทำงาน", "id_meaning": "bersifat mendamaikan", "id_example": "Manajer mengadopsi nada perdamaian untuk menyelesaikan konflik di tempat kerja."}, "70:concurrent": {"vi_meaning": "đồng thời", "vi_example": "Công ty quản lý ba đợt ra mắt sản phẩm đồng thời trên các thị trường khác nhau.", "th_meaning": "พร้อมกัน", "th_example": "บริษัทจัดการเปิดตัวผลิตภัณฑ์พร้อมกันสามรายการในตลาดต่างๆ", "id_meaning": "bersamaan", "id_example": "Perusahaan mengelola tiga peluncuran produk secara bersamaan di pasar yang berbeda."}, "71:condone": {"vi_meaning": "tha", "vi_example": "Tổ chức không tha thứ cho bất kỳ hình thức hành vi phân biệt đối xử nào.", "th_meaning": "ให้อภัย", "th_example": "องค์กรไม่ยอมรับพฤติกรรมการเลือกปฏิบัติทุกรูปแบบ", "id_meaning": "memaafkan", "id_example": "Organisasi tidak membenarkan segala bentuk perilaku diskriminatif."}, "72:conducive": {"vi_meaning": "thuận lợi", "vi_example": "Môi trường làm việc yên tĩnh có lợi cho năng suất cao hơn.", "th_meaning": "เอื้ออำนวย", "th_example": "สภาพแวดล้อมการทำงานที่เงียบสงบเอื้อต่อระดับการผลิตที่สูงขึ้น", "id_meaning": "kondusif", "id_example": "Lingkungan kerja yang tenang kondusif untuk tingkat produktivitas yang lebih tinggi."}, "73:confer": {"vi_meaning": "trao", "vi_example": "Hội đồng quản trị sẽ trao đổi với các cố vấn pháp lý trước khi đưa ra quyết định.", "th_meaning": "หารือ", "th_example": "คณะกรรมการจะหารือกับที่ปรึกษากฎหมายก่อนตัดสินใจ", "id_meaning": "memberi", "id_example": "Dewan akan berunding dengan penasihat hukum sebelum mengambil keputusan."}, "74:confluence": {"vi_meaning": "hợp lưu", "vi_example": "Sự hợp lưu của các xu hướng thị trường đã tạo ra một cơ hội đầu tư độc đáo.", "th_meaning": "จุดบรรจบกัน", "th_example": "การบรรจบกันของแนวโน้มของตลาดทำให้เกิดโอกาสในการลงทุนที่ไม่เหมือนใคร", "id_meaning": "pertemuan", "id_example": "Pertemuan tren pasar menciptakan peluang investasi yang unik."}, "75:conjecture": {"vi_meaning": "phỏng đoán", "vi_example": "Nếu không có dữ liệu cứng, mọi ước tính tại thời điểm này sẽ chỉ là phỏng đoán.", "th_meaning": "การคาดเดา", "th_example": "หากไม่มีข้อมูลที่หนักแน่น การประมาณการใด ๆ ก็เป็นเพียงการคาดเดา ณ จุดนี้", "id_meaning": "dugaan", "id_example": "Tanpa data pasti, perkiraan apa pun pada saat ini hanyalah dugaan belaka."}, "76:connotation": {"vi_meaning": "ý nghĩa", "vi_example": "Từ 'rẻ' có ý nghĩa tiêu cực trong bối cảnh tiếp thị và xây dựng thương hiệu.", "th_meaning": "ความหมายแฝง", "th_example": "คำว่า 'ถูก' มีความหมายเชิงลบในบริบททางการตลาดและการสร้างแบรนด์", "id_meaning": "konotasi", "id_example": "Kata 'murah' memiliki konotasi negatif dalam konteks pemasaran dan branding."}, "77:conscientious": {"vi_meaning": "tận tâm", "vi_example": "Cách tiếp cận tận tâm của cô để kiểm soát chất lượng đã ngăn ngừa được nhiều khiếm khuyết tiềm ẩn.", "th_meaning": "มีมโนธรรม", "th_example": "แนวทางการควบคุมคุณภาพอย่างมีมโนธรรมของเธอช่วยป้องกันข้อบกพร่องที่อาจเกิดขึ้นได้มากมาย", "id_meaning": "teliti", "id_example": "Pendekatannya yang cermat terhadap pengendalian kualitas mencegah banyak potensi cacat."}, "78:consensus": {"vi_meaning": "sự đồng thuận", "vi_example": "Ủy ban đã đạt được sự đồng thuận về việc phân bổ ngân sách đề xuất.", "th_meaning": "ฉันทามติ", "th_example": "คณะกรรมการมีมติเป็นเอกฉันท์เกี่ยวกับการจัดสรรงบประมาณที่เสนอ", "id_meaning": "konsensus", "id_example": "Panitia mencapai konsensus mengenai usulan alokasi anggaran."}, "79:consolidate": {"vi_meaning": "củng cố", "vi_example": "Công ty có kế hoạch hợp nhất ba văn phòng của mình thành một trụ sở duy nhất.", "th_meaning": "รวม", "th_example": "บริษัทวางแผนที่จะรวมสำนักงานทั้ง 3 แห่งให้เป็นสำนักงานใหญ่แห่งเดียว", "id_meaning": "mengkonsolidasikan", "id_example": "Perusahaan berencana untuk mengkonsolidasikan tiga kantornya menjadi satu kantor pusat."}, "80:conspicuous": {"vi_meaning": "dễ thấy", "vi_example": "Sự vắng mặt của CFO tại cuộc họp thường niên là điều dễ thấy.", "th_meaning": "เห็นได้ชัดเจน", "th_example": "การไม่มี CFO ในการประชุมประจำปีเป็นเรื่องที่เห็นได้ชัด", "id_meaning": "menyolok", "id_example": "Ketidakhadiran CFO pada pertemuan tahunan sangat mencolok."}, "81:construe": {"vi_meaning": "hiểu", "vi_example": "Bản ghi nhớ mơ hồ có thể được hiểu là sự chấp thuận ngầm cho kế hoạch.", "th_meaning": "ตีความ", "th_example": "บันทึกที่ไม่ชัดเจนอาจตีความได้ว่าเป็นการอนุมัติแผนโดยปริยาย", "id_meaning": "menafsirkan", "id_example": "Memo yang ambigu ini dapat ditafsirkan sebagai persetujuan diam-diam terhadap rencana tersebut."}, "82:contentious": {"vi_meaning": "gây tranh cãi", "vi_example": "Vấn đề gây tranh cãi về thù lao điều hành đã chi phối cuộc họp cổ đông.", "th_meaning": "เป็นที่ถกเถียงกัน", "th_example": "ประเด็นที่ถกเถียงกันเรื่องค่าตอบแทนผู้บริหารครอบงำที่ประชุมผู้ถือหุ้น", "id_meaning": "kontroversial", "id_example": "Permasalahan kontroversial mengenai kompensasi eksekutif mendominasi rapat pemegang saham."}, "83:contingent": {"vi_meaning": "ngẫu nhiên", "vi_example": "Thỏa thuận này phụ thuộc vào sự chấp thuận theo quy định từ ba cơ quan riêng biệt.", "th_meaning": "เกิดขึ้นโดยบังเอิญ", "th_example": "ข้อตกลงดังกล่าวขึ้นอยู่กับการอนุมัติด้านกฎระเบียบจากหน่วยงานสามแห่งที่แยกจากกัน", "id_meaning": "kontingen", "id_example": "Kesepakatan ini bergantung pada persetujuan peraturan dari tiga lembaga terpisah."}, "84:converge": {"vi_meaning": "hội tụ", "vi_example": "Nhiều yếu tố kinh tế đang hội tụ để tạo ra một môi trường kinh doanh đầy thách thức.", "th_meaning": "มาบรรจบกัน", "th_example": "ปัจจัยทางเศรษฐกิจหลายประการกำลังมาบรรจบกันเพื่อสร้างบรรยากาศทางธุรกิจที่ท้าทาย", "id_meaning": "bertemu", "id_example": "Berbagai faktor ekonomi bersatu untuk menciptakan iklim bisnis yang menantang."}, "85:convoluted": {"vi_meaning": "phức tạp", "vi_example": "Mã số thuế phức tạp gây khó khăn cho việc tuân thủ của các doanh nghiệp nhỏ.", "th_meaning": "ซับซ้อน", "th_example": "รหัสภาษีที่ซับซ้อนทำให้ธุรกิจขนาดเล็กปฏิบัติตามกฎระเบียบได้ยาก", "id_meaning": "membelit", "id_example": "Kode perpajakan yang berbelit-belit mempersulit kepatuhan usaha kecil."}, "86:copious": {"vi_meaning": "dồi dào", "vi_example": "Nhà nghiên cứu đã thu thập nhiều dữ liệu để hỗ trợ nghiên cứu khả thi.", "th_meaning": "มากมาย", "th_example": "ผู้วิจัยได้รวบรวมข้อมูลมากมายเพื่อสนับสนุนการศึกษาความเป็นไปได้", "id_meaning": "banyak sekali", "id_example": "Peneliti mengumpulkan banyak data untuk mendukung studi kelayakan."}, "87:corroborate": {"vi_meaning": "chứng thực", "vi_example": "Kiểm toán viên độc lập được thuê để chứng thực tính chính xác của báo cáo tài chính.", "th_meaning": "ยืนยัน", "th_example": "มีการว่าจ้างผู้ตรวจสอบอิสระเพื่อยืนยันความถูกต้องของรายงานทางการเงิน", "id_meaning": "menguatkan", "id_example": "Auditor independen dipekerjakan untuk menguatkan keakuratan laporan keuangan."}, "88:countermand": {"vi_meaning": "lệnh phản đối", "vi_example": "Giám đốc quyết định hủy bỏ mệnh lệnh trước đó do có thông tin mới.", "th_meaning": "ตอบโต้", "th_example": "ผู้อำนวยการเลือกที่จะโต้แย้งคำสั่งก่อนหน้าเนื่องจากมีข้อมูลใหม่", "id_meaning": "membatalkan perintah", "id_example": "Direktur memilih untuk membatalkan perintah sebelumnya karena informasi baru."}, "89:credence": {"vi_meaning": "sự tin cậy", "vi_example": "Phân tích thị trường chi tiết đã mang lại sự tin cậy cho chiến lược mở rộng được đề xuất.", "th_meaning": "ความน่าเชื่อถือ", "th_example": "การวิเคราะห์ตลาดโดยละเอียดให้ความเชื่อมั่นต่อกลยุทธ์การขยายธุรกิจที่นำเสนอ", "id_meaning": "kepercayaan", "id_example": "Analisis pasar yang terperinci memberikan kepercayaan pada strategi ekspansi yang diusulkan."}, "90:criterion": {"vi_meaning": "tiêu chí", "vi_example": "Sự hài lòng của khách hàng là tiêu chí hàng đầu để đánh giá chất lượng dịch vụ.", "th_meaning": "เกณฑ์", "th_example": "ความพึงพอใจของลูกค้าเป็นเกณฑ์หลักในการประเมินคุณภาพการบริการ", "id_meaning": "kriteria", "id_example": "Kepuasan pelanggan adalah kriteria utama untuk mengevaluasi kualitas layanan."}, "91:culminate": {"vi_meaning": "lên tới đỉnh điểm", "vi_example": "Nhiều năm lập kế hoạch chiến lược đã đạt đến đỉnh cao trong đợt IPO thành công vào quý trước.", "th_meaning": "สิ้นสุด", "th_example": "หลายปีของการวางแผนเชิงกลยุทธ์สิ้นสุดลงด้วยการเสนอขายหุ้น IPO ที่ประสบความสำเร็จในไตรมาสที่แล้ว", "id_meaning": "berujung", "id_example": "Perencanaan strategis selama bertahun-tahun mencapai puncaknya dengan IPO yang sukses pada kuartal terakhir."}, "92:curtail": {"vi_meaning": "cắt bớt", "vi_example": "Những hạn chế về ngân sách đã buộc Bộ phải cắt giảm các chương trình đào tạo của mình.", "th_meaning": "ลดทอน", "th_example": "ข้อจำกัดด้านงบประมาณทำให้แผนกต้องลดโปรแกรมการฝึกอบรมลง", "id_meaning": "mengurangi", "id_example": "Keterbatasan anggaran memaksa departemen untuk membatasi program pelatihannya."}, "93:dearth": {"vi_meaning": "sự khan hiếm", "vi_example": "Có rất ít ứng viên đủ tiêu chuẩn cho các vị trí kỹ sư cấp cao.", "th_meaning": "ความขาดแคลน", "th_example": "มีผู้สมัครที่มีคุณสมบัติเพียงพอสำหรับตำแหน่งวิศวกรอาวุโส", "id_meaning": "kelangkaan", "id_example": "Terdapat kekurangan kandidat yang memenuhi syarat untuk posisi teknik senior."}, "94:debacle": {"vi_meaning": "sự thất bại", "vi_example": "Sự thất bại trong việc ra mắt sản phẩm đã dẫn đến tổn thất tài chính đáng kể cho công ty.", "th_meaning": "น้ำท่วม", "th_example": "ความล้มเหลวในการเปิดตัวผลิตภัณฑ์ส่งผลให้เกิดความสูญเสียทางการเงินที่สำคัญสำหรับบริษัท", "id_meaning": "bencana", "id_example": "Kegagalan peluncuran produk mengakibatkan kerugian finansial yang signifikan bagi perusahaan."}, "95:decorum": {"vi_meaning": "trang nhã", "vi_example": "Sự trang trí chuyên nghiệp phải luôn được duy trì trong các cuộc gặp gỡ khách hàng.", "th_meaning": "การตกแต่ง", "th_example": "มารยาททางวิชาชีพควรได้รับการดูแลตลอดเวลาในระหว่างการประชุมกับลูกค้า", "id_meaning": "sopan santun", "id_example": "Kesopanan profesional harus dijaga setiap saat selama pertemuan klien."}, "96:deference": {"vi_meaning": "sự tôn trọng", "vi_example": "Để tôn trọng chủ tịch, tất cả các thành viên đều đứng dậy khi ông bước vào.", "th_meaning": "ความเคารพ", "th_example": "เพื่อเป็นการแสดงความเคารพต่อประธาน สมาชิกทุกคนจึงยืนขึ้นเมื่อเขาเข้ามา", "id_meaning": "rasa hormat", "id_example": "Untuk menghormati ketua, semua anggota berdiri ketika dia masuk."}, "97:delineate": {"vi_meaning": "phác họa", "vi_example": "Báo cáo phân định rõ trách nhiệm của từng thành viên trong nhóm.", "th_meaning": "วาดภาพ", "th_example": "รายงานระบุความรับผิดชอบของสมาชิกในทีมแต่ละคนอย่างชัดเจน", "id_meaning": "menggambarkan", "id_example": "Laporan tersebut dengan jelas menggambarkan tanggung jawab setiap anggota tim."}, "98:demeanor": {"vi_meaning": "thái độ", "vi_example": "Phong thái chuyên nghiệp của cô đã gây ấn tượng với người phỏng vấn trong quá trình tuyển chọn.", "th_meaning": "กิริยาท่าทาง", "th_example": "ท่าทางมืออาชีพของเธอสร้างความประทับใจให้กับผู้สัมภาษณ์ในระหว่างกระบวนการคัดเลือก", "id_meaning": "sikap", "id_example": "Sikap profesionalnya membuat pewawancara terkesan selama proses seleksi."}, "99:denounce": {"vi_meaning": "tố cáo", "vi_example": "Các nhóm người tiêu dùng đã nhanh chóng tố cáo các hành vi quảng cáo lừa đảo.", "th_meaning": "ประณาม", "th_example": "กลุ่มผู้บริโภครีบประณามการโฆษณาที่หลอกลวง", "id_meaning": "mencela", "id_example": "Kelompok konsumen dengan cepat mengecam praktik periklanan yang menipu tersebut."}, "100:deplete": {"vi_meaning": "cạn kiệt", "vi_example": "Việc chi tiêu quá mức cho tiếp thị sẽ làm cạn kiệt ngân sách hàng quý trước khi kết thúc.", "th_meaning": "หมดสิ้นลง", "th_example": "การใช้จ่ายด้านการตลาดมากเกินไปจะทำให้งบประมาณรายไตรมาสหมดลงก่อนที่จะสิ้นสุด", "id_meaning": "menguras", "id_example": "Pengeluaran berlebihan untuk pemasaran akan menghabiskan anggaran triwulanan sebelum berakhir."}, "101:deprecate": {"vi_meaning": "xin", "vi_example": "Các chuyên gia trong ngành không khuyến khích việc sử dụng các giao thức bảo mật lỗi thời.", "th_meaning": "เลิกใช้แล้ว", "th_example": "ผู้เชี่ยวชาญในอุตสาหกรรมเลิกใช้โปรโตคอลความปลอดภัยที่ล้าสมัย", "id_meaning": "mencela", "id_example": "Pakar industri mencela penggunaan protokol keamanan yang sudah ketinggalan zaman."}, "102:deride": {"vi_meaning": "chế nhạo", "vi_example": "Các nhà phê bình coi đề xuất này là không thực tế và không bền vững về mặt tài chính.", "th_meaning": "ดูถูก", "th_example": "นักวิจารณ์เยาะเย้ยข้อเสนอดังกล่าวว่าไม่สมจริงและไม่ยั่งยืนทางการเงิน", "id_meaning": "mengejek", "id_example": "Para kritikus mencemooh usulan tersebut sebagai hal yang tidak realistis dan tidak berkelanjutan secara finansial."}, "103:derivative": {"vi_meaning": "phái sinh", "vi_example": "Nhà phân tích cảnh báo rằng các sản phẩm tài chính phái sinh tiềm ẩn rủi ro đáng kể.", "th_meaning": "อนุพันธ์", "th_example": "นักวิเคราะห์เตือนว่าผลิตภัณฑ์ทางการเงินที่เป็นตราสารอนุพันธ์มีความเสี่ยงสูง", "id_meaning": "turunan", "id_example": "Analis memperingatkan bahwa produk keuangan derivatif membawa risiko yang signifikan."}, "104:desultory": {"vi_meaning": "phóng đãng", "vi_example": "Những nỗ lực cải cách chính sách mang tính rời rạc không mang lại kết quả có ý nghĩa.", "th_meaning": "สิ้นหวัง", "th_example": "ความพยายามอันสิ้นหวังในการปฏิรูปนโยบายไม่ได้ให้ผลลัพธ์ที่มีความหมาย", "id_meaning": "acak-acakan", "id_example": "Upaya-upaya yang gagal untuk mereformasi kebijakan tidak membuahkan hasil yang berarti."}, "105:deter": {"vi_meaning": "răn đe", "vi_example": "Các hình phạt nghiêm khắc được thiết kế để ngăn cản nhân viên vi phạm các quy tắc tuân thủ.", "th_meaning": "ยับยั้ง", "th_example": "บทลงโทษที่เข้มงวดได้รับการออกแบบมาเพื่อป้องกันไม่ให้พนักงานละเมิดกฎการปฏิบัติตามกฎระเบียบ", "id_meaning": "menghalangi", "id_example": "Hukuman yang ketat dirancang untuk mencegah karyawan melanggar aturan kepatuhan."}, "106:detrimental": {"vi_meaning": "có hại", "vi_example": "Căng thẳng kéo dài có thể gây bất lợi cho sức khỏe và hiệu suất làm việc của nhân viên.", "th_meaning": "เป็นอันตราย", "th_example": "ความเครียดที่ยืดเยื้ออาจส่งผลเสียต่อสุขภาพของพนักงานและประสิทธิภาพการทำงาน", "id_meaning": "merugikan", "id_example": "Stres yang berkepanjangan dapat berdampak buruk terhadap kesehatan dan kinerja karyawan."}, "107:diatribe": {"vi_meaning": "chỉ trích", "vi_example": "Cổ đông này đã đưa ra một lời chỉ trích dài dòng chống lại kế hoạch trả thưởng cho giám đốc điều hành.", "th_meaning": "ติเตียน", "th_example": "ผู้ถือหุ้นได้วิจารณ์แผนการจ่ายผลตอบแทนของผู้บริหารเป็นเวลานาน", "id_meaning": "cacian", "id_example": "Pemegang saham melontarkan kecaman panjang terhadap rencana kompensasi eksekutif."}, "108:dichotomy": {"vi_meaning": "sự phân đôi", "vi_example": "Có sự phân đôi rõ ràng giữa các giá trị và hành động đã nêu của công ty.", "th_meaning": "ขั้ว", "th_example": "มีการแบ่งขั้วที่ชัดเจนระหว่างค่านิยมและการกระทำของบริษัทที่ระบุไว้", "id_meaning": "pembelahan dua", "id_example": "Ada dikotomi yang jelas antara nilai-nilai dan tindakan yang dinyatakan perusahaan."}, "109:diffuse": {"vi_meaning": "khuếch tán", "vi_example": "Công ty đã cố gắng xoa dịu căng thẳng bằng cách đưa ra lời xin lỗi công khai.", "th_meaning": "กระจาย", "th_example": "บริษัทพยายามคลายความตึงเครียดด้วยการออกมาขอโทษต่อสาธารณะ", "id_meaning": "membaur", "id_example": "Perusahaan berusaha meredakan ketegangan dengan mengeluarkan permintaan maaf publik."}, "110:diligent": {"vi_meaning": "siêng năng", "vi_example": "Nghiên cứu siêng năng của cô đã phát hiện ra những sai sót nghiêm trọng trong các tuyên bố về bằng sáng chế của đối thủ cạnh tranh.", "th_meaning": "ขยัน", "th_example": "การวิจัยอย่างขยันขันแข็งของเธอได้เปิดเผยข้อบกพร่องที่สำคัญในการเรียกร้องสิทธิบัตรของคู่แข่ง", "id_meaning": "rajin", "id_example": "Penelitiannya yang tekun mengungkap kelemahan kritis dalam klaim paten pesaing."}, "111:diminish": {"vi_meaning": "giảm bớt", "vi_example": "Vụ bê bối đe dọa làm giảm niềm tin của công chúng vào lĩnh vực tài chính.", "th_meaning": "ลดน้อยลง", "th_example": "เรื่องอื้อฉาวดังกล่าวขู่ว่าจะลดความไว้วางใจของประชาชนในภาคการเงิน", "id_meaning": "mengurangi", "id_example": "Skandal tersebut mengancam akan menghilangkan kepercayaan masyarakat terhadap sektor keuangan."}, "112:discern": {"vi_meaning": "phân biệt", "vi_example": "Các nhà quản lý có kinh nghiệm có thể nhận ra những dấu hiệu tinh tế của tinh thần đồng đội đang suy giảm.", "th_meaning": "แยกแยะ", "th_example": "ผู้จัดการที่มีประสบการณ์สามารถมองเห็นสัญญาณเล็กๆ น้อยๆ ของขวัญกำลังใจของทีมที่ลดลงได้", "id_meaning": "melihat", "id_example": "Manajer yang berpengalaman dapat melihat tanda-tanda halus dari menurunnya semangat tim."}, "113:discrepancy": {"vi_meaning": "sự khác biệt", "vi_example": "Kiểm toán viên đã phát hiện ra sự khác biệt đáng kể giữa doanh thu báo cáo và doanh thu thực tế.", "th_meaning": "ความคลาดเคลื่อน", "th_example": "ผู้ตรวจสอบบัญชีค้นพบความแตกต่างที่สำคัญระหว่างรายได้ที่รายงานกับรายได้จริง", "id_meaning": "perbedaan", "id_example": "Auditor menemukan perbedaan yang signifikan antara pendapatan yang dilaporkan dan pendapatan aktual."}, "114:discretion": {"vi_meaning": "tùy ý", "vi_example": "Các nhà quản lý có toàn quyền quyết định cách phân bổ ngân sách của bộ phận mình.", "th_meaning": "ดุลยพินิจ", "th_example": "ผู้จัดการมีดุลยพินิจอย่างเต็มที่เกี่ยวกับวิธีการจัดสรรงบประมาณของแผนก", "id_meaning": "kebijaksanaan", "id_example": "Manajer mempunyai keleluasaan penuh dalam mengalokasikan anggaran departemennya."}, "115:disparage": {"vi_meaning": "chê bai", "vi_example": "Việc chê bai đối thủ cạnh tranh trước mặt khách hàng tiềm năng là không chuyên nghiệp.", "th_meaning": "ดูหมิ่น", "th_example": "การดูหมิ่นคู่แข่งต่อหน้าผู้มีโอกาสเป็นลูกค้าถือเป็นการกระทำที่ไม่เป็นมืออาชีพ", "id_meaning": "meremehkan", "id_example": "Tidak profesional meremehkan pesaing di depan klien potensial."}, "116:disparate": {"vi_meaning": "khác nhau", "vi_example": "Việc sáp nhập đã tập hợp hai nền văn hóa doanh nghiệp khác nhau dưới một mái nhà.", "th_meaning": "แตกต่างกัน", "th_example": "การควบรวมกิจการได้นำวัฒนธรรมองค์กรที่แตกต่างกันสองแห่งมารวมกันไว้ภายใต้หลังคาเดียวกัน", "id_meaning": "berbeda", "id_example": "Penggabungan ini menyatukan dua budaya perusahaan yang berbeda di bawah satu atap."}, "117:disparity": {"vi_meaning": "sự chênh lệch", "vi_example": "Sự chênh lệch về lương giữa các giám đốc điều hành và nhân viên cấp thấp tiếp tục gia tăng.", "th_meaning": "ความแตกต่าง", "th_example": "ความแตกต่างด้านค่าจ้างระหว่างผู้บริหารและพนักงานระดับเริ่มต้นยังคงกว้างขึ้น", "id_meaning": "perbedaan", "id_example": "Kesenjangan upah antara eksekutif dan staf tingkat pemula terus melebar."}, "118:disposition": {"vi_meaning": "bố trí", "vi_example": "Tính cách điềm tĩnh khiến anh ấy trở thành người lý tưởng để xử lý các cuộc đàm phán áp lực cao.", "th_meaning": "การจัดการ", "th_example": "นิสัยสงบของเขาทำให้เขาเหมาะอย่างยิ่งสำหรับการจัดการการเจรจาที่มีแรงกดดันสูง", "id_meaning": "watak", "id_example": "Wataknya yang tenang membuatnya ideal untuk menangani negosiasi bertekanan tinggi."}, "119:disproportionate": {"vi_meaning": "không cân xứng", "vi_example": "Một lượng ngân sách không cân xứng đã được phân bổ cho chi phí hành chính.", "th_meaning": "ไม่สมส่วน", "th_example": "มีการจัดสรรงบประมาณจำนวนที่ไม่สมส่วนให้กับค่าใช้จ่ายในการบริหาร", "id_meaning": "tidak proporsional", "id_example": "Jumlah anggaran yang tidak proporsional dialokasikan untuk biaya administrasi."}, "120:disseminate": {"vi_meaning": "phổ biến", "vi_example": "Đội ngũ tiếp thị đã làm việc để phổ biến thông tin sản phẩm trên tất cả các kênh.", "th_meaning": "เผยแพร่", "th_example": "ทีมการตลาดทำงานเพื่อเผยแพร่ข้อมูลผลิตภัณฑ์ในทุกช่องทาง", "id_meaning": "menyebarkan", "id_example": "Tim pemasaran bekerja untuk menyebarkan informasi produk ke semua saluran."}, "121:dissonance": {"vi_meaning": "sự bất hòa", "vi_example": "Có sự mâu thuẫn đáng chú ý giữa sứ mệnh của công ty và hoạt động của nó.", "th_meaning": "ความไม่ลงรอยกัน", "th_example": "มีความไม่สอดคล้องกันที่เห็นได้ชัดเจนระหว่างพันธกิจของบริษัทและแนวปฏิบัติของบริษัท", "id_meaning": "disonansi", "id_example": "Terdapat disonansi nyata antara misi perusahaan dan praktiknya."}, "122:diverge": {"vi_meaning": "phân ra", "vi_example": "Ý kiến ​​giữa các thành viên hội đồng quản trị bắt đầu khác nhau về các vấn đề chiến lược quan trọng.", "th_meaning": "แตกต่างออกไป", "th_example": "ความคิดเห็นระหว่างสมาชิกคณะกรรมการเริ่มแตกต่างกันในประเด็นเชิงกลยุทธ์ที่สำคัญ", "id_meaning": "menyimpang", "id_example": "Pendapat di antara anggota dewan mulai berbeda pendapat mengenai isu-isu strategis utama."}, "123:divest": {"vi_meaning": "thoái vốn", "vi_example": "Tập đoàn đã quyết định thoái vốn bộ phận bán lẻ hoạt động kém hiệu quả.", "th_meaning": "ขายออกไป", "th_example": "กลุ่มบริษัทตัดสินใจขายแผนกค้าปลีกที่มีประสิทธิภาพต่ำกว่าของตน", "id_meaning": "melepaskan", "id_example": "Konglomerat tersebut memutuskan untuk mendivestasikan divisi ritelnya yang berkinerja buruk."}, "124:doctrine": {"vi_meaning": "học thuyết", "vi_example": "Học thuyết của công ty về quyền riêng tư dữ liệu vượt quá các tiêu chuẩn tuân thủ của chính phủ.", "th_meaning": "หลักคำสอน", "th_example": "หลักคำสอนของบริษัทเกี่ยวกับความเป็นส่วนตัวของข้อมูลนั้นเกินกว่ามาตรฐานการปฏิบัติตามของรัฐบาล", "id_meaning": "doktrin", "id_example": "Doktrin perusahaan mengenai privasi data melebihi standar kepatuhan pemerintah."}, "125:dormant": {"vi_meaning": "nằm im", "vi_example": "Công ty con không hoạt động đã được tái hoạt động để theo đuổi các cơ hội thị trường mới nổi.", "th_meaning": "เฉยๆ", "th_example": "บริษัทสาขาที่ไม่มีการเคลื่อนไหวได้รับการเปิดใช้งานอีกครั้งเพื่อแสวงหาโอกาสในตลาดเกิดใหม่", "id_meaning": "terbengkalai", "id_example": "Anak perusahaan yang tidak aktif tersebut diaktifkan kembali untuk mengejar peluang pasar negara berkembang."}, "126:dubious": {"vi_meaning": "đáng ngờ", "vi_example": "Các nhà đầu tư vẫn còn nghi ngờ về tính khả thi của kế hoạch mở rộng đầy tham vọng.", "th_meaning": "น่าสงสัย", "th_example": "นักลงทุนยังคงไม่แน่ใจเกี่ยวกับความเป็นไปได้ของแผนการขยายธุรกิจที่มีความทะเยอทะยาน", "id_meaning": "meragukan", "id_example": "Investor masih meragukan kelayakan rencana ekspansi ambisius tersebut."}, "127:eclectic": {"vi_meaning": "chiết trung", "vi_example": "Phong cách quản lý chiết trung của CEO bắt nguồn từ nhiều triết lý lãnh đạo khác nhau.", "th_meaning": "ผสมผสาน", "th_example": "รูปแบบการบริหารจัดการแบบผสมผสานของ CEO มาจากปรัชญาความเป็นผู้นำที่หลากหลาย", "id_meaning": "eklektik", "id_example": "Gaya manajemen eklektik CEO diambil dari berbagai filosofi kepemimpinan."}, "128:efficacy": {"vi_meaning": "hiệu quả", "vi_example": "Các thử nghiệm lâm sàng đã xác nhận tính hiệu quả của sản phẩm dược phẩm mới.", "th_meaning": "ประสิทธิภาพ", "th_example": "การทดลองทางคลินิกยืนยันประสิทธิภาพของผลิตภัณฑ์ยาชนิดใหม่", "id_meaning": "kemanjuran", "id_example": "Uji klinis mengkonfirmasi kemanjuran produk farmasi baru ini."}, "129:egregious": {"vi_meaning": "nghiêm trọng", "vi_example": "Những sai sót kế toán nghiêm trọng đã dẫn đến một cuộc điều tra chính thức của các cơ quan quản lý.", "th_meaning": "ร้ายแรง", "th_example": "ข้อผิดพลาดทางบัญชีอันร้ายแรงนำไปสู่การสอบสวนอย่างเป็นทางการโดยหน่วยงานกำกับดูแล", "id_meaning": "mengerikan", "id_example": "Kesalahan akuntansi yang parah menyebabkan penyelidikan formal oleh regulator."}, "130:elaborate": {"vi_meaning": "phức tạp", "vi_example": "Nhà tư vấn được yêu cầu trình bày chi tiết về các chiến lược giảm chi phí được đề xuất.", "th_meaning": "ขยายความ", "th_example": "ที่ปรึกษาถูกขอให้อธิบายรายละเอียดเกี่ยวกับกลยุทธ์การลดต้นทุนที่นำเสนอ", "id_meaning": "menjelaskan", "id_example": "Konsultan diminta untuk menguraikan strategi pengurangan biaya yang diusulkan."}, "131:elicit": {"vi_meaning": "khơi gợi", "vi_example": "Cuộc khảo sát được thiết kế để thu thập phản hồi trung thực từ tất cả nhân viên.", "th_meaning": "ล้วงเอา", "th_example": "แบบสำรวจนี้ออกแบบมาเพื่อดึงเอาความคิดเห็นตอบรับอย่างตรงไปตรงมาจากพนักงานทุกคน", "id_meaning": "memperoleh", "id_example": "Survei ini dirancang untuk mendapatkan umpan balik yang jujur ​​dari seluruh karyawan."}, "132:eloquent": {"vi_meaning": "có tài hùng biện", "vi_example": "Chủ tịch có bài phát biểu hùng hồn tại đại hội cổ đông thường niên.", "th_meaning": "มีคารมคมคาย", "th_example": "ประธานกล่าวสุนทรพจน์ในการประชุมผู้ถือหุ้นประจำปี", "id_meaning": "fasih", "id_example": "Ketua menyampaikan pidato yang fasih pada konferensi pemegang saham tahunan."}, "133:elucidate": {"vi_meaning": "làm sáng tỏ", "vi_example": "Cố vấn tài chính đã dành thời gian để làm sáng tỏ chiến lược đầu tư phức tạp.", "th_meaning": "ชี้แจง", "th_example": "ที่ปรึกษาทางการเงินใช้เวลาในการชี้แจงกลยุทธ์การลงทุนที่ซับซ้อน", "id_meaning": "menjelaskan", "id_example": "Penasihat keuangan meluangkan waktu untuk menjelaskan strategi investasi yang kompleks."}, "134:emanate": {"vi_meaning": "phát ra", "vi_example": "Những hướng dẫn này xuất phát từ trụ sở công ty ở London.", "th_meaning": "เล็ดลอดออกมา", "th_example": "แนวทางเหล่านี้มาจากสำนักงานใหญ่ของบริษัทในลอนดอน", "id_meaning": "muncul", "id_example": "Pedoman ini berasal dari kantor pusat perusahaan di London."}, "135:embark": {"vi_meaning": "tham gia", "vi_example": "Công ty sắp bắt đầu hành trình chuyển đổi kỹ thuật số đầy tham vọng.", "th_meaning": "เริ่มดำเนินการ", "th_example": "บริษัทกำลังจะเริ่มต้นการเดินทางสู่การเปลี่ยนแปลงทางดิจิทัลอย่างทะเยอทะยาน", "id_meaning": "memulai", "id_example": "Perusahaan akan memulai perjalanan transformasi digital yang ambisius."}, "136:embody": {"vi_meaning": "hiện thân", "vi_example": "Dòng sản phẩm mới thể hiện cam kết của công ty về tính bền vững.", "th_meaning": "รวบรวม", "th_example": "กลุ่มผลิตภัณฑ์ใหม่สะท้อนให้เห็นถึงความมุ่งมั่นของบริษัทต่อความยั่งยืน", "id_meaning": "mewujudkan", "id_example": "Lini produk baru ini mewujudkan komitmen perusahaan terhadap keberlanjutan."}, "137:empirical": {"vi_meaning": "thực nghiệm", "vi_example": "Tất cả các kết luận phải được hỗ trợ bởi dữ liệu thực nghiệm và phân tích nghiêm ngặt.", "th_meaning": "เชิงประจักษ์", "th_example": "ข้อสรุปทั้งหมดต้องได้รับการสนับสนุนจากข้อมูลเชิงประจักษ์และการวิเคราะห์ที่เข้มงวด", "id_meaning": "empiris", "id_example": "Semua kesimpulan harus didukung oleh data empiris dan analisis yang cermat."}, "138:emulate": {"vi_meaning": "bắt chước", "vi_example": "Công ty khởi nghiệp đã tìm cách cạnh tranh với sự thành công của các công ty công nghệ hàng đầu.", "th_meaning": "เลียนแบบ", "th_example": "สตาร์ทอัพพยายามเลียนแบบความสำเร็จของบริษัทเทคโนโลยีชั้นนำ", "id_meaning": "meniru", "id_example": "Startup ini berusaha meniru kesuksesan perusahaan teknologi terkemuka."}, "139:encompass": {"vi_meaning": "bao gồm", "vi_example": "Chính sách mới sẽ bao gồm tất cả các khía cạnh về sức khỏe và an toàn tại nơi làm việc.", "th_meaning": "ห้อมล้อม", "th_example": "นโยบายใหม่จะครอบคลุมทุกแง่มุมของสุขภาพและความปลอดภัยในที่ทำงาน", "id_meaning": "mencakup", "id_example": "Kebijakan baru ini akan mencakup semua aspek kesehatan dan keselamatan di tempat kerja."}, "140:endeavor": {"vi_meaning": "nỗ lực", "vi_example": "Nỗ lực chung giữa hai công ty đã tạo ra những đổi mới đáng chú ý.", "th_meaning": "พยายาม", "th_example": "ความพยายามร่วมกันระหว่างทั้งสองบริษัททำให้เกิดนวัตกรรมที่โดดเด่น", "id_meaning": "berusaha keras", "id_example": "Upaya bersama antara kedua perusahaan menghasilkan inovasi yang luar biasa."}, "141:endorse": {"vi_meaning": "xác nhận", "vi_example": "Hội đồng quản trị nhất trí quyết định thông qua đề xuất tái cơ cấu của CEO.", "th_meaning": "รับรอง", "th_example": "คณะกรรมการมีมติเป็นเอกฉันท์อนุมัติข้อเสนอการปรับโครงสร้างซีอีโอ", "id_meaning": "mendukung", "id_example": "Dewan dengan suara bulat memutuskan untuk mendukung usulan restrukturisasi CEO."}, "142:enhance": {"vi_meaning": "nâng cao", "vi_example": "Chương trình đào tạo được thiết kế nhằm nâng cao năng lực lãnh đạo của nhân viên.", "th_meaning": "ยกระดับ", "th_example": "โปรแกรมการฝึกอบรมได้รับการออกแบบเพื่อเพิ่มขีดความสามารถในการเป็นผู้นำของพนักงาน", "id_meaning": "meningkatkan", "id_example": "Program pelatihan dirancang untuk meningkatkan kemampuan kepemimpinan karyawan."}, "143:enigmatic": {"vi_meaning": "bí ẩn", "vi_example": "Vị CEO bí ẩn hiếm khi trả lời phỏng vấn hay phát biểu trước công chúng.", "th_meaning": "ลึกลับ", "th_example": "ซีอีโอผู้ลึกลับไม่ค่อยให้สัมภาษณ์หรือแถลงต่อสาธารณะ", "id_meaning": "penuh teka-teki", "id_example": "CEO yang penuh teka-teki ini jarang memberikan wawancara atau pernyataan publik."}, "144:enumerate": {"vi_meaning": "liệt kê", "vi_example": "Báo cáo liệt kê những rủi ro chính liên quan đến việc mở rộng ra nước ngoài.", "th_meaning": "แจกแจง", "th_example": "รายงานระบุถึงความเสี่ยงหลักที่เกี่ยวข้องกับการขยายธุรกิจในต่างประเทศ", "id_meaning": "menghitung", "id_example": "Laporan ini menyebutkan risiko-risiko utama yang terkait dengan ekspansi ke luar negeri."}, "145:ephemeral": {"vi_meaning": "không lâu", "vi_example": "Sự gia tăng nhu cầu được chứng minh là phù du và nhanh chóng lắng xuống.", "th_meaning": "ชั่วคราว", "th_example": "ความต้องการที่เพิ่มขึ้นนั้นเกิดขึ้นเพียงชั่วคราวและลดลงอย่างรวดเร็ว", "id_meaning": "tdk kekal", "id_example": "Lonjakan permintaan terbukti hanya berlangsung sebentar dan mereda dengan cepat."}, "146:epitomize": {"vi_meaning": "tóm tắt", "vi_example": "Quỹ đạo sự nghiệp của cô là hình ảnh thu nhỏ của giá trị của sự kiên trì và làm việc chăm chỉ.", "th_meaning": "เป็นตัวอย่างที่ชัดเจน", "th_example": "เส้นทางอาชีพของเธอเป็นตัวอย่างที่ชัดเจนของคุณค่าของความอุตสาหะและการทำงานหนัก", "id_meaning": "melambangkan", "id_example": "Lintasan karirnya melambangkan nilai ketekunan dan kerja keras."}, "147:equitable": {"vi_meaning": "công bằng", "vi_example": "Ủy ban cố gắng tạo ra sự phân bổ nguồn lực một cách công bằng.", "th_meaning": "เท่าเทียมกัน", "th_example": "คณะกรรมการมุ่งมั่นที่จะสร้างการกระจายทรัพยากรอย่างเท่าเทียมกัน", "id_meaning": "adil", "id_example": "Komite berupaya menciptakan distribusi sumber daya yang adil."}, "148:equivocal": {"vi_meaning": "không phân minh", "vi_example": "Phản ứng không rõ ràng của CEO đối với vụ bê bối chỉ làm tăng thêm sự nghi ngờ của công chúng.", "th_meaning": "ไม่ชัดเจน", "th_example": "การตอบสนองอย่างคลุมเครือของ CEO ต่อเรื่องอื้อฉาวนี้มีแต่ทำให้สาธารณชนเกิดความสงสัยมากขึ้นเท่านั้น", "id_meaning": "samar", "id_example": "Tanggapan samar CEO terhadap skandal tersebut hanya memperdalam kecurigaan publik."}, "149:eradicate": {"vi_meaning": "diệt trừ", "vi_example": "Sáng kiến ​​này nhằm mục đích xóa bỏ sự phân biệt đối xử ở nơi làm việc dưới mọi hình thức.", "th_meaning": "กำจัด", "th_example": "โครงการริเริ่มนี้มีจุดมุ่งหมายเพื่อขจัดการเลือกปฏิบัติในที่ทำงานในทุกรูปแบบ", "id_meaning": "membasmi", "id_example": "Inisiatif ini bertujuan untuk menghapuskan segala bentuk diskriminasi di tempat kerja."}, "150:erratic": {"vi_meaning": "thất thường", "vi_example": "Diễn biến thất thường của cổ phiếu khiến nhà đầu tư ngày càng lo lắng trong quý này.", "th_meaning": "เอาแน่เอานอนไม่ได้", "th_example": "ผลการดำเนินงานที่ไม่แน่นอนของหุ้นทำให้นักลงทุนวิตกกังวลมากขึ้นในไตรมาสนี้", "id_meaning": "tak menentu", "id_example": "Kinerja saham yang tidak menentu membuat investor semakin gelisah pada kuartal ini."}, "151:erroneous": {"vi_meaning": "sai", "vi_example": "Báo cáo tài chính có một số mục sai sót cần được sửa chữa.", "th_meaning": "ผิดพลาด", "th_example": "งบการเงินมีรายการผิดพลาดหลายรายการซึ่งจำเป็นต้องแก้ไข", "id_meaning": "salah", "id_example": "Laporan keuangan berisi beberapa entri yang salah sehingga memerlukan koreksi."}, "152:erudite": {"vi_meaning": "uyên bác", "vi_example": "Vị giáo sư uyên bác đã cung cấp những hiểu biết sâu sắc vô giá trong quá trình tham gia tư vấn.", "th_meaning": "ขยัน", "th_example": "ศาสตราจารย์ผู้รอบรู้ได้ให้ข้อมูลเชิงลึกอันล้ำค่าระหว่างการให้คำปรึกษา", "id_meaning": "terpelajar", "id_example": "Profesor terpelajar ini memberikan wawasan yang sangat berharga selama masa konsultasi."}, "153:espouse": {"vi_meaning": "theo", "vi_example": "Giám đốc điều hành từ lâu đã tán thành triết lý quản trị doanh nghiệp minh bạch.", "th_meaning": "คู่สมรส", "th_example": "ซีอีโอได้ยึดถือปรัชญาการกำกับดูแลกิจการที่โปร่งใสมายาวนาน", "id_meaning": "mendukung", "id_example": "CEO telah lama menganut filosofi tata kelola perusahaan yang transparan."}, "154:estrange": {"vi_meaning": "xa lạ", "vi_example": "Quyết định gây tranh cãi này có nguy cơ khiến các khách hàng và đối tác trung thành xa lánh.", "th_meaning": "แปลกหน้า", "th_example": "การตัดสินใจที่ก่อให้เกิดข้อขัดแย้งดังกล่าวอาจส่งผลให้ลูกค้าและพันธมิตรผู้ภักดีต้องเหินห่าง", "id_meaning": "menjauhkan", "id_example": "Keputusan kontroversial tersebut mengancam akan mengasingkan pelanggan dan mitra setianya."}, "155:ethereal": {"vi_meaning": "thanh tao", "vi_example": "Nhà thiết kế đã tạo ra bầu không khí thanh tao cho cửa hàng hàng đầu của thương hiệu sang trọng.", "th_meaning": "ไม่มีตัวตน", "th_example": "ดีไซเนอร์คนนี้ได้สร้างบรรยากาศที่เหมือนจริงให้กับร้านเรือธงของแบรนด์หรูแห่งนี้", "id_meaning": "sangat halus", "id_example": "Perancangnya menciptakan suasana halus untuk toko andalan merek mewah tersebut."}, "156:exacerbate": {"vi_meaning": "làm trầm trọng thêm", "vi_example": "Sự gián đoạn chuỗi cung ứng sẽ chỉ làm trầm trọng thêm tình trạng thiếu hàng tồn kho hiện có.", "th_meaning": "ทำให้รุนแรงขึ้น", "th_example": "การหยุดชะงักของห่วงโซ่อุปทานจะทำให้การขาดแคลนสินค้าคงคลังที่มีอยู่รุนแรงขึ้นเท่านั้น", "id_meaning": "mengesalkan", "id_example": "Gangguan rantai pasokan hanya akan memperburuk kekurangan persediaan yang ada."}, "157:exasperate": {"vi_meaning": "làm bực mình", "vi_example": "Sự chậm trễ lặp đi lặp lại trong việc bàn giao dự án khiến khách hàng bực tức đến mức không thể đo lường được.", "th_meaning": "โกรธเคือง", "th_example": "ความล่าช้าซ้ำแล้วซ้ำเล่าในการส่งมอบโครงการทำให้ลูกค้าโกรธเคืองเกินกว่าจะวัดได้", "id_meaning": "menjengkelkan", "id_example": "Penundaan berulang kali dalam penyelesaian proyek membuat klien sangat jengkel."}, "158:exemplary": {"vi_meaning": "mẫu mực", "vi_example": "Khả năng lãnh đạo mẫu mực của cô trong cuộc khủng hoảng đã giúp cô được thăng chức.", "th_meaning": "เป็นแบบอย่าง", "th_example": "ความเป็นผู้นำที่เป็นแบบอย่างของเธอในช่วงวิกฤติทำให้เธอได้รับการเลื่อนตำแหน่ง", "id_meaning": "teladan", "id_example": "Kepemimpinannya yang patut dicontoh selama krisis membuatnya mendapat promosi."}, "159:exempt": {"vi_meaning": "miễn trừ", "vi_example": "Các doanh nghiệp nhỏ có ít hơn mười nhân viên được miễn quy định.", "th_meaning": "ได้รับการยกเว้น", "th_example": "ธุรกิจขนาดเล็กที่มีพนักงานน้อยกว่าสิบคนได้รับการยกเว้นจากกฎระเบียบดังกล่าว", "id_meaning": "membebaskan", "id_example": "Usaha kecil dengan kurang dari sepuluh karyawan dikecualikan dari peraturan ini."}, "160:exert": {"vi_meaning": "gắng sức", "vi_example": "Công ty mẹ có thể gây ảnh hưởng đáng kể đến hoạt động của công ty con.", "th_meaning": "ออกแรง", "th_example": "บริษัทแม่สามารถใช้อิทธิพลอย่างมากเหนือการดำเนินงานของบริษัทย่อยได้", "id_meaning": "menggunakan", "id_example": "Perusahaan induk dapat memberikan pengaruh yang besar terhadap operasi anak perusahaannya."}, "161:exhaustive": {"vi_meaning": "đầy đủ", "vi_example": "Nhóm đã tiến hành phân tích toàn diện tất cả dữ liệu thị trường có sẵn.", "th_meaning": "หมดจด", "th_example": "ทีมงานได้ทำการวิเคราะห์ข้อมูลตลาดที่มีอยู่ทั้งหมดอย่างละเอียดถี่ถ้วน", "id_meaning": "lengkap", "id_example": "Tim melakukan analisis mendalam terhadap semua data pasar yang tersedia."}, "162:exonerate": {"vi_meaning": "tha", "vi_example": "Cuộc điều tra cuối cùng nhằm mục đích minh oan cho người điều hành bị cáo buộc về hành vi sai trái.", "th_meaning": "พ้นผิด", "th_example": "ในที่สุดการสอบสวนก็ช่วยปลดเปลื้องผู้บริหารที่ถูกกล่าวหาว่ากระทำความผิด", "id_meaning": "membebaskan", "id_example": "Investigasi tersebut pada akhirnya berfungsi untuk membebaskan terdakwa eksekutif dari tuduhan melakukan kesalahan."}, "163:expedient": {"vi_meaning": "hữu ích", "vi_example": "Hội đồng quản trị đã chọn giải pháp phù hợp nhất để giải quyết cuộc khủng hoảng cấp bách.", "th_meaning": "สะดวก", "th_example": "คณะกรรมการได้เลือกแนวทางแก้ไขที่เหมาะสมที่สุดเพื่อแก้ไขวิกฤติเร่งด่วน", "id_meaning": "bijaksana", "id_example": "Dewan memilih solusi yang paling tepat untuk mengatasi krisis yang mendesak ini."}, "164:expedite": {"vi_meaning": "xúc tiến", "vi_example": "Chúng ta cần đẩy nhanh quá trình phê duyệt để đáp ứng thời hạn của dự án.", "th_meaning": "เร่งรัด", "th_example": "เราจำเป็นต้องเร่งกระบวนการอนุมัติให้ตรงตามกำหนดเวลาของโครงการ", "id_meaning": "mempercepat", "id_example": "Kita perlu mempercepat proses persetujuan untuk memenuhi tenggat waktu proyek."}, "165:explicit": {"vi_meaning": "rõ ràng", "vi_example": "Hợp đồng có các điều khoản rõ ràng về quyền sở hữu tài sản trí tuệ.", "th_meaning": "ชัดเจน", "th_example": "สัญญาประกอบด้วยข้อกำหนดที่ชัดเจนเกี่ยวกับการเป็นเจ้าของทรัพย์สินทางปัญญา", "id_meaning": "eksplisit", "id_example": "Kontrak tersebut memuat ketentuan eksplisit mengenai kepemilikan kekayaan intelektual."}, "166:exponential": {"vi_meaning": "hàm mũ", "vi_example": "Công ty đã có sự tăng trưởng theo cấp số nhân sau khi ra mắt ứng dụng di động.", "th_meaning": "เอ็กซ์โปเนนเชียล", "th_example": "บริษัทมีการเติบโตแบบก้าวกระโดดหลังจากเปิดตัวแอปพลิเคชันบนมือถือ", "id_meaning": "eksponensial", "id_example": "Perusahaan mengalami pertumbuhan eksponensial setelah meluncurkan aplikasi selulernya."}, "167:extraneous": {"vi_meaning": "không liên quan", "vi_example": "Vui lòng loại bỏ tất cả thông tin không liên quan khỏi báo cáo tóm tắt điều hành.", "th_meaning": "ภายนอก", "th_example": "โปรดลบข้อมูลที่ไม่เกี่ยวข้องทั้งหมดออกจากรายงานสรุปสำหรับผู้บริหาร", "id_meaning": "asing", "id_example": "Harap hapus semua informasi yang tidak relevan dari laporan ringkasan eksekutif."}, "168:extricate": {"vi_meaning": "giải thoát", "vi_example": "Công ty đã phải vật lộn để thoát khỏi liên doanh thua lỗ.", "th_meaning": "คลี่คลาย", "th_example": "บริษัทพยายามดิ้นรนที่จะหลุดพ้นจากกิจการร่วมค้าที่ไม่มีผลกำไร", "id_meaning": "melepaskan", "id_example": "Perusahaan berjuang untuk melepaskan diri dari usaha patungan yang tidak menguntungkan."}, "169:fabricate": {"vi_meaning": "chế tạo", "vi_example": "Người tố cáo cáo buộc ban quản lý cố gắng làm giả hồ sơ tài chính.", "th_meaning": "ประดิษฐ์", "th_example": "ผู้แจ้งเบาะแสกล่าวหาฝ่ายบริหารว่าพยายามสร้างบันทึกทางการเงิน", "id_meaning": "membuat", "id_example": "Pelapor menuduh manajemen berupaya memalsukan catatan keuangan."}, "170:facet": {"vi_meaning": "khía cạnh", "vi_example": "Đổi mới chỉ là một khía cạnh trong chiến lược tăng trưởng toàn diện của công ty.", "th_meaning": "ด้าน", "th_example": "นวัตกรรมเป็นเพียงส่วนหนึ่งของกลยุทธ์การเติบโตแบบครอบคลุมของบริษัท", "id_meaning": "segi", "id_example": "Inovasi hanyalah salah satu aspek dari strategi pertumbuhan komprehensif perusahaan."}, "171:facilitate": {"vi_meaning": "tạo điều kiện", "vi_example": "Nền tảng phần mềm mới sẽ tạo điều kiện thuận lợi cho sự cộng tác giữa các nhóm từ xa.", "th_meaning": "อำนวยความสะดวก", "th_example": "แพลตฟอร์มซอฟต์แวร์ใหม่จะอำนวยความสะดวกในการทำงานร่วมกันระหว่างทีมระยะไกล", "id_meaning": "memudahkan", "id_example": "Platform perangkat lunak baru akan memfasilitasi kolaborasi antar tim jarak jauh."}, "172:fallacy": {"vi_meaning": "sự ngụy biện", "vi_example": "Giả định rằng các sản phẩm rẻ hơn luôn bán chạy hơn là một sai lầm phổ biến.", "th_meaning": "การเข้าใจผิด", "th_example": "การสันนิษฐานว่าสินค้าราคาถูกขายดีกว่าเสมอนั้นเป็นความเข้าใจผิดที่พบบ่อย", "id_meaning": "kekeliruan", "id_example": "Anggapan bahwa produk yang lebih murah selalu terjual lebih baik adalah kesalahan umum."}, "173:fastidious": {"vi_meaning": "khó tính", "vi_example": "Đội ngũ kiểm soát chất lượng rất khó tính trong việc đáp ứng các thông số kỹ thuật của sản phẩm.", "th_meaning": "จุกจิก", "th_example": "ทีมควบคุมคุณภาพพิถีพิถันในการปฏิบัติตามข้อกำหนดของผลิตภัณฑ์", "id_meaning": "rewel", "id_example": "Tim kendali mutu sangat teliti dalam memenuhi spesifikasi produk."}, "174:feasible": {"vi_meaning": "khả thi", "vi_example": "Sau khi phân tích cẩn thận, nhóm nghiên cứu kết luận rằng dự án khả thi về mặt tài chính.", "th_meaning": "เป็นไปได้", "th_example": "หลังจากการวิเคราะห์อย่างรอบคอบ ทีมงานสรุปว่าโครงการนี้มีความเป็นไปได้ทางการเงิน", "id_meaning": "bisa dilakukan", "id_example": "Setelah melakukan analisis yang cermat, tim menyimpulkan bahwa proyek tersebut layak secara finansial."}, "175:fervent": {"vi_meaning": "nhiệt thành", "vi_example": "Các nhân viên đã thể hiện sự ủng hộ nhiệt thành đối với chương trình trách nhiệm xã hội mới của doanh nghiệp.", "th_meaning": "กระตือรือร้น", "th_example": "พนักงานแสดงการสนับสนุนอย่างแรงกล้าสำหรับโครงการความรับผิดชอบต่อสังคมขององค์กรใหม่", "id_meaning": "kuat", "id_example": "Para karyawan menunjukkan dukungan yang kuat terhadap program tanggung jawab sosial perusahaan yang baru."}, "176:fidelity": {"vi_meaning": "sự chung thủy", "vi_example": "Bản dịch phải duy trì sự trung thực với ngôn ngữ hợp đồng gốc.", "th_meaning": "ความจงรักภักดี", "th_example": "การแปลจะต้องรักษาความเที่ยงตรงต่อภาษาต้นฉบับตามสัญญา", "id_meaning": "kesetiaan", "id_example": "Terjemahannya harus menjaga kesetiaan pada bahasa kontrak aslinya."}, "177:fluctuate": {"vi_meaning": "dao động", "vi_example": "Tỷ giá hối đoái tiếp tục biến động do căng thẳng địa chính trị đang diễn ra.", "th_meaning": "ผันผวน", "th_example": "อัตราแลกเปลี่ยนยังคงผันผวนเนื่องจากความตึงเครียดทางภูมิรัฐศาสตร์อย่างต่อเนื่อง", "id_meaning": "berfluktuasi", "id_example": "Nilai tukar terus berfluktuasi karena ketegangan geopolitik yang sedang berlangsung."}, "178:forestall": {"vi_meaning": "chặn trước", "vi_example": "Công ty đã thực hiện các biện pháp để ngăn chặn các vụ kiện tụng có thể xảy ra từ những khách hàng không hài lòng.", "th_meaning": "ขัดขวาง", "th_example": "บริษัทใช้มาตรการเพื่อป้องกันการดำเนินคดีที่อาจเกิดขึ้นจากลูกค้าที่ไม่พอใจ", "id_meaning": "mencegah", "id_example": "Perusahaan mengambil langkah-langkah untuk mencegah potensi litigasi dari klien yang tidak puas."}, "179:formidable": {"vi_meaning": "ghê gớm", "vi_example": "Công ty phải đối mặt với sự cạnh tranh gay gắt từ các công ty dẫn đầu ngành.", "th_meaning": "น่าเกรงขาม", "th_example": "บริษัทเผชิญกับการแข่งขันที่น่าเกรงขามจากผู้นำอุตสาหกรรมที่เป็นที่ยอมรับ", "id_meaning": "hebat", "id_example": "Perusahaan menghadapi persaingan yang ketat dari para pemimpin industri yang sudah mapan."}, "180:forthcoming": {"vi_meaning": "sắp tới", "vi_example": "Thông tin chi tiết về việc sáp nhập sẽ được công bố trong báo cáo quý tiếp theo.", "th_meaning": "เตรียมพร้อม", "th_example": "รายละเอียดเกี่ยวกับการควบรวมกิจการจะแจ้งให้ทราบในรายงานประจำไตรมาสถัดไป", "id_meaning": "akan datang", "id_example": "Rincian tentang merger akan diungkapkan dalam laporan triwulanan berikutnya."}, "181:fortuitous": {"vi_meaning": "tình cờ", "vi_example": "Cuộc gặp gỡ tình cờ với một nhà đầu tư đã mang lại nguồn vốn đầu tiên cho công ty khởi nghiệp.", "th_meaning": "บังเอิญ", "th_example": "การพบปะโดยบังเอิญกับนักลงทุนทำให้เกิดการระดมทุนครั้งแรกของสตาร์ทอัพ", "id_meaning": "tak disengaja", "id_example": "Pertemuan yang tidak disengaja dengan seorang investor menghasilkan pendanaan pertama bagi startup tersebut."}, "182:foster": {"vi_meaning": "nuôi dưỡng", "vi_example": "Khóa tu lãnh đạo được tổ chức để thúc đẩy sự đổi mới và gắn kết nhóm.", "th_meaning": "อุปถัมภ์", "th_example": "การประชุมล่าถอยของผู้นำจัดขึ้นเพื่อส่งเสริมนวัตกรรมและการทำงานร่วมกันเป็นทีม", "id_meaning": "mengasuh", "id_example": "Retret kepemimpinan diselenggarakan untuk mendorong inovasi dan kohesi tim."}, "183:frivolous": {"vi_meaning": "phù phiếm", "vi_example": "Tòa án đã bác bỏ vụ kiện vì cho rằng vụ kiện này là phù phiếm và không có giá trị pháp lý.", "th_meaning": "ไม่สำคัญ", "th_example": "ศาลยกฟ้องคดีดังกล่าวว่าไม่สำคัญและไม่มีคุณธรรมทางกฎหมาย", "id_meaning": "sembrono", "id_example": "Pengadilan menganggap gugatan tersebut tidak berdasar dan tidak berdasar hukum."}, "184:frugal": {"vi_meaning": "tằn tiện", "vi_example": "Công ty khởi nghiệp này duy trì thói quen chi tiêu tiết kiệm ngay cả sau khi đã đảm bảo được nguồn tài trợ lớn.", "th_meaning": "ประหยัด", "th_example": "การเริ่มต้นรักษานิสัยการใช้จ่ายอย่างประหยัดแม้ว่าจะได้รับเงินทุนจำนวนมากแล้วก็ตาม", "id_meaning": "hemat", "id_example": "Startup ini mempertahankan kebiasaan belanja hemat bahkan setelah mendapatkan pendanaan besar."}, "185:futile": {"vi_meaning": "vô ích", "vi_example": "Mọi nỗ lực thương lượng mức giá thấp hơn cuối cùng đều vô ích.", "th_meaning": "ไร้ประโยชน์", "th_example": "ความพยายามทั้งหมดในการเจรจาต่อรองราคาที่ต่ำกว่านั้นไร้ประโยชน์ในที่สุด", "id_meaning": "sia-sia", "id_example": "Semua upaya untuk menegosiasikan harga yang lebih rendah pada akhirnya sia-sia."}, "186:galvanize": {"vi_meaning": "mạ điện", "vi_example": "Bài phát biểu đầy nhiệt huyết của vị CEO đã giúp khích lệ nhân viên thực hiện sứ mệnh mới.", "th_meaning": "ชุบสังกะสี", "th_example": "คำพูดอันกระตือรือร้นของ CEO ช่วยกระตุ้นพนักงานให้ปฏิบัติภารกิจใหม่", "id_meaning": "menggembleng", "id_example": "Pidato CEO yang penuh semangat membantu menyemangati karyawan dalam menjalankan misi baru."}, "187:garner": {"vi_meaning": "người kiếm tiền", "vi_example": "Buổi ra mắt sản phẩm đã thu hút được sự chú ý đáng kể của giới truyền thông trên toàn thế giới.", "th_meaning": "รวบรวม", "th_example": "การเปิดตัวผลิตภัณฑ์ได้รับความสนใจจากสื่อทั่วโลกอย่างมาก", "id_meaning": "mengumpulkan", "id_example": "Peluncuran produk ini berhasil menarik perhatian media secara signifikan di seluruh dunia."}, "188:germane": {"vi_meaning": "Đức", "vi_example": "Hãy giữ ý kiến ​​của bạn phù hợp với các nội dung chương trình nghị sự đang được thảo luận.", "th_meaning": "เยอรมัน", "th_example": "กรุณาเก็บความคิดเห็นของคุณให้สอดคล้องกับวาระการประชุมที่กำลังหารือ", "id_meaning": "erat", "id_example": "Harap jaga agar komentar Anda tetap relevan dengan agenda yang sedang dibahas."}, "189:gratuitous": {"vi_meaning": "cho không", "vi_example": "Báo cáo bao gồm các chi tiết vô cớ làm che khuất những phát hiện chính.", "th_meaning": "เปล่าประโยชน์", "th_example": "รายงานดังกล่าวมีรายละเอียดโดยเปล่าประโยชน์ซึ่งบดบังการค้นพบหลักๆ", "id_meaning": "serampangan", "id_example": "Laporan tersebut memuat rincian yang tidak beralasan sehingga mengaburkan temuan utama."}, "190:grievance": {"vi_meaning": "than phiền", "vi_example": "Công đoàn đã nộp đơn khiếu nại chính thức về điều kiện làm việc không an toàn.", "th_meaning": "ความคับข้องใจ", "th_example": "สหภาพแรงงานยื่นคำร้องทุกข์อย่างเป็นทางการเกี่ยวกับสภาพการทำงานที่ไม่ปลอดภัย", "id_meaning": "keluhan", "id_example": "Serikat pekerja mengajukan keluhan resmi mengenai kondisi kerja yang tidak aman."}, "191:hamper": {"vi_meaning": "cản trở", "vi_example": "Quan liêu quan liêu tiếp tục cản trở sự đổi mới trong khu vực công.", "th_meaning": "ขัดขวาง", "th_example": "เทปสีแดงของระบบราชการยังคงขัดขวางนวัตกรรมในภาครัฐ", "id_meaning": "menghambat", "id_example": "Birokrasi yang berlebihan terus menghambat inovasi di sektor publik."}, "192:haphazard": {"vi_meaning": "tình cờ", "vi_example": "Cách tiếp cận lộn xộn để quản lý dữ liệu đã dẫn đến những vi phạm an ninh nghiêm trọng.", "th_meaning": "บังเอิญ", "th_example": "แนวทางการจัดการข้อมูลแบบจับจดส่งผลให้เกิดการละเมิดความปลอดภัยที่สำคัญ", "id_meaning": "serampangan", "id_example": "Pendekatan yang serampangan terhadap pengelolaan data mengakibatkan pelanggaran keamanan yang signifikan."}, "193:harbinger": {"vi_meaning": "điềm báo", "vi_example": "Thành công ban đầu của chương trình thí điểm là điềm báo cho sự phát triển trong tương lai.", "th_meaning": "ลางสังหรณ์", "th_example": "ความสำเร็จในช่วงแรกของโครงการนำร่องคือลางสังหรณ์ของการเติบโตในอนาคต", "id_meaning": "pertanda", "id_example": "Keberhasilan awal dari program percontohan ini merupakan pertanda pertumbuhan di masa depan."}, "194:hinder": {"vi_meaning": "cản trở", "vi_example": "Thiếu kinh phí đầy đủ sẽ cản trở khả năng đổi mới của bộ.", "th_meaning": "ขัดขวาง", "th_example": "การขาดเงินทุนที่เพียงพอจะขัดขวางความสามารถของแผนกในการสร้างสรรค์สิ่งใหม่ๆ", "id_meaning": "menghalangi", "id_example": "Kurangnya pendanaan yang memadai akan menghambat kemampuan departemen untuk berinovasi."}, "195:holistic": {"vi_meaning": "toàn diện", "vi_example": "Công ty đã áp dụng một cách tiếp cận toàn diện để chăm sóc sức khỏe và sự phát triển của nhân viên.", "th_meaning": "แบบองค์รวม", "th_example": "บริษัทนำแนวทางแบบองค์รวมมาใช้เพื่อดูแลสุขภาพและการพัฒนาของพนักงาน", "id_meaning": "holistik", "id_example": "Perusahaan mengadopsi pendekatan holistik terhadap kesehatan dan pengembangan karyawan."}, "196:homogeneous": {"vi_meaning": "đồng nhất", "vi_example": "Ủy ban đã tìm cách tránh một quan điểm đồng nhất bằng cách đa dạng hóa các thành viên của mình.", "th_meaning": "เป็นเนื้อเดียวกัน", "th_example": "คณะกรรมการพยายามหลีกเลี่ยงมุมมองที่เป็นเนื้อเดียวกันโดยการกระจายสมาชิกให้หลากหลาย", "id_meaning": "homogen", "id_example": "Komite berusaha menghindari perspektif yang homogen dengan mendiversifikasi anggotanya."}, "197:hypothetical": {"vi_meaning": "giả định", "vi_example": "Chuyên gia tư vấn đã đưa ra một số tình huống giả định để hội đồng quản trị xem xét.", "th_meaning": "สมมุติ", "th_example": "ที่ปรึกษาได้นำเสนอสถานการณ์สมมติหลายประการเพื่อให้คณะกรรมการพิจารณา", "id_meaning": "hipotetis", "id_example": "Konsultan menyajikan beberapa skenario hipotetis untuk dipertimbangkan oleh dewan."}, "198:idiosyncratic": {"vi_meaning": "có phong cách riêng", "vi_example": "Phong cách quản lý đặc trưng của người sáng lập vừa được ngưỡng mộ vừa bị chỉ trích.", "th_meaning": "แปลกประหลาด", "th_example": "รูปแบบการบริหารจัดการที่แปลกประหลาดของผู้ก่อตั้งมีทั้งความชื่นชมและวิพากษ์วิจารณ์", "id_meaning": "istimewa", "id_example": "Gaya manajemen istimewa sang pendiri dikagumi sekaligus dikritik."}, "199:illuminate": {"vi_meaning": "chiếu sáng", "vi_example": "Nghiên cứu trường hợp này giúp làm sáng tỏ những thách thức của việc quản lý đa văn hóa.", "th_meaning": "ส่องสว่าง", "th_example": "กรณีศึกษาช่วยให้กระจ่างถึงความท้าทายของการจัดการข้ามวัฒนธรรม", "id_meaning": "menerangi", "id_example": "Studi kasus ini membantu menjelaskan tantangan pengelolaan lintas budaya."}, "200:imminent": {"vi_meaning": "sắp xảy ra", "vi_example": "Việc tái cơ cấu sắp xảy ra của công ty đã được công bố tại cuộc họp nhân viên.", "th_meaning": "ใกล้", "th_example": "มีการประกาศการปรับโครงสร้างบริษัทที่ใกล้จะเกิดขึ้นในการประชุมพนักงาน", "id_meaning": "dekat", "id_example": "Restrukturisasi perusahaan yang akan segera terjadi diumumkan pada rapat staf."}, "201:impartial": {"vi_meaning": "vô tư", "vi_example": "Một hòa giải viên vô tư đã được mời đến để giải quyết tranh chấp hợp đồng.", "th_meaning": "เป็นกลาง", "th_example": "มีการนำคนกลางที่เป็นกลางเข้ามาเพื่อแก้ไขข้อพิพาทตามสัญญา", "id_meaning": "tidak memihak", "id_example": "Seorang mediator yang tidak memihak didatangkan untuk menyelesaikan perselisihan kontrak."}, "202:impasse": {"vi_meaning": "sự bế tắc", "vi_example": "Các cuộc đàm phán đi vào bế tắc khi không bên nào chịu thỏa hiệp về giá cả.", "th_meaning": "ทางตัน", "th_example": "การเจรจาถึงทางตันเมื่อทั้งสองฝ่ายไม่ยอมประนีประนอมเรื่องราคา", "id_meaning": "kebuntuan", "id_example": "Negosiasi menemui jalan buntu ketika tidak ada pihak yang mau berkompromi mengenai harga."}, "203:impede": {"vi_meaning": "cản trở", "vi_example": "Hệ thống CNTT lỗi thời tiếp tục cản trở hiệu quả hoạt động của các phòng ban.", "th_meaning": "ขัดขวาง", "th_example": "ระบบไอทีที่ล้าสมัยยังคงขัดขวางประสิทธิภาพการปฏิบัติงานของแผนกต่างๆ", "id_meaning": "menghalangi", "id_example": "Sistem TI yang ketinggalan jaman terus menghambat efisiensi operasional di seluruh departemen."}, "204:imperative": {"vi_meaning": "mệnh lệnh", "vi_example": "Điều bắt buộc là công ty phải giải quyết các lỗ hổng an ninh mạng ngay lập tức.", "th_meaning": "จำเป็น", "th_example": "มีความจำเป็นที่บริษัทจะต้องจัดการกับช่องโหว่ด้านความปลอดภัยทางไซเบอร์ทันที", "id_meaning": "imperatif", "id_example": "Penting bagi perusahaan untuk segera mengatasi kerentanan keamanan siber."}, "205:implication": {"vi_meaning": "hàm ý", "vi_example": "Sự thay đổi chính sách có ý nghĩa quan trọng đối với các chương trình phúc lợi cho nhân viên.", "th_meaning": "ความหมาย", "th_example": "การเปลี่ยนแปลงนโยบายมีผลกระทบอย่างมีนัยสำคัญต่อโครงการผลประโยชน์ของพนักงาน", "id_meaning": "implikasi", "id_example": "Perubahan kebijakan ini mempunyai implikasi yang signifikan terhadap program tunjangan karyawan."}, "206:implicit": {"vi_meaning": "ngầm", "vi_example": "Có một sự hiểu ngầm rằng làm thêm giờ sẽ được trả công một cách công bằng.", "th_meaning": "โดยปริยาย", "th_example": "มีความเข้าใจโดยปริยายว่าค่าล่วงเวลาจะได้รับการชดเชยอย่างยุติธรรม", "id_meaning": "implisit", "id_example": "Terdapat pemahaman implisit bahwa lembur akan diberi kompensasi yang adil."}, "207:improvise": {"vi_meaning": "ứng biến", "vi_example": "Khi thiết bị thuyết trình bị hỏng, cô phải ứng biến bằng các tờ rơi in sẵn.", "th_meaning": "ด้นสด", "th_example": "เมื่ออุปกรณ์การนำเสนอล้มเหลว เธอต้องด้นสดโดยใช้เอกสารประกอบคำบรรยายที่พิมพ์ออกมา", "id_meaning": "berimprovisasi", "id_example": "Ketika peralatan presentasi rusak, dia harus berimprovisasi dengan handout yang dicetak."}, "208:inadvertent": {"vi_meaning": "vô ý", "vi_example": "Việc vô tình tiết lộ dữ liệu bí mật đã dẫn đến một cuộc điều tra tuân thủ.", "th_meaning": "โดยไม่ได้ตั้งใจ", "th_example": "การเปิดเผยข้อมูลที่เป็นความลับโดยไม่ตั้งใจนำไปสู่การสอบสวนการปฏิบัติตามกฎระเบียบ", "id_meaning": "tidak sengaja", "id_example": "Pengungkapan data rahasia yang tidak disengaja menyebabkan penyelidikan kepatuhan."}, "209:inaugurate": {"vi_meaning": "khánh thành", "vi_example": "Công ty sẽ khánh thành trung tâm nghiên cứu mới của mình bằng một buổi lễ hoành tráng.", "th_meaning": "เปิดตัว", "th_example": "บริษัทจะเปิดตัวศูนย์วิจัยแห่งใหม่พร้อมพิธียิ่งใหญ่", "id_meaning": "meresmikan", "id_example": "Perusahaan akan meresmikan pusat penelitian barunya dengan upacara akbar."}, "210:incisive": {"vi_meaning": "sắc bén", "vi_example": "Phân tích sâu sắc của cô về xu hướng thị trường đã định hướng chiến lược đầu tư.", "th_meaning": "แหลมคม", "th_example": "การวิเคราะห์แนวโน้มตลาดอย่างเฉียบแหลมของเธอเป็นแนวทางในกลยุทธ์การลงทุน", "id_meaning": "tajam", "id_example": "Analisis tajamnya terhadap tren pasar memandu strategi investasi."}, "211:inclination": {"vi_meaning": "độ nghiêng", "vi_example": "Hội đồng quản trị cho thấy một khuynh hướng rõ ràng đối với việc quản lý tài chính thận trọng.", "th_meaning": "ความโน้มเอียง", "th_example": "คณะกรรมการมีความโน้มเอียงที่ชัดเจนต่อการจัดการการคลังแบบอนุรักษ์นิยม", "id_meaning": "kecenderungan", "id_example": "Dewan tersebut menunjukkan kecenderungan yang jelas terhadap manajemen fiskal yang konservatif."}, "212:incongruous": {"vi_meaning": "không thích hợp", "vi_example": "Phong cách trang trí văn phòng xa hoa dường như không phù hợp với thông điệp cắt giảm chi phí của công ty.", "th_meaning": "ไม่เข้ากัน", "th_example": "การตกแต่งสำนักงานที่หรูหราดูไม่สอดคล้องกับข้อความลดต้นทุนของบริษัท", "id_meaning": "tidak sesuai", "id_example": "Dekorasi kantor yang mewah tampak tidak sesuai dengan pesan pemotongan biaya perusahaan."}, "213:increment": {"vi_meaning": "gia tăng", "vi_example": "Nhân viên có thể mong đợi được tăng lương hàng năm dựa trên đánh giá hiệu suất.", "th_meaning": "เพิ่มขึ้น", "th_example": "พนักงานสามารถคาดหวังการขึ้นเงินเดือนประจำปีโดยพิจารณาจากผลการปฏิบัติงาน", "id_meaning": "kenaikan", "id_example": "Karyawan dapat mengharapkan kenaikan gaji tahunan berdasarkan tinjauan kinerja."}, "214:incumbent": {"vi_meaning": "đương nhiệm", "vi_example": "Nhiệm vụ của quản lý là đảm bảo một môi trường làm việc an toàn.", "th_meaning": "ดำรงตำแหน่ง", "th_example": "ฝ่ายบริหารมีหน้าที่ดูแลให้มีสภาพแวดล้อมการทำงานที่ปลอดภัย", "id_meaning": "petahana", "id_example": "Manajemen wajib memastikan lingkungan kerja yang aman."}, "215:indispensable": {"vi_meaning": "không thể thiếu", "vi_example": "Kỹ năng giao tiếp hiệu quả là không thể thiếu đối với các nhà quản lý dự án thành công.", "th_meaning": "ที่ขาดไม่ได้", "th_example": "ทักษะการสื่อสารที่มีประสิทธิภาพเป็นสิ่งที่ขาดไม่ได้สำหรับผู้จัดการโครงการที่ประสบความสำเร็จ", "id_meaning": "sangat diperlukan", "id_example": "Keterampilan komunikasi yang efektif sangat diperlukan bagi manajer proyek yang sukses."}, "216:induce": {"vi_meaning": "xúi giục", "vi_example": "Chiến dịch quảng cáo được thiết kế để khuyến khích người tiêu dùng chuyển đổi thương hiệu.", "th_meaning": "ชักนำ", "th_example": "แคมเปญส่งเสริมการขายนี้ออกแบบมาเพื่อชักจูงผู้บริโภคให้เปลี่ยนแบรนด์", "id_meaning": "menyebabkan", "id_example": "Kampanye promosi dirancang untuk mendorong konsumen berpindah merek."}, "217:infer": {"vi_meaning": "suy ra", "vi_example": "Từ báo cáo hàng quý, các nhà phân tích có thể suy ra sự chậm lại trong chi tiêu của người tiêu dùng.", "th_meaning": "อนุมาน", "th_example": "จากรายงานรายไตรมาส นักวิเคราะห์สามารถสรุปการชะลอตัวของการใช้จ่ายของผู้บริโภคได้", "id_meaning": "menyimpulkan", "id_example": "Dari laporan triwulanan, analis dapat menyimpulkan perlambatan belanja konsumen."}, "218:inflammatory": {"vi_meaning": "viêm", "vi_example": "Những nhận xét mang tính kích động của vị giám đốc điều hành đã gây ra một cuộc khủng hoảng quan hệ công chúng.", "th_meaning": "อักเสบ", "th_example": "คำพูดยั่วโทสะของผู้บริหารทำให้เกิดวิกฤตการประชาสัมพันธ์", "id_meaning": "inflamasi", "id_example": "Pernyataan yang menghasut dari eksekutif tersebut memicu krisis hubungan masyarakat."}, "219:influx": {"vi_meaning": "sự tràn vào", "vi_example": "Lượng đơn đặt hàng mới tràn vào đột ngột khiến bộ phận sản xuất choáng ngợp.", "th_meaning": "ไหลบ่าเข้ามา", "th_example": "คำสั่งซื้อใหม่หลั่งไหลเข้ามาอย่างกะทันหันส่งผลให้แผนกการผลิตล้นหลาม", "id_meaning": "arus", "id_example": "Masuknya pesanan baru secara tiba-tiba membuat departemen produksi kewalahan."}, "220:inherent": {"vi_meaning": "vốn có", "vi_example": "Bất kỳ sáng kiến ​​tái cơ cấu doanh nghiệp quy mô lớn nào cũng có những rủi ro cố hữu.", "th_meaning": "โดยธรรมชาติ", "th_example": "โครงการริเริ่มการปรับโครงสร้างองค์กรขนาดใหญ่ใดๆ ก็ตามมีความเสี่ยงโดยธรรมชาติ", "id_meaning": "inheren", "id_example": "Terdapat risiko yang melekat dalam setiap inisiatif restrukturisasi perusahaan skala besar."}, "221:inhibit": {"vi_meaning": "ức chế", "vi_example": "Các quy định nghiêm ngặt có thể vô tình cản trở sự đổi mới trong lĩnh vực công nghệ.", "th_meaning": "ยับยั้ง", "th_example": "กฎระเบียบที่เข้มงวดอาจขัดขวางนวัตกรรมในภาคเทคโนโลยีโดยไม่ได้ตั้งใจ", "id_meaning": "menghalangi", "id_example": "Peraturan yang ketat mungkin secara tidak sengaja menghambat inovasi di sektor teknologi."}, "222:innate": {"vi_meaning": "bẩm sinh", "vi_example": "Khả năng kết nối bẩm sinh với mọi người đã khiến cô trở thành một nhà đàm phán xuất sắc.", "th_meaning": "โดยกำเนิด", "th_example": "ความสามารถโดยกำเนิดของเธอในการเชื่อมต่อกับผู้คนทำให้เธอเป็นนักเจรจาต่อรองที่ยอดเยี่ยม", "id_meaning": "bawaan", "id_example": "Kemampuan bawaannya untuk berhubungan dengan orang lain menjadikannya seorang negosiator yang luar biasa."}, "223:innocuous": {"vi_meaning": "vô hại", "vi_example": "Những gì tưởng chừng như là một sự thay đổi chính sách vô hại đã gây ra những hậu quả sâu rộng.", "th_meaning": "ไม่มีอันตราย", "th_example": "สิ่งที่ดูเหมือนการเปลี่ยนแปลงนโยบายที่ไม่เป็นอันตรายนั้นส่งผลกระทบในวงกว้าง", "id_meaning": "tidak berbahaya", "id_example": "Perubahan kebijakan yang tampaknya tidak berbahaya ternyata memiliki konsekuensi yang luas."}, "224:innovative": {"vi_meaning": "đổi mới", "vi_example": "Phương pháp đóng gói sáng tạo của công ty đã giảm chất thải xuống 30%.", "th_meaning": "นวัตกรรม", "th_example": "แนวทางใหม่ของบริษัทในด้านบรรจุภัณฑ์ช่วยลดของเสียลงสามสิบเปอร์เซ็นต์", "id_meaning": "inovatif", "id_example": "Pendekatan inovatif perusahaan terhadap pengemasan mengurangi limbah hingga tiga puluh persen."}, "225:inordinate": {"vi_meaning": "quá mức", "vi_example": "Đã dành quá nhiều thời gian để giải quyết tranh chấp thanh toán.", "th_meaning": "มากเกินไป", "th_example": "ใช้เวลามากเกินไปในการแก้ไขข้อพิพาทเรื่องการเรียกเก็บเงิน", "id_meaning": "banyak sekali", "id_example": "Banyak sekali waktu yang dihabiskan untuk menyelesaikan sengketa penagihan."}, "226:insightful": {"vi_meaning": "sâu sắc", "vi_example": "Nhà phân tích đã đưa ra bình luận sâu sắc về động lực của thị trường mới nổi.", "th_meaning": "ลึกซึ้ง", "th_example": "นักวิเคราะห์ให้ความเห็นเชิงลึกเกี่ยวกับการเปลี่ยนแปลงของตลาดเกิดใหม่", "id_meaning": "berwawasan luas", "id_example": "Analis tersebut memberikan komentar mendalam mengenai dinamika pasar negara berkembang."}, "227:instigate": {"vi_meaning": "xúi giục", "vi_example": "Báo cáo của người tố giác đã giúp tiến hành một cuộc điều tra nội bộ kỹ lưỡng.", "th_meaning": "กระตุ้น", "th_example": "รายงานของผู้แจ้งเบาะแสช่วยกระตุ้นให้มีการสอบสวนภายในอย่างละเอียด", "id_meaning": "menghasut", "id_example": "Laporan pelapor membantu memulai penyelidikan internal secara menyeluruh."}, "228:integral": {"vi_meaning": "tích phân", "vi_example": "Phân tích dữ liệu đã trở thành một phần không thể thiếu trong quá trình ra quyết định kinh doanh hiện đại.", "th_meaning": "บูรณาการ", "th_example": "การวิเคราะห์ข้อมูลได้กลายเป็นส่วนสำคัญในกระบวนการตัดสินใจทางธุรกิจสมัยใหม่", "id_meaning": "integral", "id_example": "Analisis data telah menjadi bagian integral dari proses pengambilan keputusan bisnis modern."}, "229:intermittent": {"vi_meaning": "không liên tục", "vi_example": "Nhà máy gặp phải tình trạng mất điện liên tục làm gián đoạn lịch trình sản xuất.", "th_meaning": "ไม่ต่อเนื่อง", "th_example": "โรงงานประสบปัญหาไฟฟ้าดับเป็นระยะๆ ส่งผลให้ตารางการผลิตต้องหยุดชะงัก", "id_meaning": "berselang", "id_example": "Pabrik mengalami pemadaman listrik secara berkala sehingga mengganggu jadwal produksi."}, "230:interpolate": {"vi_meaning": "suy ra", "vi_example": "Nhà nghiên cứu phải nội suy các điểm dữ liệu bị thiếu từ các giá trị liền kề.", "th_meaning": "สอดแทรก", "th_example": "ผู้วิจัยต้องแก้ไขจุดข้อมูลที่ขาดหายไปจากค่าที่อยู่ติดกัน", "id_meaning": "menambah", "id_example": "Peneliti harus menginterpolasi titik data yang hilang dari nilai yang berdekatan."}, "231:intractable": {"vi_meaning": "khó chữa", "vi_example": "Tranh chấp về quyền sở hữu trí tuệ tỏ ra khó giải quyết.", "th_meaning": "ดื้อดึง", "th_example": "ข้อพิพาทเรื่องสิทธิในทรัพย์สินทางปัญญาได้รับการพิสูจน์แล้วว่าไม่สามารถแก้ไขได้", "id_meaning": "keras kepala", "id_example": "Perselisihan mengenai hak kekayaan intelektual terbukti tidak dapat diselesaikan."}, "232:intricate": {"vi_meaning": "phức tạp", "vi_example": "Chuỗi cung ứng phức tạp đòi hỏi sự phối hợp cẩn thận giữa nhiều nhà cung cấp.", "th_meaning": "ซับซ้อน", "th_example": "ห่วงโซ่อุปทานที่ซับซ้อนต้องอาศัยการประสานงานอย่างรอบคอบระหว่างผู้ขายหลายราย", "id_meaning": "rumit", "id_example": "Rantai pasokan yang rumit memerlukan koordinasi yang cermat antara banyak vendor."}, "233:intrinsic": {"vi_meaning": "nội tại", "vi_example": "Động lực của nhân viên được thúc đẩy bởi cả sự hài lòng nội tại và phần thưởng bên ngoài.", "th_meaning": "แท้จริง", "th_example": "แรงจูงใจของพนักงานขับเคลื่อนด้วยความพึงพอใจจากภายในและผลตอบแทนจากภายนอก", "id_meaning": "hakiki", "id_example": "Motivasi karyawan didorong oleh kepuasan intrinsik dan penghargaan eksternal."}, "234:inundate": {"vi_meaning": "tràn ngập", "vi_example": "Nhóm dịch vụ khách hàng đã nhận được vô số lời phàn nàn sau khi hệ thống ngừng hoạt động.", "th_meaning": "น้ำท่วม", "th_example": "ทีมงานบริการลูกค้าได้รับข้อร้องเรียนมากมายหลังจากระบบขัดข้อง", "id_meaning": "membanjiri", "id_example": "Tim layanan pelanggan dibanjiri keluhan setelah sistem padam."}, "235:invalidate": {"vi_meaning": "làm mất hiệu lực", "vi_example": "Một lỗi thủ tục duy nhất có thể làm mất hiệu lực toàn bộ nghiên cứu.", "th_meaning": "ไม่ถูกต้อง", "th_example": "ข้อผิดพลาดขั้นตอนเดียวอาจทำให้การศึกษาวิจัยทั้งหมดเป็นโมฆะ", "id_meaning": "membatalkan", "id_example": "Satu kesalahan prosedur dapat membuat seluruh penelitian menjadi tidak valid."}, "236:invoke": {"vi_meaning": "gọi", "vi_example": "Công ty đã chọn viện dẫn điều khoản trọng tài trong hợp đồng ban đầu.", "th_meaning": "วิงวอน", "th_example": "บริษัทเลือกที่จะใช้ข้อกำหนดอนุญาโตตุลาการในสัญญาเดิม", "id_meaning": "memohon", "id_example": "Perusahaan memilih untuk menggunakan klausul arbitrase dalam kontrak aslinya."}, "237:irreconcilable": {"vi_meaning": "không thể hòa giải", "vi_example": "Những khác biệt không thể hòa giải giữa những người sáng lập đã dẫn đến sự chia rẽ của công ty.", "th_meaning": "เข้ากันไม่ได้", "th_example": "ความแตกต่างที่เข้ากันไม่ได้ระหว่างผู้ก่อตั้งนำไปสู่การแตกแยกบริษัท", "id_meaning": "tidak dapat didamaikan", "id_example": "Perbedaan pendapat yang tidak dapat didamaikan antara para pendiri menyebabkan perpecahan perusahaan."}, "238:irrevocable": {"vi_meaning": "không thể hủy bỏ", "vi_example": "Sau khi được ký kết, thỏa thuận sẽ trở thành không thể hủy ngang và ràng buộc về mặt pháp lý đối với tất cả các bên.", "th_meaning": "เอาคืนไม่ได้", "th_example": "เมื่อลงนามแล้ว ข้อตกลงดังกล่าวจะไม่สามารถเพิกถอนได้และมีผลผูกพันทางกฎหมายสำหรับทุกฝ่าย", "id_meaning": "tidak dapat dibatalkan", "id_example": "Setelah ditandatangani, perjanjian tersebut menjadi tidak dapat dibatalkan dan mengikat secara hukum bagi semua pihak."}, "239:iterate": {"vi_meaning": "lặp đi lặp lại", "vi_example": "Nhóm phát triển sẽ lặp lại nguyên mẫu dựa trên phản hồi của người dùng.", "th_meaning": "ย้ำ", "th_example": "ทีมพัฒนาจะทำซ้ำต้นแบบตามความคิดเห็นของผู้ใช้", "id_meaning": "mengulangi", "id_example": "Tim pengembangan akan mengulangi prototipe berdasarkan masukan pengguna."}, "240:jeopardize": {"vi_meaning": "gây nguy hiểm", "vi_example": "Việc không tuân thủ các quy định có thể gây nguy hiểm cho giấy phép hoạt động của công ty.", "th_meaning": "เป็นอันตรายต่อ", "th_example": "การไม่ปฏิบัติตามกฎระเบียบอาจเป็นอันตรายต่อใบอนุญาตประกอบกิจการของบริษัท", "id_meaning": "membahayakan", "id_example": "Kegagalan untuk mematuhi peraturan dapat membahayakan izin operasi perusahaan."}, "241:judicious": {"vi_meaning": "khôn ngoan", "vi_example": "Việc phân bổ nguồn lực hợp lý là điều cần thiết trong thời kỳ thắt lưng buộc bụng về tài chính.", "th_meaning": "รอบคอบ", "th_example": "การจัดสรรทรัพยากรอย่างรอบคอบถือเป็นสิ่งสำคัญในช่วงที่มีความเข้มงวดทางการคลัง", "id_meaning": "bijaksana", "id_example": "Alokasi sumber daya yang bijaksana sangat penting selama periode penghematan fiskal."}, "242:juxtapose": {"vi_meaning": "đặt cạnh nhau", "vi_example": "Báo cáo đặt dữ liệu hiệu suất hiện tại cạnh các điểm chuẩn lịch sử.", "th_meaning": "วางเคียงกัน", "th_example": "รายงานนี้วางข้อมูลประสิทธิภาพปัจจุบันเทียบกับเกณฑ์มาตรฐานในอดีต", "id_meaning": "mendekatkan", "id_example": "Laporan ini menyandingkan data kinerja saat ini dengan tolok ukur historis."}, "243:kindle": {"vi_meaning": "thiêu", "vi_example": "Sáng kiến ​​mới này nhằm mục đích khơi dậy sự nhiệt tình đối với sự bền vững trong toàn bộ lực lượng lao động.", "th_meaning": "จุดไฟ", "th_example": "โครงการริเริ่มใหม่นี้มีจุดมุ่งหมายเพื่อจุดประกายความกระตือรือร้นเพื่อความยั่งยืนทั่วทั้งบุคลากร", "id_meaning": "menyalakan", "id_example": "Inisiatif baru ini bertujuan untuk mengobarkan antusiasme terhadap keberlanjutan di seluruh angkatan kerja."}, "244:lackluster": {"vi_meaning": "mờ nhạt", "vi_example": "Báo cáo thu nhập mờ nhạt khiến các nhà phân tích thất vọng và đẩy giá cổ phiếu đi xuống.", "th_meaning": "ขาดความดแจ่มใส", "th_example": "รายงานผลประกอบการที่ซบเซาทำให้นักวิเคราะห์ผิดหวังและทำให้ราคาหุ้นร่วงลง", "id_meaning": "loyo", "id_example": "Laporan pendapatan yang lesu mengecewakan para analis dan mendorong harga saham turun."}, "245:lampoon": {"vi_meaning": "đèn đả kích", "vi_example": "Bài xã luận châm biếm phương thức kinh doanh lỗi thời của công ty.", "th_meaning": "ลำพูน", "th_example": "บทบรรณาธิการเหน็บแนมการดำเนินธุรกิจที่ล้าสมัยของบริษัทอย่างเสียดสี", "id_meaning": "mengecam", "id_example": "Editorial tersebut secara satir mengecam praktik bisnis perusahaan yang sudah ketinggalan zaman."}, "246:languish": {"vi_meaning": "mòn mỏi", "vi_example": "Một số dự án đầy hứa hẹn tiếp tục bị trì trệ do không đủ kinh phí.", "th_meaning": "อิดโรย", "th_example": "โครงการที่มีแนวโน้มดีหลายโครงการยังคงซบเซาเนื่องจากเงินทุนไม่เพียงพอ", "id_meaning": "merana", "id_example": "Beberapa proyek menjanjikan terus terhenti karena pendanaan yang tidak mencukupi."}, "247:latent": {"vi_meaning": "tiềm ẩn", "vi_example": "Việc sáp nhập bộc lộ sức mạnh tổng hợp tiềm ẩn mà cả hai công ty đều không lường trước được.", "th_meaning": "แฝงอยู่", "th_example": "การควบรวมกิจการเผยให้เห็นการทำงานร่วมกันที่แฝงอยู่ซึ่งทั้งสองบริษัทไม่คาดคิดมาก่อน", "id_meaning": "terpendam", "id_example": "Penggabungan tersebut mengungkapkan sinergi laten yang tidak diantisipasi oleh kedua perusahaan."}, "248:laudable": {"vi_meaning": "đáng khen ngợi", "vi_example": "Cam kết của công ty về tính trung hòa carbon là một mục tiêu đáng khen ngợi của công ty.", "th_meaning": "น่ายกย่อง", "th_example": "ความมุ่งมั่นของบริษัทต่อความเป็นกลางทางคาร์บอนถือเป็นเป้าหมายขององค์กรที่น่ายกย่อง", "id_meaning": "terpuji", "id_example": "Komitmen perusahaan terhadap netralitas karbon merupakan tujuan perusahaan yang patut dipuji."}, "249:lavish": {"vi_meaning": "xa hoa", "vi_example": "Công ty đã tổ chức một buổi dạ tiệc xa hoa để kỷ niệm 50 năm thành lập.", "th_meaning": "ฟุ่มเฟือย", "th_example": "บริษัทได้จัดงานกาล่าดินเนอร์สุดหรูเพื่อเฉลิมฉลองความสำเร็จครบรอบ 50 ปี", "id_meaning": "mewah", "id_example": "Perusahaan mengadakan pesta mewah untuk merayakan hari jadinya yang kelima puluh."}, "250:legitimate": {"vi_meaning": "hợp pháp", "vi_example": "Người lao động có mối quan ngại chính đáng về an ninh việc làm trong quá trình tái cơ cấu.", "th_meaning": "ถูกต้องตามกฎหมาย", "th_example": "พนักงานมีความกังวลเกี่ยวกับความปลอดภัยของงานในระหว่างการปรับโครงสร้างใหม่", "id_meaning": "sah", "id_example": "Karyawan memiliki kekhawatiran yang sah mengenai keamanan kerja selama restrukturisasi."}, "251:lenient": {"vi_meaning": "khoan dung", "vi_example": "Thẩm phán đã khoan dung một cách đáng ngạc nhiên khi kết án vụ lừa đảo doanh nghiệp.", "th_meaning": "ผ่อนปรน", "th_example": "ผู้พิพากษาผ่อนปรนอย่างน่าประหลาดใจในการตัดสินคดีฉ้อโกงบริษัท", "id_meaning": "lunak", "id_example": "Hakim secara mengejutkan bersikap lunak dalam menjatuhkan hukuman pada kasus penipuan perusahaan."}, "252:leverage": {"vi_meaning": "đòn bẩy", "vi_example": "Công ty có kế hoạch tận dụng sự nhận diện thương hiệu của mình để thâm nhập các thị trường mới.", "th_meaning": "เลเวอเรจ", "th_example": "บริษัทวางแผนที่จะใช้ประโยชน์จากการจดจำแบรนด์เพื่อเข้าสู่ตลาดใหม่ๆ", "id_meaning": "manfaat", "id_example": "Perusahaan berencana untuk memanfaatkan pengenalan mereknya untuk memasuki pasar baru."}, "253:liaison": {"vi_meaning": "người liên lạc", "vi_example": "Cô đóng vai trò là người liên lạc chính giữa trụ sở chính và các văn phòng khu vực.", "th_meaning": "ผู้ประสานงาน", "th_example": "เธอทำหน้าที่เป็นผู้ประสานงานหลักระหว่างสำนักงานใหญ่และสำนักงานภูมิภาค", "id_meaning": "hubungan", "id_example": "Dia berfungsi sebagai penghubung utama antara kantor pusat dan kantor regional."}, "254:lucid": {"vi_meaning": "sáng suốt", "vi_example": "Chủ tịch đã đưa ra lời giải thích rõ ràng về kế hoạch tái tổ chức phức tạp.", "th_meaning": "สุวิมล", "th_example": "ประธานได้ให้คำอธิบายที่ชัดเจนเกี่ยวกับแผนการปรับโครงสร้างองค์กรที่ซับซ้อน", "id_meaning": "jelas", "id_example": "Ketua menyampaikan penjelasan gamblang tentang rencana reorganisasi yang rumit."}, "255:lucrative": {"vi_meaning": "sinh lời", "vi_example": "Hợp đồng ở nước ngoài hóa ra sinh lợi nhiều hơn dự đoán.", "th_meaning": "ร่ำรวย", "th_example": "สัญญาในต่างประเทศมีกำไรมากกว่าที่คาดไว้มาก", "id_meaning": "menguntungkan", "id_example": "Kontrak luar negeri ternyata jauh lebih menguntungkan daripada yang diperkirakan."}, "256:magnanimous": {"vi_meaning": "cao thượng", "vi_example": "Cử chỉ cao cả của công ty mua lại đã bảo toàn được tất cả công việc hiện có.", "th_meaning": "ใจกว้าง", "th_example": "ท่าทางเอื้อเฟื้อเผื่อแผ่ของบริษัทผู้ซื้อจะรักษางานที่มีอยู่ทั้งหมดไว้", "id_meaning": "murah hati", "id_example": "Sikap murah hati dari perusahaan yang mengakuisisi mempertahankan semua pekerjaan yang ada."}, "257:malicious": {"vi_meaning": "độc hại", "vi_example": "Bộ phận CNTT đã phát hiện một nỗ lực độc hại nhằm truy cập cơ sở dữ liệu bí mật.", "th_meaning": "เป็นอันตราย", "th_example": "แผนกไอทีตรวจพบความพยายามที่เป็นอันตรายในการเข้าถึงฐานข้อมูลที่เป็นความลับ", "id_meaning": "jahat", "id_example": "Departemen TI mendeteksi upaya jahat untuk mengakses database rahasia."}, "258:mandate": {"vi_meaning": "ủy quyền", "vi_example": "Chính phủ đã ban hành lệnh yêu cầu tất cả các công ty phải tiết lộ dữ liệu phát thải.", "th_meaning": "อาณัติ", "th_example": "รัฐบาลออกคำสั่งให้บริษัททั้งหมดเปิดเผยข้อมูลการปล่อยก๊าซเรือนกระจก", "id_meaning": "mandat", "id_example": "Pemerintah mengeluarkan mandat yang mewajibkan semua perusahaan untuk mengungkapkan data emisi."}, "259:manifest": {"vi_meaning": "biểu hiện", "vi_example": "Lợi ích của chính sách mới đã trở nên rõ ràng trong quý đầu tiên.", "th_meaning": "ประจักษ์", "th_example": "ประโยชน์ของนโยบายใหม่ปรากฏชัดภายในไตรมาสแรก", "id_meaning": "tampak", "id_example": "Manfaat kebijakan baru ini mulai terlihat pada kuartal pertama."}, "260:manipulate": {"vi_meaning": "thao túng", "vi_example": "Các giám đốc điều hành bị cáo buộc cố gắng thao túng giá cổ phiếu của công ty.", "th_meaning": "จัดการ", "th_example": "ผู้บริหารถูกกล่าวหาว่าพยายามปั่นราคาหุ้นของบริษัท", "id_meaning": "memanipulasi", "id_example": "Para eksekutif dituduh berusaha memanipulasi harga saham perusahaan."}, "261:meander": {"vi_meaning": "quanh co", "vi_example": "Cuộc thảo luận bắt đầu đi chệch khỏi các mục tiêu chiến lược cốt lõi.", "th_meaning": "คดเคี้ยว", "th_example": "การอภิปรายเริ่มเบี่ยงเบนไปจากวัตถุประสงค์เชิงกลยุทธ์หลัก", "id_meaning": "berliku-liku", "id_example": "Diskusi mulai menyimpang dari tujuan strategis inti."}, "262:meticulous": {"vi_meaning": "tỉ mỉ", "vi_example": "Sự chú ý tỉ mỉ đến từng chi tiết của người kế toán đã ngăn ngừa được một lỗi thanh toán tốn kém.", "th_meaning": "พิถีพิถัน", "th_example": "ความใส่ใจในรายละเอียดของนักบัญชีอย่างพิถีพิถันช่วยป้องกันข้อผิดพลาดในการเรียกเก็บเงินที่มีค่าใช้จ่ายสูง", "id_meaning": "teliti", "id_example": "Perhatian akuntan yang cermat terhadap detail mencegah kesalahan penagihan yang merugikan."}, "263:mitigate": {"vi_meaning": "giảm nhẹ", "vi_example": "Công ty đã thực hiện các biện pháp nhằm giảm thiểu tác động của việc chi phí nguyên vật liệu tăng cao.", "th_meaning": "บรรเทา", "th_example": "บริษัทได้ดำเนินมาตรการเพื่อลดผลกระทบของต้นทุนวัสดุที่สูงขึ้น", "id_meaning": "mengurangi", "id_example": "Perusahaan menerapkan langkah-langkah untuk memitigasi dampak kenaikan biaya material."}, "264:mollify": {"vi_meaning": "xoa dịu", "vi_example": "Giám đốc điều hành đã đưa ra lời xin lỗi cá nhân để xoa dịu những cổ đông đang thất vọng.", "th_meaning": "ทำให้เป็นโมฆะ", "th_example": "ซีอีโอออกมาขอโทษเป็นการส่วนตัวเพื่อบรรเทาความหงุดหงิดของผู้ถือหุ้น", "id_meaning": "meredakan", "id_example": "CEO mengeluarkan permintaan maaf pribadi untuk menenangkan pemegang saham yang frustrasi."}, "265:momentous": {"vi_meaning": "quan trọng", "vi_example": "Lễ ký kết thỏa thuận thương mại quốc tế là một dịp quan trọng đối với cả hai nước.", "th_meaning": "สำคัญยิ่ง", "th_example": "การลงนามข้อตกลงการค้าระหว่างประเทศถือเป็นโอกาสสำคัญของทั้งสองประเทศ", "id_meaning": "sangat penting", "id_example": "Penandatanganan perjanjian perdagangan internasional merupakan peristiwa penting bagi kedua negara."}, "266:monopolize": {"vi_meaning": "độc chiếm", "vi_example": "Một công ty không thể được phép độc quyền toàn bộ thị trường viễn thông.", "th_meaning": "ผูกขาด", "th_example": "บริษัทเดียวไม่สามารถผูกขาดตลาดโทรคมนาคมทั้งหมดได้", "id_meaning": "memonopoli", "id_example": "Satu perusahaan tidak boleh memonopoli seluruh pasar telekomunikasi."}, "267:mundane": {"vi_meaning": "tầm thường", "vi_example": "Tự động hóa đã giải phóng nhân viên khỏi những công việc nhàm chán để tập trung vào công việc mang tính chiến lược.", "th_meaning": "โลกีย์", "th_example": "ระบบอัตโนมัติช่วยให้พนักงานเป็นอิสระจากงานธรรมดาๆ เพื่อมุ่งเน้นไปที่งานเชิงกลยุทธ์", "id_meaning": "biasa", "id_example": "Otomatisasi membebaskan karyawan dari tugas-tugas duniawi untuk fokus pada pekerjaan strategis."}, "268:nascent": {"vi_meaning": "mới sinh", "vi_example": "Ngành công nghiệp du lịch vũ trụ non trẻ đang thu hút các nhà đầu tư tư nhân lớn.", "th_meaning": "ตั้งไข่", "th_example": "อุตสาหกรรมการท่องเที่ยวอวกาศที่เพิ่งเริ่มใหม่กำลังดึงดูดนักลงทุนเอกชนรายใหญ่", "id_meaning": "baru lahir", "id_example": "Industri wisata luar angkasa yang baru lahir menarik investor swasta besar."}, "269:negate": {"vi_meaning": "phủ định", "vi_example": "Những chi phí bất ngờ sẽ phủ nhận một cách hiệu quả những khoản tiết kiệm được nhờ tái cơ cấu.", "th_meaning": "ปฏิเสธ", "th_example": "ต้นทุนที่ไม่คาดคิดจะลบล้างการประหยัดที่เกิดขึ้นจากการปรับโครงสร้างใหม่ได้อย่างมีประสิทธิภาพ", "id_meaning": "meniadakan", "id_example": "Biaya tak terduga secara efektif meniadakan penghematan yang dicapai melalui restrukturisasi."}, "270:negligible": {"vi_meaning": "không đáng kể", "vi_example": "Tác động môi trường của dự án đề xuất được coi là không đáng kể.", "th_meaning": "เล็กน้อย", "th_example": "ผลกระทบต่อสิ่งแวดล้อมของโครงการที่เสนอถือว่ามีน้อยมาก", "id_meaning": "dapat diabaikan", "id_example": "Dampak lingkungan dari proyek yang diusulkan dianggap dapat diabaikan."}, "271:nominate": {"vi_meaning": "đề cử", "vi_example": "Ủy ban sẽ đề cử ba ứng cử viên cho vị trí giám đốc điều hành.", "th_meaning": "เสนอชื่อ", "th_example": "คณะกรรมการจะเสนอชื่อบุคคลเข้าดำรงตำแหน่งกรรมการบริหารจำนวน 3 ท่าน", "id_meaning": "mencalonkan", "id_example": "Panitia akan mencalonkan tiga calon direktur eksekutif."}, "272:nonchalant": {"vi_meaning": "thờ ơ", "vi_example": "Thái độ thờ ơ của anh ta đối với thời hạn khiến người quản lý dự án lo ngại.", "th_meaning": "ไม่เมินเฉย", "th_example": "ทัศนคติที่ไม่เมินเฉยต่อกำหนดเวลาของเขาเกี่ยวข้องกับผู้จัดการโครงการ", "id_meaning": "acuh tak acuh", "id_example": "Sikapnya yang acuh tak acuh terhadap tenggat waktu membuat manajer proyek khawatir."}, "273:notoriety": {"vi_meaning": "tai tiếng", "vi_example": "Vụ vi phạm dữ liệu đã mang lại tai tiếng không mong muốn cho công ty công nghệ từng được kính trọng.", "th_meaning": "ความอื้อฉาว", "th_example": "การละเมิดข้อมูลได้นำความอื้อฉาวที่ไม่พึงประสงค์มาสู่บริษัทเทคโนโลยีที่เคยได้รับความนับถือ", "id_meaning": "kemasyhuran", "id_example": "Pelanggaran data membawa ketenaran yang tidak diinginkan bagi perusahaan teknologi yang pernah disegani itu."}, "274:novice": {"vi_meaning": "người mới vào nghề", "vi_example": "Chương trình đào tạo được thiết kế đặc biệt cho các nhà phân tích đầu tư mới vào nghề.", "th_meaning": "สามเณร", "th_example": "โปรแกรมการฝึกอบรมได้รับการออกแบบมาโดยเฉพาะสำหรับนักวิเคราะห์การลงทุนมือใหม่", "id_meaning": "pemula", "id_example": "Program pelatihan ini dirancang khusus untuk analis investasi pemula."}, "275:nuance": {"vi_meaning": "sắc thái", "vi_example": "Hiểu các sắc thái văn hóa là điều cần thiết để đàm phán quốc tế thành công.", "th_meaning": "แตกต่างกันนิดหน่อย", "th_example": "การทำความเข้าใจความแตกต่างทางวัฒนธรรมถือเป็นสิ่งสำคัญสำหรับการเจรจาระหว่างประเทศที่ประสบความสำเร็จ", "id_meaning": "nuansa", "id_example": "Memahami nuansa budaya sangat penting untuk keberhasilan negosiasi internasional."}, "276:nullify": {"vi_meaning": "vô hiệu hóa", "vi_example": "Tòa án ra phán quyết vô hiệu hóa điều khoản không cạnh tranh trong hợp đồng lao động.", "th_meaning": "ทำให้เป็นโมฆะ", "th_example": "ศาลพิพากษาให้ข้อไม่แข่งขันในสัญญาจ้างงานเป็นโมฆะ", "id_meaning": "membatalkan", "id_example": "Pengadilan memutuskan untuk membatalkan klausul non-bersaing dalam kontrak kerja."}, "277:nurture": {"vi_meaning": "nuôi dưỡng", "vi_example": "Các nhà lãnh đạo vĩ đại nuôi dưỡng tài năng bằng cách cung cấp các cơ hội cố vấn và phát triển.", "th_meaning": "เลี้ยงดู", "th_example": "ผู้นำที่ยิ่งใหญ่จะบ่มเพาะผู้มีความสามารถโดยการให้คำปรึกษาและโอกาสในการเติบโต", "id_meaning": "membina", "id_example": "Pemimpin hebat memupuk bakat dengan memberikan bimbingan dan peluang pertumbuhan."}, "278:obfuscate": {"vi_meaning": "làm xáo trộn", "vi_example": "Người phát ngôn dường như cố tình làm xáo trộn sự thật trong cuộc phỏng vấn.", "th_meaning": "ทำให้สับสน", "th_example": "โฆษกดูเหมือนจงใจปกปิดข้อเท็จจริงระหว่างการสัมภาษณ์", "id_meaning": "menggelapkan", "id_example": "Juru bicara tersebut sepertinya sengaja mengaburkan fakta selama wawancara."}, "279:obligatory": {"vi_meaning": "bắt buộc", "vi_example": "Việc tham gia khóa đào tạo tuân thủ hàng năm là bắt buộc đối với tất cả nhân viên.", "th_meaning": "บังคับ", "th_example": "การเข้าร่วมการฝึกอบรมการปฏิบัติตามกฎระเบียบประจำปีเป็นสิ่งจำเป็นสำหรับพนักงานทุกคน", "id_meaning": "wajib", "id_example": "Kehadiran pada sesi pelatihan kepatuhan tahunan adalah wajib bagi semua staf."}, "280:oblique": {"vi_meaning": "xiên", "vi_example": "Việc ông ám chỉ vụ bê bối một cách gián tiếp đã thu hút sự chú ý của các nhà báo.", "th_meaning": "เฉียง", "th_example": "การอ้างอิงถึงเรื่องอื้อฉาวแบบอ้อม ๆ ของเขาดึงดูดความสนใจของนักข่าว", "id_meaning": "miring", "id_example": "Referensi miringnya terhadap skandal tersebut menarik perhatian jurnalis."}, "281:obscure": {"vi_meaning": "mơ hồ", "vi_example": "Những chi tiết quan trọng đã bị che khuất bởi những thuật ngữ kỹ thuật không cần thiết.", "th_meaning": "ปิดบัง", "th_example": "รายละเอียดที่สำคัญถูกบดบังด้วยศัพท์แสงทางเทคนิคที่ไม่จำเป็น", "id_meaning": "samar", "id_example": "Detail penting dikaburkan oleh jargon teknis yang tidak perlu."}, "282:obsolete": {"vi_meaning": "lỗi thời", "vi_example": "Những tiến bộ công nghệ nhanh chóng đã khiến nhiều quy trình truyền thống trở nên lỗi thời.", "th_meaning": "ล้าสมัย", "th_example": "ความก้าวหน้าทางเทคโนโลยีที่รวดเร็วทำให้กระบวนการดั้งเดิมหลายอย่างล้าสมัย", "id_meaning": "usang", "id_example": "Kemajuan teknologi yang pesat telah membuat banyak proses tradisional menjadi usang."}, "283:obstinate": {"vi_meaning": "cố chấp", "vi_example": "Người đàm phán ngoan cố đã từ chối xem xét bất kỳ đề xuất thay thế nào.", "th_meaning": "ดื้อรั้น", "th_example": "ผู้เจรจาที่ดื้อรั้นปฏิเสธที่จะพิจารณาข้อเสนออื่นใด", "id_meaning": "keras kepala", "id_example": "Negosiator yang keras kepala itu menolak mempertimbangkan usulan alternatif apa pun."}, "284:obviate": {"vi_meaning": "loại bỏ", "vi_example": "Hệ thống tự động mới sẽ loại bỏ nhu cầu nhập dữ liệu thủ công.", "th_meaning": "หลบเลี่ยง", "th_example": "ระบบอัตโนมัติใหม่จะขจัดความจำเป็นในการป้อนข้อมูลด้วยตนเอง", "id_meaning": "meniadakan", "id_example": "Sistem otomatis yang baru akan meniadakan kebutuhan entri data manual."}, "285:omnipresent": {"vi_meaning": "có mặt khắp nơi", "vi_example": "Công nghệ kỹ thuật số đã trở nên phổ biến trong môi trường làm việc hiện đại.", "th_meaning": "อยู่ทั่วไปทุกหนทุกแห่ง", "th_example": "เทคโนโลยีดิจิทัลมีอยู่ทั่วไปทุกหนทุกแห่งในสภาพแวดล้อมการทำงานสมัยใหม่", "id_meaning": "ada di mana-mana", "id_example": "Teknologi digital telah hadir dimana-mana di lingkungan kerja modern."}, "286:onerous": {"vi_meaning": "khó khăn", "vi_example": "Các yêu cầu báo cáo khắt khe đã đặt gánh nặng lớn lên các doanh nghiệp nhỏ.", "th_meaning": "เป็นภาระ", "th_example": "ข้อกำหนดการรายงานที่ยุ่งยากทำให้เกิดภาระหนักแก่ธุรกิจขนาดเล็ก", "id_meaning": "berat", "id_example": "Persyaratan pelaporan yang berat memberikan beban berat pada usaha kecil."}, "287:opaque": {"vi_meaning": "mờ đục", "vi_example": "Báo cáo tài chính không rõ ràng của công ty đã làm dấy lên mối lo ngại giữa các cơ quan quản lý.", "th_meaning": "ทึบแสง", "th_example": "การรายงานทางการเงินที่ไม่ชัดเจนของบริษัททำให้เกิดความกังวลในหมู่หน่วยงานกำกับดูแล", "id_meaning": "buram", "id_example": "Pelaporan keuangan perusahaan yang tidak jelas menimbulkan kekhawatiran di kalangan badan pengawas."}, "288:optimal": {"vi_meaning": "tối ưu", "vi_example": "Việc tìm kiếm sự cân bằng tối ưu giữa chi phí và chất lượng là một thách thức không ngừng.", "th_meaning": "เหมาะสมที่สุด", "th_example": "การค้นหาสมดุลที่เหมาะสมที่สุดระหว่างต้นทุนและคุณภาพถือเป็นความท้าทายอย่างต่อเนื่อง", "id_meaning": "optimal", "id_example": "Menemukan keseimbangan optimal antara biaya dan kualitas merupakan tantangan yang terus-menerus."}, "289:opulent": {"vi_meaning": "sang trọng", "vi_example": "Trụ sở công ty sang trọng phản ánh lợi nhuận khổng lồ của công ty.", "th_meaning": "มั่งคั่ง", "th_example": "สำนักงานใหญ่ของบริษัทที่มั่งคั่งสะท้อนให้เห็นถึงความสามารถในการทำกำไรมหาศาลของบริษัท", "id_meaning": "mewah", "id_example": "Kantor pusat perusahaan yang mewah mencerminkan profitabilitas perusahaan yang sangat besar."}, "290:orthodox": {"vi_meaning": "chính thống", "vi_example": "Phương pháp tiếp thị chính thống của công ty đã bị thách thức bởi các xu hướng kỹ thuật số.", "th_meaning": "ดั้งเดิม", "th_example": "แนวทางการตลาดแบบดั้งเดิมของบริษัทถูกท้าทายจากกระแสดิจิทัล", "id_meaning": "ortodoks", "id_example": "Pendekatan ortodoks perusahaan terhadap pemasaran ditantang oleh tren digital."}, "291:oscillate": {"vi_meaning": "dao động", "vi_example": "Tâm lý thị trường tiếp tục dao động giữa lạc quan và bi quan sâu sắc.", "th_meaning": "สั่น", "th_example": "ความเชื่อมั่นของตลาดยังคงผันผวนระหว่างการมองโลกในแง่ดีและการมองโลกในแง่ร้ายอย่างลึกซึ้ง", "id_meaning": "berpaling", "id_example": "Sentimen pasar terus terombang-ambing antara optimisme dan pesimisme mendalam."}, "292:ostensible": {"vi_meaning": "bề ngoài", "vi_example": "Lý do bề ngoài của việc sáp nhập là hiệu quả hoạt động chứ không phải cắt giảm chi phí.", "th_meaning": "เห็นได้ชัด", "th_example": "เหตุผลที่ชัดเจนสำหรับการควบรวมกิจการคือประสิทธิภาพในการดำเนินงาน ไม่ใช่การลดต้นทุน", "id_meaning": "nyata", "id_example": "Alasan utama merger tersebut adalah efisiensi operasional, bukan pemotongan biaya."}, "293:ostentatious": {"vi_meaning": "phô trương", "vi_example": "Việc phô trương sự giàu có tại buổi dạ tiệc đã thu hút sự chỉ trích từ giới truyền thông.", "th_meaning": "โอ่อ่า", "th_example": "การแสดงความมั่งคั่งอย่างโอ้อวดในงานกาลาทำให้สื่อวิพากษ์วิจารณ์", "id_meaning": "sok", "id_example": "Pertunjukan kekayaan yang mencolok di pesta tersebut menuai kritik dari media."}, "294:outweigh": {"vi_meaning": "nặng hơn", "vi_example": "Lợi ích lâu dài của khoản đầu tư vượt xa chi phí vốn ban đầu.", "th_meaning": "เกินดุล", "th_example": "ผลประโยชน์ระยะยาวของการลงทุนมีมากกว่าต้นทุนเงินทุนเริ่มแรกมาก", "id_meaning": "lebih penting dr", "id_example": "Manfaat jangka panjang dari investasi ini jauh lebih besar daripada biaya modal awal."}, "295:overhaul": {"vi_meaning": "đại tu", "vi_example": "Công ty có kế hoạch đại tu hệ thống quản lý chuỗi cung ứng đã lỗi thời.", "th_meaning": "ยกเครื่อง", "th_example": "บริษัทวางแผนที่จะยกเครื่องระบบการจัดการห่วงโซ่อุปทานที่ล้าสมัย", "id_meaning": "pemeriksaan", "id_example": "Perusahaan berencana untuk merombak sistem manajemen rantai pasokannya yang sudah ketinggalan zaman."}, "296:oversight": {"vi_meaning": "giám sát", "vi_example": "Ủy ban giám sát quy định đảm bảo tuân thủ các tiêu chuẩn ngành.", "th_meaning": "การกำกับดูแล", "th_example": "คณะกรรมการกำกับดูแลด้านกฎระเบียบรับประกันการปฏิบัติตามมาตรฐานอุตสาหกรรม", "id_meaning": "pengawasan", "id_example": "Komite pengawas peraturan memastikan kepatuhan terhadap standar industri."}, "297:overt": {"vi_meaning": "công khai", "vi_example": "Công ty đã thực hiện các bước công khai để thể hiện cam kết của mình đối với sự đa dạng.", "th_meaning": "เปิดเผย", "th_example": "บริษัทได้ดำเนินการอย่างเปิดเผยเพื่อแสดงให้เห็นถึงความมุ่งมั่นต่อความหลากหลาย", "id_meaning": "terbuka", "id_example": "Perusahaan mengambil langkah nyata untuk menunjukkan komitmennya terhadap keberagaman."}, "298:paradigm": {"vi_meaning": "khuôn mẫu", "vi_example": "Cuộc cách mạng kỹ thuật số đã tạo ra một mô hình mới cho sự tham gia của người tiêu dùng.", "th_meaning": "กระบวนทัศน์", "th_example": "การปฏิวัติทางดิจิทัลได้สร้างกระบวนทัศน์ใหม่สำหรับการมีส่วนร่วมของผู้บริโภค", "id_meaning": "paradigma", "id_example": "Revolusi digital telah menciptakan paradigma baru dalam keterlibatan konsumen."}, "299:paradox": {"vi_meaning": "nghịch lý", "vi_example": "Nghịch lý năng suất cho thấy rằng nhiều công nghệ hơn không phải lúc nào cũng làm tăng sản lượng.", "th_meaning": "ความขัดแย้ง", "th_example": "ความขัดแย้งด้านประสิทธิภาพการผลิตชี้ให้เห็นว่าเทคโนโลยีที่มากขึ้นไม่ได้เพิ่มผลผลิตเสมอไป", "id_meaning": "paradoks", "id_example": "Paradoks produktivitas menunjukkan bahwa semakin banyak teknologi tidak selalu meningkatkan output."}, "300:paramount": {"vi_meaning": "tối quan trọng", "vi_example": "Sự an toàn của bệnh nhân là điều hết sức quan trọng trong ngành dược phẩm.", "th_meaning": "สิ่งสำคัญยิ่ง", "th_example": "ความปลอดภัยของผู้ป่วยมีความสำคัญอย่างยิ่งในอุตสาหกรรมยา", "id_meaning": "terpenting", "id_example": "Keselamatan pasien merupakan hal yang sangat penting dalam industri farmasi."}, "301:partisan": {"vi_meaning": "đảng phái", "vi_example": "Cuộc tranh luận giữa các đảng phái về quy định này đã làm trì hoãn việc thực hiện nó hàng tháng trời.", "th_meaning": "พรรคพวก", "th_example": "การอภิปรายพรรคพวกเกี่ยวกับกฎระเบียบดังกล่าวทำให้การดำเนินการล่าช้าไปหลายเดือน", "id_meaning": "partisan", "id_example": "Perdebatan partisan mengenai peraturan tersebut menunda penerapannya selama berbulan-bulan."}, "302:paucity": {"vi_meaning": "sự ít ỏi", "vi_example": "Sự thiếu hụt lao động lành nghề trong khu vực đặt ra một thách thức đáng kể.", "th_meaning": "ความขัดสน", "th_example": "ความขาดแคลนแรงงานที่มีทักษะในภูมิภาคถือเป็นความท้าทายที่สำคัญ", "id_meaning": "kekurangan", "id_example": "Kurangnya pekerja terampil di wilayah ini menimbulkan tantangan yang signifikan."}, "303:pecuniary": {"vi_meaning": "tiền bạc", "vi_example": "Giám đốc điều hành phải đối mặt với cả hình phạt tiền và cáo buộc hình sự vì gian lận.", "th_meaning": "การเงิน", "th_example": "ผู้บริหารต้องเผชิญกับทั้งบทลงโทษทางการเงินและข้อหาทางอาญาเนื่องจากการฉ้อโกง", "id_meaning": "uang", "id_example": "Eksekutif menghadapi hukuman berupa uang dan tuntutan pidana karena penipuan."}, "304:penchant": {"vi_meaning": "thiên hướng", "vi_example": "Người quản lý có thiên hướng tuyển dụng những ứng viên có nền tảng đa dạng.", "th_meaning": "ชอบใจ", "th_example": "ผู้จัดการมีความชื่นชอบในการจ้างผู้สมัครที่มีภูมิหลังที่หลากหลาย", "id_meaning": "kegemaran", "id_example": "Manajer memiliki kecenderungan untuk merekrut kandidat dengan latar belakang yang beragam."}, "305:perfunctory": {"vi_meaning": "chiếu lệ", "vi_example": "Người quản lý chỉ đưa ra đánh giá chiếu lệ về đề xuất chi tiết.", "th_meaning": "ลวก ๆ", "th_example": "ผู้จัดการให้เพียงการตรวจสอบข้อเสนอโดยละเอียดโดยเฉยๆ เท่านั้น", "id_meaning": "acuh tak acuh", "id_example": "Manajer hanya memberikan tinjauan asal-asalan terhadap proposal terperinci."}, "306:peripheral": {"vi_meaning": "ngoại vi", "vi_example": "Phản hồi của khách hàng cho thấy các tính năng ngoại vi ít được sử dụng.", "th_meaning": "อุปกรณ์ต่อพ่วง", "th_example": "เสียงตอบรับจากลูกค้าพบว่าฟีเจอร์ต่อพ่วงไม่ค่อยได้ใช้", "id_meaning": "periferal", "id_example": "Umpan balik pelanggan menunjukkan bahwa fitur periferal jarang digunakan."}, "307:permeate": {"vi_meaning": "thấm vào", "vi_example": "Văn hóa đổi mới nên thấm vào mọi cấp độ của tổ chức.", "th_meaning": "ซึม", "th_example": "วัฒนธรรมแห่งนวัตกรรมควรแทรกซึมอยู่ในทุกระดับขององค์กร", "id_meaning": "menyerap", "id_example": "Budaya inovasi harus meresap ke setiap tingkat organisasi."}, "308:perpetuate": {"vi_meaning": "kéo dài mãi", "vi_example": "Các chính sách lỗi thời có thể duy trì sự bất bình đẳng trong môi trường làm việc.", "th_meaning": "ยืดเยื้อ", "th_example": "นโยบายที่ล้าสมัยสามารถยืดเยื้อความไม่เท่าเทียมกันภายในสภาพแวดล้อมในที่ทำงาน", "id_meaning": "mengabadikan", "id_example": "Kebijakan yang ketinggalan jaman dapat melanggengkan kesenjangan di lingkungan kerja."}, "309:pertinent": {"vi_meaning": "thích hợp", "vi_example": "Vui lòng chỉ gửi các tài liệu liên quan đến cuộc điều tra đang diễn ra.", "th_meaning": "ที่เกี่ยวข้อง", "th_example": "กรุณาส่งเฉพาะเอกสารที่เกี่ยวข้องกับการสอบสวนที่กำลังดำเนินอยู่เท่านั้น", "id_meaning": "bersangkutan", "id_example": "Harap kirimkan hanya dokumen yang relevan dengan penyelidikan yang sedang berlangsung."}, "310:pervasive": {"vi_meaning": "tràn lan", "vi_example": "Ảnh hưởng lan rộng của phương tiện truyền thông xã hội đã làm thay đổi các chiến lược tiếp thị.", "th_meaning": "แพร่หลาย", "th_example": "อิทธิพลที่แพร่หลายของโซเชียลมีเดียได้เปลี่ยนแปลงกลยุทธ์ทางการตลาด", "id_meaning": "meresap", "id_example": "Pengaruh media sosial yang luas telah mengubah strategi pemasaran."}, "311:pinnacle": {"vi_meaning": "đỉnh cao", "vi_example": "Đạt đến đỉnh cao của ngành đòi hỏi nhiều thập kỷ nỗ lực bền bỉ.", "th_meaning": "จุดสุดยอด", "th_example": "การจะไปถึงจุดสุดยอดของอุตสาหกรรมต้องใช้ความพยายามที่ยั่งยืนมานานหลายทศวรรษ", "id_meaning": "puncak", "id_example": "Untuk mencapai puncak industri ini memerlukan upaya berkelanjutan selama puluhan tahun."}, "312:pivotal": {"vi_meaning": "then chốt", "vi_example": "Giám đốc tiếp thị đóng vai trò then chốt trong việc ra mắt sản phẩm trên toàn cầu.", "th_meaning": "การพิจาณา", "th_example": "ผู้อำนวยการฝ่ายการตลาดมีบทบาทสำคัญในการเปิดตัวผลิตภัณฑ์ทั่วโลก", "id_meaning": "sangat penting", "id_example": "Direktur pemasaran memainkan peran penting dalam peluncuran produk secara global."}, "313:placate": {"vi_meaning": "xoa dịu", "vi_example": "Công ty đưa ra các chính sách bảo hành mở rộng để xoa dịu những khách hàng lo ngại.", "th_meaning": "ปลอบใจ", "th_example": "บริษัทเสนอการรับประกันเพิ่มเติมเพื่อเอาใจลูกค้าที่เกี่ยวข้อง", "id_meaning": "menenangkan", "id_example": "Perusahaan menawarkan perpanjangan garansi untuk menenangkan pelanggan yang bersangkutan."}, "314:plausible": {"vi_meaning": "có lý", "vi_example": "Nhà tư vấn đưa ra lời giải thích hợp lý cho sự sụt giảm doanh thu hàng quý.", "th_meaning": "เป็นไปได้", "th_example": "ที่ปรึกษาเสนอคำอธิบายที่เป็นไปได้สำหรับการลดลงของรายได้รายไตรมาส", "id_meaning": "masuk akal", "id_example": "Konsultan tersebut menawarkan penjelasan yang masuk akal atas penurunan pendapatan triwulanan."}, "315:polarize": {"vi_meaning": "phân cực", "vi_example": "Việc sáp nhập được đề xuất tiếp tục phân cực các ý kiến ​​​​trong ngành.", "th_meaning": "โพลาไรซ์", "th_example": "การควบรวมกิจการที่เสนอยังคงทำให้เกิดขั้วความคิดเห็นภายในอุตสาหกรรม", "id_meaning": "mempolarisasikan", "id_example": "Penggabungan yang diusulkan terus menimbulkan polarisasi pendapat di dalam industri."}, "316:pragmatic": {"vi_meaning": "thực dụng", "vi_example": "Hội đồng quản trị đã áp dụng một cách tiếp cận thực tế để giải quyết tình trạng thiếu hụt ngân sách.", "th_meaning": "ในทางปฏิบัติ", "th_example": "คณะกรรมการได้ใช้แนวทางเชิงปฏิบัติเพื่อแก้ไขปัญหาการขาดแคลนงบประมาณ", "id_meaning": "pragmatis", "id_example": "Dewan mengadopsi pendekatan pragmatis untuk mengatasi kekurangan anggaran."}, "317:precarious": {"vi_meaning": "bấp bênh", "vi_example": "Tình hình tài chính bấp bênh của công ty đe dọa sự tồn tại lâu dài của công ty.", "th_meaning": "ล่อแหลม", "th_example": "ฐานะทางการเงินที่ไม่มั่นคงของบริษัทเป็นภัยคุกคามต่อความอยู่รอดในระยะยาว", "id_meaning": "genting", "id_example": "Posisi keuangan perusahaan yang genting mengancam kelangsungan hidup jangka panjangnya."}, "318:precedent": {"vi_meaning": "tiền lệ", "vi_example": "Phán quyết này đặt ra tiền lệ pháp lý quan trọng cho các vụ kiện sở hữu trí tuệ trong tương lai.", "th_meaning": "แบบอย่าง", "th_example": "คำตัดสินดังกล่าวถือเป็นบรรทัดฐานทางกฎหมายที่สำคัญสำหรับคดีทรัพย์สินทางปัญญาในอนาคต", "id_meaning": "preseden", "id_example": "Keputusan tersebut menjadi preseden hukum yang penting untuk kasus kekayaan intelektual di masa depan."}, "319:preclude": {"vi_meaning": "ngăn cản", "vi_example": "Xung đột lợi ích sẽ ngăn cản anh ta phục vụ trong ủy ban.", "th_meaning": "ขัดขวาง", "th_example": "ความขัดแย้งทางผลประโยชน์จะทำให้เขาไม่สามารถดำรงตำแหน่งเป็นคณะกรรมการได้", "id_meaning": "menghalangi", "id_example": "Konflik kepentingan akan menghalangi dia untuk bertugas di komite."}, "320:precursor": {"vi_meaning": "tiền thân", "vi_example": "Chương trình thí điểm đóng vai trò là tiền đề cho việc triển khai chính sách trên toàn công ty.", "th_meaning": "สารตั้งต้น", "th_example": "โครงการนำร่องทำหน้าที่เป็นตัวตั้งต้นในการเปิดตัวนโยบายทั่วทั้งบริษัท", "id_meaning": "pendahulu", "id_example": "Program percontohan ini berfungsi sebagai pendahuluan bagi peluncuran kebijakan di seluruh perusahaan."}, "321:predicament": {"vi_meaning": "tình trạng khó khăn", "vi_example": "Việc mất nhà cung cấp chính đột ngột khiến công ty rơi vào tình thế khó khăn.", "th_meaning": "สถานการณ์", "th_example": "การสูญเสียซัพพลายเออร์หลักอย่างกะทันหันทำให้บริษัทตกอยู่ในสถานการณ์ที่ยากลำบาก", "id_meaning": "keadaan sulit", "id_example": "Hilangnya pemasok utama secara tiba-tiba menempatkan perusahaan dalam kesulitan."}, "322:predominant": {"vi_meaning": "chiếm ưu thế", "vi_example": "Quan điểm chủ yếu của các nhà phân tích là lãi suất sẽ vẫn ổn định.", "th_meaning": "เด่น", "th_example": "มุมมองที่โดดเด่นในหมู่นักวิเคราะห์คืออัตราดอกเบี้ยจะยังคงมีเสถียรภาพ", "id_meaning": "utama", "id_example": "Pandangan utama di kalangan analis adalah bahwa suku bunga akan tetap stabil."}, "323:preempt": {"vi_meaning": "đánh trước", "vi_example": "Công ty đã đưa ra một tuyên bố để ngăn chặn bất kỳ phương tiện truyền thông tiêu cực nào đưa tin.", "th_meaning": "ยึดถือ", "th_example": "บริษัทได้ออกแถลงการณ์เพื่อระงับการรายงานข่าวเชิงลบใดๆ", "id_meaning": "mendahului", "id_example": "Perusahaan mengeluarkan pernyataan untuk mencegah pemberitaan media yang negatif."}, "324:preliminary": {"vi_meaning": "sơ bộ", "vi_example": "Những phát hiện sơ bộ cho thấy thị trường sẽ phục hồi vào quý tới.", "th_meaning": "เบื้องต้น", "th_example": "ผลการวิจัยเบื้องต้นชี้ให้เห็นว่าตลาดจะฟื้นตัวภายในไตรมาสหน้า", "id_meaning": "pendahuluan", "id_example": "Temuan awal menunjukkan bahwa pasar akan pulih pada kuartal berikutnya."}, "325:premise": {"vi_meaning": "tiền đề", "vi_example": "Toàn bộ mô hình kinh doanh được xây dựng dựa trên tiền đề doanh thu đăng ký định kỳ.", "th_meaning": "สถานที่ตั้ง", "th_example": "รูปแบบธุรกิจทั้งหมดสร้างขึ้นจากรายได้จากการสมัครสมาชิกที่เกิดขึ้นเป็นประจำ", "id_meaning": "premis", "id_example": "Seluruh model bisnis dibangun berdasarkan pendapatan langganan berulang."}, "326:prerogative": {"vi_meaning": "đặc quyền", "vi_example": "Thiết lập định hướng chiến lược là đặc quyền độc quyền của hội đồng quản trị.", "th_meaning": "สิทธิพิเศษ", "th_example": "การกำหนดทิศทางเชิงกลยุทธ์ถือเป็นสิทธิพิเศษของคณะกรรมการ", "id_meaning": "hak istimewa", "id_example": "Menetapkan arah strategis merupakan hak prerogatif eksklusif dewan."}, "327:prescribe": {"vi_meaning": "quy định", "vi_example": "Chính sách của công ty quy định các thủ tục cụ thể để xử lý khiếu nại của khách hàng.", "th_meaning": "กำหนด", "th_example": "นโยบายของบริษัทกำหนดขั้นตอนเฉพาะสำหรับการจัดการข้อร้องเรียนของลูกค้า", "id_meaning": "menentukan", "id_example": "Kebijakan perusahaan mengatur prosedur khusus untuk menangani keluhan pelanggan."}, "328:prestige": {"vi_meaning": "uy tín", "vi_example": "Giải thưởng đã nâng cao đáng kể uy tín của thương hiệu trên thị trường xe sang.", "th_meaning": "ศักดิ์ศรี", "th_example": "รางวัลดังกล่าวช่วยยกระดับชื่อเสียงของแบรนด์ในตลาดสินค้าหรูหราอย่างมีนัยสำคัญ", "id_meaning": "prestise", "id_example": "Penghargaan ini secara signifikan meningkatkan prestise merek tersebut di pasar barang mewah."}, "329:presumptuous": {"vi_meaning": "tự phụ", "vi_example": "Sẽ là quá tự tin nếu cho rằng khách hàng sẽ chấp nhận lời đề nghị đầu tiên của chúng ta.", "th_meaning": "อวดดี", "th_example": "ถือเป็นการสันนิษฐานว่าลูกค้าจะยอมรับข้อเสนอแรกของเรา", "id_meaning": "lancang", "id_example": "Adalah lancang jika berasumsi klien akan menerima tawaran pertama kita."}, "330:prevalent": {"vi_meaning": "thịnh hành", "vi_example": "Việc sắp xếp công việc từ xa ngày càng trở nên phổ biến kể từ sau đại dịch.", "th_meaning": "แพร่หลาย", "th_example": "การเตรียมการทำงานจากระยะไกลแพร่หลายมากขึ้นนับตั้งแต่เกิดการระบาดใหญ่", "id_meaning": "lazim", "id_example": "Pengaturan kerja jarak jauh menjadi semakin lazim sejak pandemi ini."}, "331:procure": {"vi_meaning": "mua sắm", "vi_example": "Bộ môn cần mua sắm thiết bị chuyên dụng cho phòng thí nghiệm mới.", "th_meaning": "จัดหา", "th_example": "แผนกจำเป็นต้องจัดหาอุปกรณ์เฉพาะสำหรับห้องปฏิบัติการแห่งใหม่", "id_meaning": "mendapatkan", "id_example": "Departemen perlu mengadakan peralatan khusus untuk laboratorium baru."}, "332:proficient": {"vi_meaning": "thành thạo", "vi_example": "Tất cả các ứng viên phải thành thạo ít nhất hai ngôn ngữ lập trình.", "th_meaning": "มีความเชี่ยวชาญ", "th_example": "ผู้สมัครทุกคนจะต้องมีความเชี่ยวชาญในภาษาการเขียนโปรแกรมอย่างน้อยสองภาษา", "id_meaning": "ahli", "id_example": "Semua kandidat harus mahir dalam setidaknya dua bahasa pemrograman."}, "333:profound": {"vi_meaning": "sâu", "vi_example": "Việc CEO từ chức đã ảnh hưởng sâu sắc đến tinh thần và sự tự tin của nhân viên.", "th_meaning": "ลึกซึ้ง", "th_example": "การลาออกของซีอีโอมีผลกระทบอย่างมากต่อขวัญและกำลังใจของพนักงาน", "id_meaning": "menonjol", "id_example": "Pengunduran diri CEO berdampak besar pada semangat dan kepercayaan diri karyawan."}, "334:prohibitive": {"vi_meaning": "cấm đoán", "vi_example": "Chi phí quá cao của công nghệ khiến nó không thực tế đối với các doanh nghiệp nhỏ.", "th_meaning": "ห้ามปราม", "th_example": "ต้นทุนที่สูงลิ่วของเทคโนโลยีทำให้บริษัทขนาดเล็กไม่สามารถทำได้", "id_meaning": "terlalu tinggi", "id_example": "Biaya teknologi yang mahal membuatnya tidak praktis bagi perusahaan kecil."}, "335:proliferate": {"vi_meaning": "nảy nở", "vi_example": "Các công ty khởi nghiệp tiếp tục phát triển mạnh mẽ trong lĩnh vực trí tuệ nhân tạo.", "th_meaning": "แพร่ขยายออกไป", "th_example": "บริษัทสตาร์ทอัพยังคงขยายตัวอย่างต่อเนื่องในภาคส่วนปัญญาประดิษฐ์", "id_meaning": "berkembang biak", "id_example": "Perusahaan startup terus menjamur di sektor kecerdasan buatan."}, "336:prolific": {"vi_meaning": "sung mãn", "vi_example": "Nhà phát minh tài năng này nắm giữ hơn hai trăm bằng sáng chế về năng lượng tái tạo.", "th_meaning": "อุดมสมบูรณ์", "th_example": "นักประดิษฐ์ที่มีผลงานมากมายรายนี้ถือสิทธิบัตรด้านพลังงานหมุนเวียนมากกว่าสองร้อยฉบับ", "id_meaning": "produktif", "id_example": "Penemu produktif ini memegang lebih dari dua ratus paten di bidang energi terbarukan."}, "337:propagate": {"vi_meaning": "tuyên truyền", "vi_example": "Nhóm tiếp thị đã sử dụng mạng xã hội để truyền bá nhận thức về thương hiệu trên toàn cầu.", "th_meaning": "เผยแพร่", "th_example": "ทีมการตลาดใช้โซเชียลมีเดียเพื่อเผยแพร่การรับรู้ถึงแบรนด์ไปทั่วโลก", "id_meaning": "menyebarkan", "id_example": "Tim pemasaran menggunakan media sosial untuk menyebarkan kesadaran merek secara global."}, "338:propensity": {"vi_meaning": "khuynh hướng", "vi_example": "Công ty cho thấy xu hướng mua lại các đối thủ cạnh tranh nhỏ hơn ở các thị trường lân cận.", "th_meaning": "นิสัยชอบ", "th_example": "บริษัทแสดงให้เห็นถึงแนวโน้มในการหาคู่แข่งรายย่อยในตลาดที่อยู่ติดกัน", "id_meaning": "kecenderungan", "id_example": "Perusahaan menunjukkan kecenderungan untuk mengakuisisi pesaing yang lebih kecil di pasar yang berdekatan."}, "339:proponent": {"vi_meaning": "người đề xướng", "vi_example": "Cô là người ủng hộ mạnh mẽ việc thực hiện các chính sách làm việc tại nhà linh hoạt.", "th_meaning": "ผู้แสดง", "th_example": "เธอเป็นผู้สนับสนุนที่ชัดเจนในการใช้นโยบายการทำงานจากที่บ้านที่ยืดหยุ่น", "id_meaning": "pendukung", "id_example": "Dia adalah pendukung kuat penerapan kebijakan bekerja dari rumah yang fleksibel."}, "340:proprietary": {"vi_meaning": "độc quyền", "vi_example": "Thuật toán độc quyền của công ty mang lại cho nó một lợi thế cạnh tranh đáng kể.", "th_meaning": "กรรมสิทธิ์", "th_example": "อัลกอริธึมที่เป็นกรรมสิทธิ์ของบริษัททำให้มีความได้เปรียบทางการแข่งขันอย่างมาก", "id_meaning": "hak milik", "id_example": "Algoritme milik perusahaan memberikan keunggulan kompetitif yang signifikan."}, "341:prosper": {"vi_meaning": "thịnh vượng", "vi_example": "Các công ty thích ứng với sự thay đổi của thị trường có nhiều khả năng phát triển thịnh vượng hơn.", "th_meaning": "เจริญรุ่งเรือง", "th_example": "บริษัทที่ปรับตัวตามตลาดที่เปลี่ยนแปลงไปมีแนวโน้มที่จะประสบความสำเร็จมากกว่า", "id_meaning": "makmur", "id_example": "Perusahaan yang beradaptasi terhadap perubahan pasar akan lebih mungkin untuk mencapai kesejahteraan."}, "342:prototype": {"vi_meaning": "nguyên mẫu", "vi_example": "Nhóm kỹ thuật đã công bố nguyên mẫu tại hội nghị công nghệ thường niên.", "th_meaning": "ต้นแบบ", "th_example": "ทีมวิศวกรได้เปิดเผยต้นแบบดังกล่าวในการประชุมเทคโนโลยีประจำปี", "id_meaning": "prototipe", "id_example": "Tim teknik meluncurkan prototipe tersebut pada konferensi teknologi tahunan."}, "343:proviso": {"vi_meaning": "điều kiện", "vi_example": "Hợp đồng đã được chấp nhận với điều kiện là thời hạn giao hàng phải được đảm bảo.", "th_meaning": "เงื่อนไข", "th_example": "สัญญาดังกล่าวได้รับการยอมรับโดยมีเงื่อนไขว่ารับประกันกำหนดเวลาการส่งมอบ", "id_meaning": "syarat", "id_example": "Kontrak diterima dengan syarat tenggat waktu pengiriman dijamin."}, "344:prowess": {"vi_meaning": "năng lực", "vi_example": "Khả năng phân tích của cô đã khiến cô trở thành nhà tư vấn hàng đầu trong công ty tư vấn.", "th_meaning": "ความกล้าหาญ", "th_example": "ความสามารถในการวิเคราะห์ของเธอทำให้เธอเป็นที่ปรึกษาอันดับต้นๆ ของบริษัทที่ปรึกษา", "id_meaning": "kecakapan", "id_example": "Keahlian analitisnya menjadikannya konsultan terbaik di firma penasihat."}, "345:prudent": {"vi_meaning": "khôn ngoan", "vi_example": "Sẽ là khôn ngoan nếu đa dạng hóa các khoản đầu tư trên nhiều loại tài sản.", "th_meaning": "รอบคอบ", "th_example": "ควรกระจายการลงทุนในสินทรัพย์หลายประเภทอย่างรอบคอบ", "id_meaning": "bijaksana", "id_example": "Akan lebih bijaksana jika melakukan diversifikasi investasi pada berbagai kelas aset."}, "346:punitive": {"vi_meaning": "trừng phạt", "vi_example": "Cơ quan quản lý đã áp dụng các mức phạt nghiêm khắc đối với các vi phạm về môi trường.", "th_meaning": "การลงโทษ", "th_example": "หน่วยงานกำกับดูแลได้กำหนดค่าปรับเชิงลงโทษสำหรับการละเมิดสิ่งแวดล้อม", "id_meaning": "menghukum", "id_example": "Badan pengawas mengenakan denda hukuman atas pelanggaran lingkungan."}, "347:quandary": {"vi_meaning": "tình thế khó khăn", "vi_example": "Tình thế khó khăn về mặt đạo đức buộc hội đồng quản trị phải tìm kiếm cố vấn pháp lý bên ngoài.", "th_meaning": "ความไม่แน่ใจ", "th_example": "ปัญหาด้านจริยธรรมทำให้คณะกรรมการต้องขอคำปรึกษาด้านกฎหมายจากภายนอก", "id_meaning": "kebingungan", "id_example": "Masalah etika memaksa dewan untuk mencari penasihat hukum eksternal."}, "348:quantify": {"vi_meaning": "định lượng", "vi_example": "Nhóm tiếp thị gặp khó khăn trong việc định lượng lợi nhuận thu được từ các chiến dịch nâng cao nhận thức về thương hiệu.", "th_meaning": "ปริมาณ", "th_example": "ทีมการตลาดพยายามหาปริมาณผลตอบแทนจากแคมเปญการรับรู้ถึงแบรนด์", "id_meaning": "mengukur", "id_example": "Tim pemasaran kesulitan mengukur laba atas kampanye kesadaran merek."}, "349:quarantine": {"vi_meaning": "cách ly", "vi_example": "Tất cả hàng hóa nhập khẩu phải vượt qua kiểm tra kiểm dịch trước khi phân phối ra thị trường.", "th_meaning": "การกักกัน", "th_example": "สินค้านำเข้าทั้งหมดจะต้องผ่านการตรวจสอบกักกันก่อนจำหน่ายสู่ตลาด", "id_meaning": "karantina", "id_example": "Semua barang impor harus melewati pemeriksaan karantina sebelum diedarkan ke pasar."}, "350:quintessential": {"vi_meaning": "tinh túy", "vi_example": "Cô là tấm gương điển hình của một doanh nhân thành đạt hiện đại.", "th_meaning": "แก่นสาร", "th_example": "เธอเป็นตัวอย่างที่สำคัญของผู้ประกอบการยุคใหม่ที่ประสบความสำเร็จ", "id_meaning": "klasik", "id_example": "Dia adalah contoh klasik dari seorang pengusaha modern yang sukses."}, "351:ramification": {"vi_meaning": "sự phân nhánh", "vi_example": "Sự phân nhánh pháp lý của quyết định này có thể ảnh hưởng đến công ty trong nhiều năm.", "th_meaning": "การขยายสาขา", "th_example": "การขยายสาขาทางกฎหมายของการตัดสินใจอาจส่งผลกระทบต่อบริษัทไปอีกหลายปี", "id_meaning": "percabangan", "id_example": "Konsekuensi hukum dari keputusan tersebut dapat berdampak pada perusahaan selama bertahun-tahun."}, "352:ratify": {"vi_meaning": "phê chuẩn", "vi_example": "Tất cả các quốc gia thành viên phải phê chuẩn thỏa thuận trước khi nó có hiệu lực pháp lý.", "th_meaning": "ให้สัตยาบัน", "th_example": "ประเทศสมาชิกทั้งหมดจะต้องให้สัตยาบันข้อตกลงก่อนที่จะมีผลทางกฎหมาย", "id_meaning": "mengesahkan", "id_example": "Semua negara anggota harus meratifikasi perjanjian tersebut sebelum mulai berlaku secara hukum."}, "353:rationale": {"vi_meaning": "lý lẽ", "vi_example": "CEO nêu ra lý do đằng sau quyết định tái cơ cấu hoạt động.", "th_meaning": "เหตุผล", "th_example": "ซีอีโอระบุเหตุผลเบื้องหลังการตัดสินใจปรับโครงสร้างการดำเนินงาน", "id_meaning": "alasan", "id_example": "CEO menguraikan alasan di balik keputusan untuk merestrukturisasi operasi."}, "354:rebuke": {"vi_meaning": "quở trách", "vi_example": "Chủ tịch công khai khiển trách người điều hành vì phát biểu báo chí trái phép.", "th_meaning": "ตำหนิ", "th_example": "ประธานกล่าวตำหนิผู้บริหารต่อสาธารณะสำหรับการแถลงข่าวโดยไม่ได้รับอนุญาต", "id_meaning": "menegur", "id_example": "Ketua umum menegur eksekutif atas pernyataan pers yang tidak sah."}, "355:recalcitrant": {"vi_meaning": "người ngoan cố", "vi_example": "Thành viên hội đồng ngoan cố này đã từ chối ủng hộ kế hoạch sáp nhập được đề xuất.", "th_meaning": "พยศ", "th_example": "สมาชิกคณะกรรมการที่ไม่แยแสปฏิเสธที่จะสนับสนุนแผนการควบรวมกิจการที่เสนอ", "id_meaning": "bandel", "id_example": "Anggota dewan yang bandel itu menolak mendukung rencana merger yang diusulkan."}, "356:reconcile": {"vi_meaning": "hòa giải", "vi_example": "Đội ngũ kế toán đã làm việc ngoài giờ để điều chỉnh những khác biệt về tài chính.", "th_meaning": "คืนดี", "th_example": "ทีมบัญชีทำงานล่วงเวลาเพื่อกระทบยอดความแตกต่างทางการเงิน", "id_meaning": "mendamaikan", "id_example": "Tim akuntansi bekerja lembur untuk merekonsiliasi perbedaan keuangan."}, "357:recoup": {"vi_meaning": "thu lại", "vi_example": "Công ty dự kiến ​​sẽ thu hồi vốn đầu tư ban đầu trong vòng 18 tháng.", "th_meaning": "ชดใช้", "th_example": "บริษัทคาดว่าจะชดใช้เงินลงทุนเริ่มแรกภายในสิบแปดเดือน", "id_meaning": "menghitung", "id_example": "Perusahaan mengharapkan untuk mendapatkan kembali investasi awalnya dalam waktu delapan belas bulan."}, "358:rectify": {"vi_meaning": "sửa chữa", "vi_example": "Đội ngũ kỹ thuật đã được cử đến để khắc phục lỗi sản xuất ngay lập tức.", "th_meaning": "แก้ไข", "th_example": "จึงส่งทีมวิศวกรไปแก้ไขข้อบกพร่องด้านการผลิตทันที", "id_meaning": "memperbaiki", "id_example": "Tim teknik dikirim untuk segera memperbaiki cacat produksi."}, "359:redundant": {"vi_meaning": "dư thừa", "vi_example": "Dự án tự động hóa đã khiến một số vị trí hành chính trở nên dư thừa.", "th_meaning": "ซ้ำซ้อน", "th_example": "โครงการระบบอัตโนมัติทำให้ตำแหน่งผู้บริหารหลายตำแหน่งซ้ำซ้อน", "id_meaning": "berulang", "id_example": "Proyek otomasi membuat beberapa posisi administratif menjadi mubazir."}, "360:refurbish": {"vi_meaning": "tân trang lại", "vi_example": "Công ty đã đầu tư rất nhiều để tân trang lại tòa nhà trụ sở văn phòng cũ kỹ.", "th_meaning": "ตกแต่งใหม่", "th_example": "บริษัทลงทุนมหาศาลเพื่อปรับปรุงอาคารสำนักงานใหญ่ที่เก่าแก่ของตนใหม่", "id_meaning": "membarui lagi", "id_example": "Perusahaan berinvestasi besar-besaran untuk memperbarui gedung kantor pusatnya yang sudah tua."}, "361:refute": {"vi_meaning": "bác bỏ", "vi_example": "Công ty đã công bố dữ liệu để bác bỏ những cáo buộc của đối thủ cạnh tranh.", "th_meaning": "หักล้าง", "th_example": "บริษัทเปิดเผยข้อมูลเพื่อหักล้างข้อกล่าวหาของคู่แข่ง", "id_meaning": "menyangkal", "id_example": "Perusahaan merilis data untuk membantah tuduhan yang dilontarkan pesaing."}, "362:relegate": {"vi_meaning": "xuống hạng", "vi_example": "Hiệu suất kém có thể đẩy bộ phận này xuống trạng thái ưu tiên thấp hơn.", "th_meaning": "ผลักไส", "th_example": "ประสิทธิภาพที่ไม่ดีอาจทำให้แผนกมีสถานะลำดับความสำคัญต่ำกว่าได้", "id_meaning": "membuang", "id_example": "Kinerja yang buruk dapat menurunkan divisi tersebut ke status prioritas yang lebih rendah."}, "363:relinquish": {"vi_meaning": "từ bỏ", "vi_example": "Người sáng lập đã đồng ý từ bỏ quyền kiểm soát cho CEO mới được bổ nhiệm.", "th_meaning": "สละ", "th_example": "ผู้ก่อตั้งตกลงที่จะสละการควบคุมให้กับซีอีโอที่ได้รับการแต่งตั้งใหม่", "id_meaning": "melepaskan", "id_example": "Pendiri setuju untuk menyerahkan kendali kepada CEO yang baru diangkat."}, "364:reluctant": {"vi_meaning": "miễn cưỡng", "vi_example": "Nhiều công ty lâu đời không muốn áp dụng các công nghệ mới mang tính đột phá.", "th_meaning": "ไม่เต็มใจ", "th_example": "บริษัทที่ก่อตั้งแล้วหลายแห่งไม่เต็มใจที่จะนำเทคโนโลยีใหม่ๆ ที่ก่อกวนมาใช้", "id_meaning": "enggan", "id_example": "Banyak perusahaan mapan enggan mengadopsi teknologi baru yang disruptif."}, "365:reminiscent": {"vi_meaning": "gợi nhớ", "vi_example": "Sự suy giảm của công ty gợi nhớ đến những thất bại tương tự trong bong bóng công nghệ.", "th_meaning": "ชวนให้นึกถึง", "th_example": "การลดลงของบริษัทนั้นชวนให้นึกถึงความล้มเหลวที่คล้ายคลึงกันในฟองสบู่เทคโนโลยี", "id_meaning": "mengingatkan", "id_example": "Kemunduran perusahaan ini mengingatkan kita pada kegagalan serupa dalam gelembung teknologi."}, "366:remuneration": {"vi_meaning": "thù lao", "vi_example": "Gói thù lao bao gồm lương cơ bản, tiền thưởng và quyền chọn cổ phiếu.", "th_meaning": "ค่าตอบแทน", "th_example": "แพ็คเกจค่าตอบแทนประกอบด้วยเงินเดือนพื้นฐาน โบนัส และตัวเลือกหุ้น", "id_meaning": "remunerasi", "id_example": "Paket remunerasi mencakup gaji pokok, bonus, dan opsi saham."}, "367:renovate": {"vi_meaning": "đổi mới", "vi_example": "Công ty đã phân bổ kinh phí đáng kể để cải tạo khu phức hợp văn phòng ở trung tâm thành phố.", "th_meaning": "ปรับปรุงใหม่", "th_example": "บริษัทได้จัดสรรเงินทุนจำนวนมากเพื่อปรับปรุงอาคารสำนักงานในตัวเมือง", "id_meaning": "merenovasi", "id_example": "Perusahaan mengalokasikan dana besar untuk merenovasi kompleks perkantoran di pusat kota."}, "368:repeal": {"vi_meaning": "bãi bỏ", "vi_example": "Các nhóm vận động người tiêu dùng đã vận động chính phủ bãi bỏ luật hạn chế.", "th_meaning": "ยกเลิก", "th_example": "กลุ่มผู้สนับสนุนผู้บริโภคล็อบบี้รัฐบาลให้ยกเลิกกฎหมายที่เข้มงวด", "id_meaning": "mencabut", "id_example": "Kelompok advokasi konsumen melobi pemerintah untuk mencabut undang-undang yang membatasi tersebut."}, "369:repercussion": {"vi_meaning": "hậu quả", "vi_example": "Sự thay đổi chính sách đột ngột đã có tác động lan rộng đến toàn bộ ngành.", "th_meaning": "ผลสะท้อนกลับ", "th_example": "การเปลี่ยนแปลงนโยบายอย่างกะทันหันส่งผลกระทบอย่างกว้างขวางทั่วทั้งอุตสาหกรรม", "id_meaning": "kumandang", "id_example": "Perubahan kebijakan yang tiba-tiba ini mempunyai dampak yang luas di seluruh industri."}, "370:replenish": {"vi_meaning": "bổ sung", "vi_example": "Kho cần bổ sung hàng trước khi mùa mua sắm nghỉ lễ bắt đầu.", "th_meaning": "เติมเต็ม", "th_example": "คลังสินค้าจำเป็นต้องเติมสินค้าในสต๊อกก่อนที่ฤดูกาลช้อปปิ้งช่วงวันหยุดจะเริ่มต้นขึ้น", "id_meaning": "mengisi kembali", "id_example": "Gudang perlu mengisi kembali stok sebelum musim belanja liburan dimulai."}, "371:reprehensible": {"vi_meaning": "đáng trách", "vi_example": "Ủy ban nhất trí lên án những hành vi vi phạm đạo đức đáng trách của người điều hành.", "th_meaning": "น่าตำหนิ", "th_example": "คณะกรรมการมีมติเป็นเอกฉันท์ประณามการละเมิดจริยธรรมอันน่าตำหนิของผู้บริหาร", "id_meaning": "tercela", "id_example": "Komite dengan suara bulat mengutuk pelanggaran etika tercela yang dilakukan oleh eksekutif."}, "372:reprimand": {"vi_meaning": "khiển trách", "vi_example": "Nhân viên này đã nhận được lời khiển trách chính thức vì vi phạm quy tắc ứng xử của công ty.", "th_meaning": "ตำหนิ", "th_example": "พนักงานรายดังกล่าวได้รับการตำหนิอย่างเป็นทางการเนื่องจากละเมิดจรรยาบรรณของบริษัท", "id_meaning": "teguran", "id_example": "Karyawan tersebut menerima teguran resmi karena melanggar kode etik perusahaan."}, "373:repudiate": {"vi_meaning": "bác bỏ", "vi_example": "Hội đồng quản trị đã bỏ phiếu bác bỏ những tuyên bố của nhân viên cũ bất mãn.", "th_meaning": "ปฏิเสธ", "th_example": "คณะกรรมการลงมติให้ปฏิเสธข้อเรียกร้องของอดีตพนักงานผู้ไม่พอใจ", "id_meaning": "menolak", "id_example": "Dewan memilih untuk menolak klaim yang dibuat oleh mantan karyawan yang tidak puas tersebut."}, "374:requisite": {"vi_meaning": "điều cần thiết", "vi_example": "Kinh nghiệm trước đây về phân tích tài chính là điều kiện cần thiết cho vai trò cấp cao.", "th_meaning": "จำเป็น", "th_example": "ประสบการณ์ในการวิเคราะห์ทางการเงินเป็นสิ่งจำเป็นสำหรับบทบาทอาวุโส", "id_meaning": "syarat", "id_example": "Pengalaman sebelumnya dalam analisis keuangan merupakan syarat untuk peran senior."}, "375:rescind": {"vi_meaning": "hủy bỏ", "vi_example": "Hội đồng đã bỏ phiếu hủy bỏ chính sách gây tranh cãi có hiệu lực ngay lập tức.", "th_meaning": "ยกเลิก", "th_example": "คณะกรรมการลงมติให้ยกเลิกนโยบายข้อขัดแย้งที่มีผลทันที", "id_meaning": "membatalkan", "id_example": "Dewan memutuskan untuk segera membatalkan kebijakan kontroversial tersebut."}, "376:resilient": {"vi_meaning": "đàn hồi", "vi_example": "Công ty đã tỏ ra có khả năng phục hồi đáng kể trong thời kỳ suy thoái kinh tế kéo dài.", "th_meaning": "ยืดหยุ่น", "th_example": "บริษัทได้รับการพิสูจน์แล้วว่าสามารถฟื้นตัวได้อย่างน่าทึ่งในช่วงภาวะเศรษฐกิจตกต่ำที่ยืดเยื้อเป็นเวลานาน", "id_meaning": "ulet", "id_example": "Perusahaan terbukti sangat tangguh selama krisis ekonomi yang berkepanjangan."}, "377:resolute": {"vi_meaning": "kiên quyết", "vi_example": "Giám đốc điều hành vẫn kiên quyết thực hiện cam kết của mình với kế hoạch tăng trưởng 5 năm.", "th_meaning": "เด็ดเดี่ยว", "th_example": "ซีอีโอยังคงแน่วแน่ในความมุ่งมั่นต่อแผนการเติบโตระยะ 5 ปี", "id_meaning": "tegas", "id_example": "CEO tetap teguh pada komitmennya terhadap rencana pertumbuhan lima tahun."}, "378:resonate": {"vi_meaning": "cộng hưởng", "vi_example": "Thông điệp về tính bền vững của công ty đã gây được tiếng vang mạnh mẽ với người tiêu dùng trẻ tuổi.", "th_meaning": "สะท้อน", "th_example": "ข้อความด้านความยั่งยืนของบริษัทโดนใจผู้บริโภควัยหนุ่มสาวเป็นอย่างมาก", "id_meaning": "menggema", "id_example": "Pesan keberlanjutan perusahaan sangat diterima oleh konsumen muda."}, "379:restitution": {"vi_meaning": "sự bồi thường", "vi_example": "Tòa án yêu cầu công ty phải bồi thường đầy đủ cho những khách hàng bị ảnh hưởng.", "th_meaning": "การชดใช้", "th_example": "ศาลสั่งให้บริษัทชดใช้ค่าเสียหายให้กับลูกค้าที่ได้รับผลกระทบเต็มจำนวน", "id_meaning": "restitusi", "id_example": "Pengadilan memerintahkan perusahaan untuk membayar ganti rugi penuh kepada pelanggan yang terkena dampak."}, "380:restrain": {"vi_meaning": "kiềm chế", "vi_example": "Hội đồng quản trị đã cố gắng ngăn cản CEO đưa ra bất kỳ thông báo sớm nào.", "th_meaning": "ยับยั้ง", "th_example": "คณะกรรมการพยายามที่จะยับยั้งไม่ให้ซีอีโอประกาศก่อนเวลาอันควร", "id_meaning": "menahan", "id_example": "Dewan mencoba untuk menahan CEO agar tidak membuat pengumuman prematur."}, "381:retaliate": {"vi_meaning": "trả đũa", "vi_example": "Đối thủ cạnh tranh đe dọa trả đũa bằng cách định giá mạnh mẽ tại các thị trường trọng điểm.", "th_meaning": "ตอบโต้", "th_example": "คู่แข่งขู่ว่าจะตอบโต้ด้วยการกำหนดราคาเชิงรุกในตลาดสำคัญๆ", "id_meaning": "membalas", "id_example": "Pesaing mengancam akan membalas dengan penetapan harga yang agresif di pasar-pasar utama."}, "382:retention": {"vi_meaning": "sự giữ lại", "vi_example": "Cải thiện việc giữ chân nhân viên đã trở thành ưu tiên chiến lược của công ty.", "th_meaning": "การเก็บรักษา", "th_example": "การปรับปรุงการรักษาพนักงานได้กลายเป็นเรื่องสำคัญเชิงกลยุทธ์สำหรับบริษัท", "id_meaning": "penyimpanan", "id_example": "Meningkatkan retensi karyawan telah menjadi prioritas strategis bagi perusahaan."}, "383:retract": {"vi_meaning": "rút lại", "vi_example": "Tờ báo buộc phải rút lại thông tin không chính xác về việc sáp nhập.", "th_meaning": "ถอนกลับ", "th_example": "หนังสือพิมพ์ถูกบังคับให้ถอนรายงานที่ไม่ถูกต้องเกี่ยวกับการควบรวมกิจการ", "id_meaning": "menarik", "id_example": "Surat kabar tersebut terpaksa mencabut laporan yang tidak akurat tentang merger tersebut."}, "384:retroactive": {"vi_meaning": "hồi tố", "vi_example": "Việc tăng lương được thực hiện hồi tố từ đầu năm tài chính.", "th_meaning": "ย้อนหลัง", "th_example": "การปรับขึ้นเงินเดือนมีผลย้อนหลังจนถึงต้นปีบัญชี", "id_meaning": "berlaku surut", "id_example": "Kenaikan gaji tersebut berlaku surut sejak awal tahun anggaran."}, "385:revamp": {"vi_meaning": "cải tạo", "vi_example": "Công ty có kế hoạch cải tổ hoạt động dịch vụ khách hàng của mình vào quý tới.", "th_meaning": "ปะ", "th_example": "บริษัทวางแผนที่จะปรับปรุงการดำเนินงานบริการลูกค้าภายในไตรมาสหน้า", "id_meaning": "merubah", "id_example": "Perusahaan berencana untuk mengubah operasi layanan pelanggannya pada kuartal berikutnya."}, "386:revoke": {"vi_meaning": "thu hồi", "vi_example": "Cơ quan cấp phép có thể thu hồi giấy phép do không tuân thủ các tiêu chuẩn an toàn.", "th_meaning": "ถอน", "th_example": "หน่วยงานออกใบอนุญาตอาจเพิกถอนใบอนุญาตกรณีไม่ปฏิบัติตามมาตรฐานความปลอดภัยได้", "id_meaning": "menarik kembali", "id_example": "Otoritas perizinan dapat mencabut izin karena ketidakpatuhan terhadap standar keselamatan."}, "387:rhetoric": {"vi_meaning": "hùng biện", "vi_example": "Lời hùng biện của chính trị gia này về cải cách kinh tế đã gây ấn tượng với cộng đồng doanh nghiệp.", "th_meaning": "วาทศาสตร์", "th_example": "วาทกรรมของนักการเมืองเกี่ยวกับการปฏิรูปเศรษฐกิจสร้างความประทับใจให้กับชุมชนธุรกิจ", "id_meaning": "retorik", "id_example": "Retorika politisi tersebut mengenai reformasi ekonomi membuat dunia bisnis terkesan."}, "388:rigorous": {"vi_meaning": "khắt khe", "vi_example": "Tất cả các sản phẩm đều trải qua quá trình kiểm tra nghiêm ngặt trước khi đưa ra thị trường.", "th_meaning": "เข้มงวด", "th_example": "ผลิตภัณฑ์ทั้งหมดผ่านการทดสอบอย่างเข้มงวดก่อนที่จะออกสู่ตลาด", "id_meaning": "keras", "id_example": "Semua produk menjalani pengujian yang ketat sebelum dirilis ke pasar."}, "389:robust": {"vi_meaning": "khỏe mạnh", "vi_example": "Công ty đã báo cáo thu nhập mạnh mẽ nhờ doanh số bán hàng quốc tế mạnh mẽ.", "th_meaning": "แข็งแกร่ง", "th_example": "บริษัทรายงานผลประกอบการที่แข็งแกร่งโดยได้แรงหนุนจากยอดขายในต่างประเทศที่แข็งแกร่ง", "id_meaning": "kokoh", "id_example": "Perusahaan melaporkan pendapatan yang kuat didorong oleh penjualan internasional yang kuat."}, "390:rudimentary": {"vi_meaning": "thô sơ", "vi_example": "Ngay cả sự hiểu biết sơ đẳng về tài chính cũng có giá trị trong môi trường kinh doanh.", "th_meaning": "ขั้นพื้นฐาน", "th_example": "แม้แต่ความเข้าใจเบื้องต้นเกี่ยวกับการเงินก็มีคุณค่าในการดำเนินธุรกิจ", "id_meaning": "belum sempurna", "id_example": "Bahkan pemahaman dasar tentang keuangan pun berharga dalam lingkungan bisnis."}, "391:ruminate": {"vi_meaning": "ngẫm nghĩ", "vi_example": "Hội đồng quản trị đã dành thời gian để suy ngẫm về ý nghĩa của việc sáp nhập được đề xuất.", "th_meaning": "ครุ่นคิด", "th_example": "คณะกรรมการใช้เวลาไตร่ตรองถึงผลกระทบของข้อเสนอควบรวมกิจการ", "id_meaning": "merenungkan", "id_example": "Dewan meluangkan waktu untuk merenungkan implikasi dari usulan merger."}, "392:sagacious": {"vi_meaning": "khôn ngoan", "vi_example": "Nhà đầu tư khôn ngoan đã đa dạng hóa danh mục đầu tư của mình trước khi thị trường sụp đổ.", "th_meaning": "ไหวพริบ", "th_example": "นักลงทุนผู้ชาญฉลาดรายนี้กระจายพอร์ตการลงทุนของเธอก่อนที่ตลาดจะล่มสลาย", "id_meaning": "cerdas", "id_example": "Investor cerdas ini mendiversifikasi portofolionya jauh sebelum pasar ambruk."}, "393:salient": {"vi_meaning": "nổi bật", "vi_example": "Báo cáo nêu bật những vấn đề nổi bật nhất ảnh hưởng đến hiệu quả hoạt động hàng quý.", "th_meaning": "โดดเด่น", "th_example": "รายงานเน้นประเด็นสำคัญที่สุดที่ส่งผลต่อผลการดำเนินงานรายไตรมาส", "id_meaning": "menonjol", "id_example": "Laporan ini menyoroti isu-isu paling menonjol yang mempengaruhi kinerja triwulanan."}, "394:sanction": {"vi_meaning": "sự trừng phạt", "vi_example": "Chính phủ áp đặt các biện pháp trừng phạt kinh tế đối với các công ty vi phạm các hiệp định thương mại.", "th_meaning": "การลงโทษ", "th_example": "รัฐบาลกำหนดมาตรการคว่ำบาตรทางเศรษฐกิจต่อบริษัทที่ละเมิดข้อตกลงทางการค้า", "id_meaning": "sanksi", "id_example": "Pemerintah menjatuhkan sanksi ekonomi kepada perusahaan yang melanggar perjanjian perdagangan."}, "395:saturate": {"vi_meaning": "bão hòa", "vi_example": "Các chiến dịch quảng cáo rầm rộ đã bắt đầu làm bão hòa thị trường điện tử tiêu dùng.", "th_meaning": "อิ่มตัว", "th_example": "แคมเปญโฆษณาเชิงรุกเริ่มอิ่มตัวในตลาดเครื่องใช้ไฟฟ้า", "id_meaning": "jenuh", "id_example": "Kampanye periklanan yang agresif mulai memenuhi pasar elektronik konsumen."}, "396:scant": {"vi_meaning": "ít ỏi", "vi_example": "Dự án nhận được rất ít sự quan tâm từ ban quản lý cấp trên cho đến khi thời hạn đến gần.", "th_meaning": "ไม่เพียงพอ", "th_example": "โครงการนี้ได้รับความสนใจเพียงเล็กน้อยจากผู้บริหารระดับสูงจนกระทั่งใกล้ถึงกำหนดเวลา", "id_meaning": "sedikit", "id_example": "Proyek ini mendapat sedikit perhatian dari manajemen tingkat atas hingga tenggat waktunya semakin dekat."}, "397:scrutinize": {"vi_meaning": "xem xét kỹ lưỡng", "vi_example": "Cơ quan quản lý sẽ xem xét kỹ lưỡng các báo cáo tài chính để phát hiện bất kỳ dấu hiệu bất thường nào.", "th_meaning": "กลั่นกรอง", "th_example": "หน่วยงานกำกับดูแลจะตรวจสอบงบการเงินเพื่อหาสัญญาณของความผิดปกติ", "id_meaning": "meneliti", "id_example": "Regulator akan memeriksa laporan keuangan untuk mencari tanda-tanda penyimpangan."}, "398:secede": {"vi_meaning": "ly khai", "vi_example": "Bộ phận khu vực đe dọa ly khai khỏi tổ chức mẹ.", "th_meaning": "แยกตัวออก", "th_example": "ส่วนภูมิภาคขู่ว่าจะแยกตัวออกจากองค์กรแม่", "id_meaning": "memisahkan diri", "id_example": "Pemekaran wilayah mengancam akan memisahkan diri dari organisasi induknya."}, "399:sedentary": {"vi_meaning": "ít vận động", "vi_example": "Đồ nội thất tiện dụng đã được giới thiệu để giảm thiểu tác động của công việc văn phòng ít vận động.", "th_meaning": "อยู่ประจำ", "th_example": "มีการนำเฟอร์นิเจอร์ที่ออกแบบตามหลักสรีรศาสตร์มาใช้เพื่อลดผลกระทบจากการทำงานในสำนักงาน", "id_meaning": "tidak banyak bergerak", "id_example": "Furnitur ergonomis diperkenalkan untuk mengurangi dampak pekerjaan kantor yang tidak banyak bergerak."}, "400:sentinel": {"vi_meaning": "lính gác", "vi_example": "Phần mềm an ninh mạng tiên tiến hoạt động như một lính canh bảo vệ mạng dữ liệu của công ty.", "th_meaning": "ทหารรักษาการณ์", "th_example": "ซอฟต์แวร์รักษาความปลอดภัยทางไซเบอร์ขั้นสูงทำหน้าที่เป็นผู้พิทักษ์เครือข่ายข้อมูลขององค์กร", "id_meaning": "penjaga", "id_example": "Perangkat lunak keamanan siber yang canggih bertindak sebagai penjaga yang menjaga jaringan data perusahaan."}, "401:sequester": {"vi_meaning": "người cô lập", "vi_example": "Bồi thẩm đoàn đã được cách ly để ngăn chặn việc truyền thông đưa tin về phiên tòa.", "th_meaning": "ผู้สืบหา", "th_example": "คณะลูกขุนถูกแยกตัวเพื่อป้องกันการเปิดเผยของสื่อมวลชนเกี่ยวกับการพิจารณาคดี", "id_meaning": "menyita", "id_example": "Juri diasingkan untuk mencegah paparan liputan media tentang persidangan tersebut."}, "402:serendipity": {"vi_meaning": "sự tình cờ", "vi_example": "Khám phá mang tính đột phá này phần lớn là kết quả của sự tình cờ khoa học.", "th_meaning": "ความบังเอิญ", "th_example": "การค้นพบครั้งยิ่งใหญ่นี้ส่วนใหญ่เป็นผลมาจากความบังเอิญทางวิทยาศาสตร์", "id_meaning": "keberuntungan", "id_example": "Penemuan inovatif ini sebagian besar merupakan hasil dari kebetulan ilmiah."}, "403:skeptical": {"vi_meaning": "hoài nghi", "vi_example": "Các nhà phân tích trong ngành vẫn hoài nghi về khả năng tồn tại của mô hình kinh doanh mới.", "th_meaning": "ไม่เชื่อ", "th_example": "นักวิเคราะห์อุตสาหกรรมยังคงไม่มั่นใจเกี่ยวกับความเป็นไปได้ของรูปแบบธุรกิจใหม่", "id_meaning": "skeptis", "id_example": "Analis industri masih skeptis terhadap kelangsungan model bisnis baru ini."}, "404:solicit": {"vi_meaning": "gạ gẫm", "vi_example": "Công ty quyết định mời thầu từ một số nhà cung cấp cạnh tranh.", "th_meaning": "ร้องขอ", "th_example": "บริษัทตัดสินใจขอราคาจากผู้ขายที่แข่งขันกันหลายราย", "id_meaning": "mengumpulkan", "id_example": "Perusahaan memutuskan untuk meminta tawaran dari beberapa vendor yang bersaing."}, "405:solidarity": {"vi_meaning": "sự đoàn kết", "vi_example": "Nhân viên thể hiện tinh thần đoàn kết bằng cách tình nguyện tham gia chương trình tiếp cận cộng đồng.", "th_meaning": "ความสามัคคี", "th_example": "พนักงานแสดงความสามัคคีด้วยการเป็นอาสาสมัครในโครงการเผยแพร่ประชาสัมพันธ์แก่ชุมชน", "id_meaning": "solidaritas", "id_example": "Karyawan menunjukkan solidaritas dengan menjadi sukarelawan dalam program penjangkauan masyarakat."}, "406:solvent": {"vi_meaning": "dung môi", "vi_example": "Bất chấp những thách thức gần đây, công ty vẫn có khả năng thanh toán tài chính và ổn định.", "th_meaning": "ตัวทำละลาย", "th_example": "แม้จะมีความท้าทายเมื่อเร็วๆ นี้ แต่บริษัทยังคงมีความสามารถในการชำระหนี้และมีเสถียรภาพทางการเงิน", "id_meaning": "pelarut", "id_example": "Meskipun ada tantangan baru-baru ini, perusahaan ini tetap mampu membayar utang dan stabil secara finansial."}, "407:sophisticated": {"vi_meaning": "cầu kì", "vi_example": "Công ty đã triển khai các công cụ phân tích phức tạp để dự đoán hành vi của người tiêu dùng.", "th_meaning": "ช่ำชอง", "th_example": "บริษัทใช้เครื่องมือวิเคราะห์ที่ซับซ้อนเพื่อคาดการณ์พฤติกรรมผู้บริโภค", "id_meaning": "rumit", "id_example": "Perusahaan menerapkan alat analisis canggih untuk memprediksi perilaku konsumen."}, "408:sparse": {"vi_meaning": "thưa thớt", "vi_example": "Nghiên cứu thị trường ban đầu chỉ mang lại dữ liệu thưa thớt để phân tích có ý nghĩa.", "th_meaning": "เบาบาง", "th_example": "การวิจัยตลาดเบื้องต้นให้ผลเพียงข้อมูลกระจัดกระจายสำหรับการวิเคราะห์ที่มีความหมาย", "id_meaning": "jarang", "id_example": "Riset pasar awal hanya menghasilkan sedikit data untuk analisis yang bermakna."}, "409:speculate": {"vi_meaning": "suy đoán", "vi_example": "Các nhà phân tích suy đoán rằng ngân hàng trung ương sẽ tăng lãi suất vào tháng tới.", "th_meaning": "คาดเดา", "th_example": "นักวิเคราะห์คาดการณ์ว่าธนาคารกลางจะขึ้นอัตราดอกเบี้ยในเดือนหน้า", "id_meaning": "berspekulasi", "id_example": "Analis berspekulasi bahwa bank sentral akan menaikkan suku bunga bulan depan."}, "410:sporadic": {"vi_meaning": "rải rác", "vi_example": "Khu vực này thường xuyên bị mất điện do thời tiết khắc nghiệt.", "th_meaning": "ประปราย", "th_example": "ภูมิภาคนี้ประสบปัญหาไฟฟ้าดับเป็นระยะๆ ในระหว่างเหตุการณ์สภาพอากาศเลวร้าย", "id_meaning": "sporadis", "id_example": "Wilayah ini mengalami pemadaman listrik secara sporadis selama peristiwa cuaca buruk."}, "411:spurious": {"vi_meaning": "giả tạo", "vi_example": "Cơ quan quản lý bác bỏ những tuyên bố sai lầm của công ty về độ an toàn của sản phẩm.", "th_meaning": "ปลอม", "th_example": "หน่วยงานกำกับดูแลปฏิเสธคำกล่าวอ้างอันเป็นเท็จของบริษัทเกี่ยวกับความปลอดภัยของผลิตภัณฑ์", "id_meaning": "palsu", "id_example": "Regulator menolak klaim palsu perusahaan mengenai keamanan produk."}, "412:stagnant": {"vi_meaning": "trì trệ", "vi_example": "Nền kinh tế trì trệ đã dẫn đến chi tiêu tiêu dùng giảm ở tất cả các lĩnh vực.", "th_meaning": "นิ่ง", "th_example": "เศรษฐกิจที่ซบเซาส่งผลให้การใช้จ่ายของผู้บริโภคลดลงในทุกภาคส่วน", "id_meaning": "tergenang", "id_example": "Perekonomian yang stagnan telah menyebabkan berkurangnya belanja konsumen di semua sektor."}, "413:statutory": {"vi_meaning": "theo luật định", "vi_example": "Tất cả các doanh nghiệp phải tuân thủ các yêu cầu pháp lý về an toàn tại nơi làm việc.", "th_meaning": "ตามกฎหมาย", "th_example": "ธุรกิจทั้งหมดจะต้องปฏิบัติตามข้อกำหนดทางกฎหมายเพื่อความปลอดภัยในสถานที่ทำงาน", "id_meaning": "undang-undang", "id_example": "Semua bisnis harus mematuhi persyaratan undang-undang untuk keselamatan tempat kerja."}, "414:steadfast": {"vi_meaning": "kiên định", "vi_example": "Công ty vẫn kiên định trong cam kết thực hành kinh doanh có đạo đức.", "th_meaning": "แน่วแน่", "th_example": "บริษัทยังคงยึดมั่นในความมุ่งมั่นในการดำเนินธุรกิจอย่างมีจริยธรรม", "id_meaning": "tabah", "id_example": "Perusahaan tetap teguh dalam komitmennya terhadap praktik bisnis yang etis."}, "415:stipulate": {"vi_meaning": "quy định", "vi_example": "Thỏa thuận quy định mọi tranh chấp phải được giải quyết thông qua trọng tài.", "th_meaning": "กำหนด", "th_example": "ข้อตกลงกำหนดว่าข้อพิพาททั้งหมดจะต้องได้รับการแก้ไขโดยอนุญาโตตุลาการ", "id_meaning": "menetapkan", "id_example": "Perjanjian tersebut mengatur bahwa semua perselisihan harus diselesaikan melalui arbitrase."}, "416:stratagem": {"vi_meaning": "mưu kế", "vi_example": "Chiến lược tiếp thị đã thành công trong việc phân biệt thương hiệu với các đối thủ cạnh tranh.", "th_meaning": "อุบาย", "th_example": "กลยุทธ์การตลาดทำให้แบรนด์แตกต่างจากคู่แข่งได้สำเร็จ", "id_meaning": "tipu", "id_example": "Strategi pemasaran berhasil membedakan merek dari pesaingnya."}, "417:stringent": {"vi_meaning": "nghiêm ngặt", "vi_example": "Công ty dược phẩm phải tuân thủ các tiêu chuẩn kiểm soát chất lượng nghiêm ngặt.", "th_meaning": "เข้มงวด", "th_example": "บริษัทยาจะต้องปฏิบัติตามมาตรฐานการควบคุมคุณภาพที่เข้มงวด", "id_meaning": "ketat", "id_example": "Perusahaan farmasi harus mematuhi standar kendali mutu yang ketat."}, "418:subordinate": {"vi_meaning": "cấp dưới", "vi_example": "Người quản lý giao các công việc thường ngày cho các thành viên cấp dưới trong nhóm.", "th_meaning": "ผู้ใต้บังคับบัญชา", "th_example": "ผู้จัดการมอบหมายงานประจำให้กับสมาชิกในทีมที่อยู่ใต้บังคับบัญชา", "id_meaning": "bawahan", "id_example": "Manajer mendelegasikan tugas-tugas rutin kepada anggota tim bawahannya."}, "419:substantiate": {"vi_meaning": "chứng minh", "vi_example": "Người yêu cầu bồi thường phải cung cấp bằng chứng để chứng minh cho yêu cầu bảo hành.", "th_meaning": "ยืนยัน", "th_example": "ผู้เรียกร้องจะต้องแสดงหลักฐานเพื่อยืนยันการเรียกร้องการรับประกัน", "id_meaning": "memperkuat", "id_example": "Penggugat harus memberikan bukti untuk mendukung klaim garansi."}, "420:succinct": {"vi_meaning": "ngắn gọn", "vi_example": "Bản tóm tắt điều hành phải ngắn gọn và giới hạn tối đa hai trang.", "th_meaning": "รวบรัด", "th_example": "บทสรุปผู้บริหารควรกระชับและจำกัดไว้ไม่เกินสองหน้า", "id_meaning": "ringkas", "id_example": "Ringkasan eksekutif harus ringkas dan dibatasi maksimal dua halaman."}, "421:superfluous": {"vi_meaning": "thừa thãi", "vi_example": "Các kiểm toán viên đã đánh dấu một số chi phí thừa trong ngân sách tiếp thị.", "th_meaning": "ฟุ่มเฟือย", "th_example": "ผู้ตรวจสอบบัญชีระบุค่าใช้จ่ายที่ไม่จำเป็นหลายประการไว้ในงบประมาณการตลาด", "id_meaning": "tak berguna", "id_example": "Auditor menandai beberapa pengeluaran berlebihan dalam anggaran pemasaran."}, "422:supplant": {"vi_meaning": "thay thế", "vi_example": "Các dịch vụ phát trực tuyến kỹ thuật số gần như đã thay thế hoàn toàn việc cho thuê DVD truyền thống.", "th_meaning": "ทดแทน", "th_example": "บริการสตรีมมิ่งแบบดิจิทัลเข้ามาแทนที่การเช่าดีวีดีแบบเดิมเกือบทั้งหมด", "id_meaning": "menggantikan", "id_example": "Layanan streaming digital hampir seluruhnya menggantikan persewaan DVD tradisional."}, "423:supplement": {"vi_meaning": "bổ sung", "vi_example": "Công ty quyết định bổ sung lực lượng lao động của mình bằng các nhà thầu tạm thời.", "th_meaning": "เสริม", "th_example": "บริษัทตัดสินใจเสริมพนักงานด้วยผู้รับเหมาชั่วคราว", "id_meaning": "suplemen", "id_example": "Perusahaan memutuskan untuk menambah tenaga kerjanya dengan kontraktor sementara."}, "424:suppress": {"vi_meaning": "kìm nén", "vi_example": "Ban quản lý đã cố gắng ngăn chặn những phát hiện của kiểm toán nội bộ từ công chúng.", "th_meaning": "ปราบปราม", "th_example": "ฝ่ายบริหารพยายามระงับผลการตรวจสอบภายในจากสาธารณชน", "id_meaning": "menekan", "id_example": "Manajemen berupaya menyembunyikan temuan audit internal dari masyarakat."}}