{
  "title": "คู่มือผู้ใช้",
  "subtitle": "เรียนรู้ฟีเจอร์ทั้งหมดของ ReeeeecallStudy",
  "searchPlaceholder": "ค้นหาฟีเจอร์ (เช่น SRS, นำเข้า, แชร์...)",
  "tableOfContents": "สารบัญ",
  "noResults": "ไม่พบผลลัพธ์สำหรับ \"{{query}}\"",
  "sections": {
    "getting-started": {
      "title": "เริ่มต้นใช้งาน",
      "items": {
        "login": {
          "title": "เข้าสู่ระบบ",
          "body": "เข้าสู่ระบบด้วยอีเมลและรหัสผ่าน เมื่อสมัครสมาชิก อีเมลยืนยันจะถูกส่ง — คลิกลิงก์เพื่อลงทะเบียนให้เสร็จสมบูรณ์ คุณสามารถรับลิงก์รีเซ็ตได้หากลืมรหัสผ่าน"
        },
        "dashboard": {
          "title": "หน้าหลัก (แดชบอร์ด)",
          "body": "หลังจากเข้าสู่ระบบ แดชบอร์ดจะปรากฏ ดูการ์ดทั้งหมด การ์ดทบทวนวันนี้ สถิติเรียนต่อเนื่อง และอัตราความชำนาญได้ในมุมมองเดียว ตรวจสอบฮีทแมปการเรียนเพื่อดูว่าคุณเรียนสม่ำเสมอหรือไม่ และใช้แผนภูมิพยากรณ์การทบทวนเพื่อคาดการณ์ปริมาณการเรียนที่จะมาถึง"
        },
        "navigation": {
          "title": "การนำทาง",
          "body": "บน PC ใช้แถบเมนูด้านบน บนมือถือแตะเมนูแฮมเบอร์เกอร์ (☰) เมนูที่ใช้ได้: เรียนด่วน, แดชบอร์ด, สำรับ, การ์ด (เทมเพลต), ตลาด, ประวัติ, ตั้งค่า, คู่มือ"
        }
      }
    },
    "decks": {
      "title": "การจัดการสำรับ",
      "items": {
        "create": {
          "title": "สร้างสำรับ",
          "body": "ในหน้าสำรับ กดปุ่ม 'สำรับใหม่' ตั้งชื่อ คำอธิบาย ไอคอน และสี สำรับเป็นเหมือนโฟลเดอร์ที่จัดกลุ่มแฟลชการ์ดตามหัวข้อ"
        },
        "detail": {
          "title": "มุมมองรายละเอียดสำรับ",
          "body": "คลิกสำรับเพื่อดูรายการการ์ด ใช้ปุ่มด้านบนเพื่อเพิ่มการ์ด นำเข้า ส่งออก แชร์ หรือแก้ไขสำรับ รองรับการกรองตามสถานะการ์ด (ใหม่/กำลังเรียน/ทบทวน/ระงับ) และการค้นหา"
        },
        "edit": {
          "title": "แก้ไขสำรับ",
          "body": "ในหน้าแก้ไขสำรับ เปลี่ยนชื่อ คำอธิบาย ไอคอน สี และเทมเพลตเริ่มต้น การตั้งค่า SRS (ช่วงเวลา Again/Hard/Good/Easy) สามารถปรับได้ต่อสำรับ สถิติสำรับ (การกระจายสถานะการ์ด อัตราความชำนาญ ฮีทแมปการเรียน) จะแสดงด้านล่าง"
        },
        "delete": {
          "title": "ลบสำรับ",
          "body": "กดไอคอนลบบนรายการสำรับเพื่อดูกล่องโต้ตอบยืนยัน การลบสำรับจะลบการ์ดทั้งหมดด้วย — โปรดระมัดระวัง"
        }
      }
    },
    "cards": {
      "title": "การจัดการการ์ด",
      "items": {
        "add": {
          "title": "เพิ่มการ์ด",
          "body": "กด 'เพิ่มการ์ด' ในหน้ารายละเอียดสำรับ กรอกข้อมูลในฟิลด์ที่กำหนดในเทมเพลต (เช่น ด้านหน้า ด้านหลัง) เพิ่มแท็กคั่นด้วยเครื่องหมายจุลภาคเพื่อค้นหาและกรองในภายหลัง"
        },
        "editDelete": {
          "title": "แก้ไขและลบการ์ด",
          "body": "คลิกการ์ดในรายการเพื่อเปิดหน้าต่างแก้ไข แก้ไขเนื้อหาฟิลด์และแท็ก คุณสามารถลบการ์ดทีละรายการหรือเลือกหลายรายการเพื่อลบเป็นกลุ่ม"
        },
        "searchFilter": {
          "title": "ค้นหาและกรอง",
          "body": "พิมพ์คำสำคัญในช่องค้นหาด้านบนของหน้ารายละเอียดสำรับเพื่อค้นหาในทุกฟิลด์และแท็ก เลือกตัวกรองสถานะ (ใหม่ กำลังเรียน ทบทวน ระงับ) เพื่อดูเฉพาะการ์ดที่ต้องการ"
        },
        "srsReset": {
          "title": "รีเซ็ต SRS",
          "body": "การรีเซ็ตสถานะ SRS ของการ์ดจะทำให้กลับเป็นสถานะ 'ใหม่' ใช้เมื่อคุณต้องการเริ่มเรียนรู้ใหม่ตั้งแต่ต้น"
        }
      }
    },
    "templates": {
      "title": "เทมเพลตการ์ด",
      "items": {
        "what": {
          "title": "เทมเพลตคืออะไร?",
          "body": "เทมเพลตกำหนดโครงสร้างของการ์ด — มีฟิลด์อะไรบ้างและจัดวางอย่างไรบนด้านหน้าและด้านหลัง ตัวอย่างเช่น เทมเพลต 'คำศัพท์ภาษาอังกฤษ' อาจมีฟิลด์สำหรับคำศัพท์ ความหมาย และประโยคตัวอย่าง เทมเพลตหนึ่งสามารถใช้ร่วมกันในหลายสำรับ"
        },
        "createEdit": {
          "title": "สร้างและแก้ไขเทมเพลต",
          "body": "กด 'เทมเพลตใหม่' ในเมนูการ์ด เพิ่มฟิลด์และตั้งชื่อ ประเภท (ข้อความ/รูปภาพ/เสียง) ลากเพื่อเรียงลำดับฟิลด์ เพิ่มคำอธิบายในฟิลด์เป็นแนวทางสำหรับการสร้างการ์ด"
        },
        "layout": {
          "title": "เลย์เอาต์ด้านหน้าและด้านหลัง",
          "body": "โหมดค่าเริ่มต้น: วางฟิลด์บนด้านหน้า/หลังและตั้งสไตล์ (หลัก รอง คำใบ้ รายละเอียด มีเดีย) และขนาดตัวอักษร โหมด HTML กำหนดเอง: ใช้รูปแบบ {{fieldName}} สำหรับเลย์เอาต์ HTML แบบอิสระ"
        },
        "tts": {
          "title": "TTS (แปลงข้อความเป็นเสียง)",
          "body": "เปิด TTS ต่อฟิลด์และเลือกภาษา (เกาหลี อังกฤษ ญี่ปุ่น จีน ฯลฯ) เมื่อเรียน การ์ดจะอ่านอัตโนมัติเมื่อพลิก หรือกดปุ่มลำโพงเพื่อเล่นด้วยตนเอง เปิดปิดการอ่านอัตโนมัติได้ในตั้งค่า"
        }
      }
    },
    "study": {
      "title": "เรียน",
      "items": {
        "modes": {
          "title": "โหมดการเรียน",
          "body": "• SRS (การทบทวนแบบเว้นระยะ): ปรับเวลาทบทวนอัตโนมัติตามเส้นโค้งความจำ การ์ดที่ตอบผิดจะปรากฏซ้ำภายในเซสชันเดียวกัน วิธีที่มีประสิทธิภาพที่สุดสำหรับการจดจำระยะยาว ใช้ 4 ปุ่ม (Again/Hard/Good/Easy)\n• ทบทวนตามลำดับ: เรียนการ์ดใหม่ทั้งหมดพร้อมจำนวนการ์ดทบทวนที่กำหนดได้ วนกลับไปที่จุดเริ่มต้นเมื่อถึงจุดสิ้นสุด\n• สุ่ม: สุ่มเลือกการ์ดจากสำรับ\n• ตามลำดับ: เรียนการ์ดตามลำดับ จำตำแหน่งของคุณเพื่อเรียนต่อ\n• ตามวันที่: เรียนเฉพาะการ์ดที่เพิ่มในวันที่เฉพาะ\n\nโหมดทบทวนตามลำดับ สุ่ม ตามลำดับ และตามวันที่ใช้ 2 ปุ่มง่ายๆ (ไม่รู้/รู้แล้ว)\n\n• โหมดอัดเข้าหัว: ทบทวนอย่างเข้มข้นเป็นรอบๆ จนจำการ์ดทั้งหมดได้ ใช้ 2 ปุ่ม (พลาด/จำได้) ไม่ส่งผลต่อตารางเวลา SRS"
        },
        "srsScience": {
          "title": "วิทยาศาสตร์เบื้องหลัง SRS",
          "body": "SRS (ระบบทบทวนแบบเว้นระยะ) เป็นวิธีการเรียนรู้ที่อิงจากการทำงานของความจำมนุษย์\n\nเส้นโค้งการลืมของ Ebbinghaus\nนักจิตวิทยาชาวเยอรมัน Hermann Ebbinghaus ค้นพบ \"เส้นโค้งการลืม\" ผ่านการทดลองในปี 1885:\n• หลังเรียน 20 นาที: ลืมไป ~42%\n• หลัง 1 ชั่วโมง: ลืมไป ~56%\n• หลัง 1 วัน: ลืมไป ~67%\n• หลัง 1 สัปดาห์: ลืมไป ~75%\n• หลัง 1 เดือน: ลืมไป ~79%\n\nกล่าวอีกนัยหนึ่ง ข้อมูลที่เรียนเพียงครั้งเดียวจะถูกลืมอย่างรวดเร็วเมื่อเวลาผ่านไป\n\nหลักการสำคัญของการทบทวนแบบเว้นระยะ\nกุญแจของ SRS คือ \"ทบทวนก่อนที่คุณจะลืม\":\n1. เรียนครั้งแรก → ทบทวนหลัง 1 วัน\n2. จำได้หลัง 1 วัน → ทบทวนหลัง 3 วัน\n3. จำได้หลัง 3 วัน → ทบทวนหลัง 7 วัน\n4. จำได้หลัง 7 วัน → ทบทวนหลัง 21 วัน\n\nด้วยการเพิ่มช่วงเวลาทบทวนอย่างค่อยๆ คุณสามารถเก็บข้อมูลในความจำระยะยาวด้วยความพยายามน้อยที่สุด งานวิจัยแสดงว่าวิธีนี้มีประสิทธิภาพมากกว่าการท่องจำซ้ำแบบธรรมดา 2-3 เท่า\n\nSRS ของ ReeeeecallStudy อิงจากอัลกอริทึม SM-2 ที่ได้รับการพิสูจน์โดย Anki วิเคราะห์ความยากและประวัติการเรียนของแต่ละการ์ดเพื่อคำนวณเวลาทบทวนที่เหมาะสมอัตโนมัติ"
        },
        "srsMethod": {
          "title": "วิธีเรียน SRS — คู่มือปุ่มฉบับสมบูรณ์",
          "body": "ดูด้านหน้าของการ์ด นึกคำตอบ แล้วพลิก หลังจากตรวจสอบด้านหลัง กดปุ่มใดปุ่มหนึ่งจาก 4 ปุ่มเพื่อประเมินตนเอง\n\nAgain (ปุ่มแดง)\n\"ฉันจำไม่ได้เลย\"\n• การ์ดใหม่: ปรากฏอีกหลัง 10 นาที (ภายในเซสชันเดียวกัน)\n• การ์ดทบทวน: ช่วงเวลารีเซ็ต ปรากฏอีกหลัง 10 นาที\n• ค่าความง่ายลดลง -0.20\n• จำนวนครั้งทบทวนรีเซ็ตเป็น 0\n→ ถ้าจำไม่ได้ กดอย่างซื่อสัตย์ การฝืนกดปุ่มอื่นจะลดประสิทธิภาพการเรียนรู้\n\nHard (ปุ่มส้ม)\n\"ฉันนึกออก แต่ลำบาก\"\n• การ์ดใหม่: ทบทวนหลัง 1 วัน\n• การ์ดทบทวน: ทบทวนที่ ~1.2 เท่าของช่วงเวลาปัจจุบัน (ขั้นต่ำ +1 วัน)\n• ค่าความง่ายลดลง -0.15\n→ ถ้าคุณใช้เวลาหลายวินาทีก่อนจะนึกออก เลือก Hard\n\nGood (ปุ่มน้ำเงิน)\n\"ฉันจำได้ค่อนข้างดี\"\n• การ์ดใหม่: ทบทวนหลัง 1 วัน\n• ทบทวนครั้งที่ 2: อย่างน้อย 3 วันถัดไป\n• หลังจากนั้น: ช่วงเวลาปัจจุบัน × ค่าความง่าย (ปกติ 2.5 เท่า)\n• ค่าความง่ายไม่เปลี่ยน\n→ ถ้าคุณนึกออกอย่างเป็นธรรมชาติภายใน 1-2 วินาที เลือก Good นี่คือปุ่มที่คุณจะกดบ่อยที่สุด\n\nEasy (ปุ่มเขียว)\n\"ฉันจำได้ทันทีและสมบูรณ์\"\n• การ์ดใหม่: ทบทวนหลัง 4 วัน\n• การ์ดทบทวน: ช่วงเวลาปัจจุบัน × ค่าความง่าย × 1.3\n• ค่าความง่ายเพิ่มขึ้น +0.15\n→ กด Easy เฉพาะเมื่อคำตอบผุดขึ้นในใจทันทีที่เห็นการ์ด\n\nเคล็ดลับ: เมื่อไม่แน่ใจ กด Good สำหรับการ์ดส่วนใหญ่ Good เป็นคะแนนที่เหมาะสมที่สุด"
        },
        "srsCardStates": {
          "title": "ทำความเข้าใจสถานะการ์ด",
          "body": "ในการเรียน SRS การ์ดจะผ่าน 3 สถานะ:\n\nใหม่\nการ์ดที่ยังไม่ได้เรียน\n• ปรากฏครั้งแรกในเซสชันการเรียน\n• หลังจากให้คะแนนครั้งแรก จะย้ายเป็นสถานะ \"กำลังเรียน\" หรือ \"ทบทวน\"\n• \"จำกัดการ์ดใหม่\" ในการตั้งค่าควบคุมจำนวนที่ปรากฏต่อเซสชัน\n\nกำลังเรียน\nการ์ดที่ยังจำไม่ได้ดี (ให้คะแนน Again หรือ Hard)\n• ปรากฏซ้ำในช่วงเวลาสั้น (10 นาที ถึง 1 วัน)\n• การให้คะแนน Good หรือสูงกว่าจะ \"จบ\" ไปสู่สถานะทบทวน\n• สามารถปรากฏหลายครั้งภายในเซสชันเดียวกัน\n\nทบทวน\nการ์ดที่เข้าสู่ความจำระยะยาว (ให้คะแนน Good หรือ Easy)\n• ช่วงเวลาเพิ่มขึ้นเรื่อยๆ (1 วัน → 3 วัน → 7 วัน → 21 วัน → ...)\n• การกด Again จะส่งกลับไปเป็น \"กำลังเรียน\"\n• การ์ดที่จำได้ดีอาจมีช่วงเวลาเป็นเดือนหรือแม้แต่ปี\n\nด้วยระบบ 3 ขั้นตอนนี้ คุณจะใช้เวลากับการ์ดที่ไม่รู้ ในขณะที่ลดการทบทวนการ์ดที่จำได้แล้ว"
        },
        "srsIntervals": {
          "title": "ช่วงเวลาทบทวนและค่าความง่าย",
          "body": "หัวใจของ SRS คือ \"ค่าความง่าย\" และ \"ช่วงเวลาทบทวน\"\n\nค่าความง่ายคืออะไร?\nตัวเลขที่กำหนดให้แต่ละการ์ด (ค่าเริ่มต้น: 2.50)\n• Again: ลดลง -0.20 (ขั้นต่ำ 1.30)\n• Hard: ลดลง -0.15 (ขั้นต่ำ 1.30)\n• Good: ไม่เปลี่ยน\n• Easy: เพิ่มขึ้น +0.15 (สูงสุด 4.00)\n\nช่วงเวลาทบทวนเพิ่มขึ้นโดยคูณค่าความง่าย:\nตัวอย่าง: การ์ดที่มีช่วงเวลา 10 วัน ค่าความง่าย 2.50 ให้คะแนน Good → ช่วงเวลาถัดไป = 10 × 2.50 = 25 วัน\n\nตัวอย่างการเรียนจริง (ค่าเริ่มต้น)\nกด Good ต่อเนื่องกับการ์ดใหม่:\nครั้งที่ 1: หลัง 1 วัน → ครั้งที่ 2: หลัง 3 วัน → ครั้งที่ 3: หลัง 8 วัน → ครั้งที่ 4: หลัง 20 วัน → ครั้งที่ 5: หลัง 50 วัน → ...\n\nกด Again ก่อน แล้วค่อย Good:\nครั้งที่ 1 (Again): หลัง 10 นาที → ครั้งที่ 2 (Good): หลัง 1 วัน → ครั้งที่ 3 (Good): หลัง 3 วัน → ...\n\nกฎการรับประกันช่วงเวลา\n• ช่วงเวลาของ Hard จะเพิ่มขึ้นอย่างน้อย 1 วันจากครั้งก่อน\n• ช่วงเวลาของ Good จะมากกว่า Hard เสมอ\n• ช่วงเวลาของ Easy จะมากกว่า Good เสมอ\n\nระบบนี้ทำให้การ์ดที่พลาดบ่อยปรากฏถี่ขึ้น ในขณะที่การ์ดที่จำได้ดีปรากฏน้อยลง"
        },
        "quickStudy": {
          "title": "เรียนด่วน",
          "body": "เลือกสำรับโดยตรงในหน้าเรียนด่วนเพื่อเริ่มเรียน แต่ละสำรับแสดงจำนวนการ์ดใหม่/ทบทวนเพื่อการตัดสินใจอย่างรวดเร็ว"
        },
        "sessionFlow": {
          "title": "ขั้นตอนเซสชันการเรียน",
          "body": "1. เลือกสำรับ → ตั้งค่าโหมดการเรียน → เริ่ม\n2. ดูด้านหน้าการ์ด → แตะ/คลิกเพื่อพลิก → เลือกคะแนน\n3. หลังจบการ์ดทั้งหมด สรุปแสดงจำนวนที่เรียน เวลาที่ใช้ และการกระจายคะแนน\n\nคีย์ลัด (ตามโหมด)\n• ทั่วไป: Space/Enter (พลิก), Escape (ออก)\n• โหมด SRS: 1 (Again), 2 (Hard), 3 (Good), 4 (Easy)\n• โหมดทั่วไป (ทบทวนตามลำดับ/สุ่ม/ตามลำดับ/ตามวันที่): →/Space (รู้แล้ว), ← (ไม่รู้)\n• อัดเข้าหัว: →/Space (จำได้), ← (พลาด)"
        },
        "swipeMode": {
          "title": "โหมดปัด",
          "body": "เปลี่ยนโหมดตอบคำถามเป็น 'ปัด' ในตั้งค่าเพื่อให้คะแนนการ์ดโดยการปัด เหมาะสำหรับเรียนบนมือถือด้วยมือเดียว\n\nทิศทางการปัดตามโหมด:\n• โหมด SRS: ← Again / → Good\n• โหมดทั่วไป (ทบทวนตามลำดับ/สุ่ม/ตามลำดับ/ตามวันที่): ← ไม่รู้ / → รู้แล้ว\n• อัดเข้าหัว: ← พลาด / → จำได้\n\nปัดผ่าน 100px เพื่อดูผลตอบรับทางภาพ ปล่อยเพื่อยืนยันคะแนน"
        },
        "srsCustom": {
          "title": "ปรับแต่งการตั้งค่า SRS",
          "body": "ปรับช่วงเวลาเริ่มต้น Again/Hard/Good/Easy (วัน) ในหน้าแก้ไขสำรับ ตัวอย่างเช่น การเพิ่มช่วงเวลา Easy เป็น 7 วันจะลดความถี่ในการทบทวนสำหรับการ์ดที่ง่าย 'จำกัดการ์ดใหม่' ในตั้งค่าควบคุมจำนวนการ์ดใหม่ที่ปรากฏต่อเซสชัน"
        },
        "cramming": {
          "title": "โหมดอัดเข้าหัว",
          "body": "โหมดอัดเข้าหัวออกแบบมาสำหรับการเรียนอย่างเข้มข้นในนาทีสุดท้าย — เหมาะสำหรับก่อนสอบหรือเมื่อคุณต้องการทบทวนการ์ดทั้งหมดอย่างรวดเร็ว\n\nวิธีการทำงาน\n1. การ์ดที่เลือกทั้งหมดจะแสดงในรอบที่ 1\n2. ให้คะแนนแต่ละการ์ดว่า \"จำได้\" หรือ \"จำไม่ได้\"\n3. การ์ดที่พลาดจะปรากฏอีกครั้งภายในรอบหลังจากช่วงเว้นสั้นๆ\n4. การ์ดที่ไม่เคยตอบ \"จำได้\" จะย้ายไปรอบถัดไป\n5. เซสชันสิ้นสุดเมื่อจำการ์ดทั้งหมดได้ (หรือหมดเวลา)\n\nฟีเจอร์สำคัญ\n• ตัวกรองการ์ด: เรียนการ์ดทั้งหมด เฉพาะการ์ดที่อ่อน (ค่าความง่ายต่ำ) หรือการ์ดที่ครบกำหนดเร็วๆ นี้\n• จำกัดเวลา: ไม่บังคับ — ตั้ง 15/30/60 นาทีหรือไม่จำกัด\n• สลับ: สุ่มลำดับการ์ดแต่ละรอบ\n• ติดตามความชำนาญ: เปอร์เซ็นต์ความชำนาญแบบเรียลไทม์และความก้าวหน้าของรอบ\n\nความปลอดภัย SRS\nโหมดอัดเข้าหัวไม่ส่งผลต่อตารางเวลา SRS ค่าความง่าย ช่วงเวลา และวันทบทวนถัดไปยังคงเดิม บันทึกการเรียนยังคงถูกบันทึกเพื่อติดตามประวัติ\n\nคีย์ลัด\n• Space หรือ → : จำได้\n• ← : จำไม่ได้\n\nเมื่อไหร่ควรใช้อัดเข้าหัว vs SRS\n• ใช้ SRS สำหรับการเรียนรายวันระยะยาว\n• ใช้อัดเข้าหัวสำหรับเตรียมสอบ ทบทวนเร็ว หรือรื้อฟื้นสิ่งที่ลืม"
        }
      }
    },
    "import-export": {
      "title": "นำเข้าและส่งออก",
      "items": {
        "jsonImport": {
          "title": "นำเข้า JSON",
          "body": "ในหน้ารายละเอียดสำรับ คลิก 'นำเข้า' → เลือกไฟล์ JSON ไฟล์ JSON ที่ส่งออกจาก ReeeeecallStudy สามารถนำเข้าได้โดยตรง เหมาะสำหรับการสำรองและกู้คืน รวมถึงข้อมูลเมตาของสำรับและเทมเพลต"
        },
        "csvImport": {
          "title": "นำเข้า CSV",
          "body": "ไฟล์ CSV (บันทึกจาก Excel) สามารถนำเข้าได้เช่นกัน ขั้นตอนการจับคู่จะปรากฏเพื่อจับคู่ชื่อคอลัมน์กับฟิลด์เทมเพลต พร้อมการจับคู่อัตโนมัติ คอลัมน์ 'Tags' ที่ใช้เครื่องหมายอัฒภาค (;) จะถูกจดจำอัตโนมัติ"
        },
        "duplicates": {
          "title": "การจัดการรายการซ้ำ",
          "body": "เมื่อนำเข้า การ์ดที่มีอยู่แล้วที่มีเนื้อหาเหมือนกันจะถูกทำเครื่องหมายว่าซ้ำ คุณสามารถข้าม เขียนทับ หรือเพิ่มเป็นรายการใหม่ ดูตัวอย่างจำนวนการ์ดที่ถูกต้อง/ไม่ถูกต้อง/ซ้ำก่อนการนำเข้าขั้นสุดท้าย"
        },
        "jsonExport": {
          "title": "ส่งออก JSON",
          "body": "รายละเอียดสำรับ → 'ส่งออก' → JSON จะดาวน์โหลดข้อมูลสำรับ เทมเพลต และการ์ดทั้งหมดเป็นไฟล์ JSON เดียว ใช้สำหรับโอนไปยังอุปกรณ์/บัญชีอื่นหรือสำรองข้อมูล"
        },
        "csvExport": {
          "title": "ส่งออก CSV",
          "body": "รูปแบบ CSV สามารถเปิดได้โดยตรงใน Excel/Google Sheets รวม BOM เพื่อแสดงอักขระหลายภาษาอย่างถูกต้องใน Excel"
        }
      }
    },
    "sharing": {
      "title": "การแชร์สำรับ",
      "items": {
        "copy": {
          "title": "โหมดแชร์: คัดลอก",
          "body": "ให้ผู้รับสำเนาอิสระของสำรับ พวกเขาสามารถแก้ไข เพิ่ม และลบการ์ดได้อย่างอิสระ หลังจากแชร์ ต้นฉบับและสำเนาไม่ส่งผลต่อกัน เหมาะสำหรับการปรับแต่ง"
        },
        "subscribe": {
          "title": "โหมดแชร์: ติดตาม",
          "body": "ผู้รับ 'ติดตาม' สำรับของคุณ เมื่อคุณเพิ่มการ์ด ผู้ติดตามจะได้รับด้วย อย่างไรก็ตาม ความก้าวหน้าการเรียน (SRS) จะติดตามเป็นรายบุคคล ผู้ติดตามไม่สามารถแก้ไขการ์ดได้ เหมาะสำหรับครู↔นักเรียน หรือกลุ่มเรียน"
        },
        "snapshot": {
          "title": "โหมดแชร์: สแนปช็อต",
          "body": "สร้างสำเนาอ่านอย่างเดียวของสำรับ ณ จุดเวลาปัจจุบัน ผู้รับสามารถเรียนได้เท่านั้น ไม่สามารถแก้ไข การอัปเดตในอนาคตของต้นฉบับไม่ส่งผล ใช้เมื่อคุณต้องการแชร์ 'สถานะปัจจุบันที่แน่นอน'"
        },
        "inviteLink": {
          "title": "ส่งลิงก์เชิญ",
          "body": "รายละเอียดสำรับ → ปุ่มแชร์ → เลือกโหมดแชร์ → 'สร้างลิงก์เชิญ' จะสร้างลิงก์เฉพาะ ส่งผ่านแอปส่งข้อความ อีเมล ฯลฯ ผู้รับคลิกเพื่อยอมรับ"
        },
        "manage": {
          "title": "จัดการการแชร์",
          "body": "ตรวจสอบการแชร์ที่ส่ง/ได้รับในหน้า 'การแชร์ของฉัน' ใกล้ตั้งค่า คุณสามารถเพิกถอนการแชร์ที่ใช้งานอยู่หรือยกเลิกการติดตาม"
        }
      }
    },
    "marketplace": {
      "title": "ตลาด",
      "items": {
        "what": {
          "title": "ตลาดคืออะไร?",
          "body": "พื้นที่สำหรับค้นหาและรับสำรับที่แชร์โดยผู้ใช้อื่น กรองตามหมวดหมู่ (ภาษา ใบรับรอง การเขียนโปรแกรม ฯลฯ) และแท็ก จัดเรียงตามความนิยมหรือใหม่สุด"
        },
        "getDeck": {
          "title": "รับสำรับ",
          "body": "คลิกสำรับในตลาดเพื่อดูรายละเอียด ดูตัวอย่างการ์ด 10 ใบแรก จากนั้นกด 'รับ' เพื่อเพิ่มในสำรับของคุณ พฤติกรรมจะแตกต่างกันตามโหมดแชร์ (คัดลอก/ติดตาม/สแนปช็อต)"
        },
        "publish": {
          "title": "เผยแพร่สำรับของคุณ",
          "body": "รายละเอียดสำรับ → แชร์ → 'เผยแพร่ไปยังตลาด' ตั้งชื่อ คำอธิบาย หมวดหมู่ แท็ก และโหมดแชร์ เมื่อเผยแพร่แล้ว ผู้ใช้ทั้งหมดสามารถค้นหาได้ คุณสามารถยกเลิกการเผยแพร่ได้ตลอดเวลา"
        }
      }
    },
    "history": {
      "title": "ประวัติการเรียนและสถิติ",
      "items": {
        "viewHistory": {
          "title": "ดูประวัติการเรียน",
          "body": "ดูเซสชันการเรียนทั้งหมดตามวันที่ในหน้าประวัติ คลิกเซสชันเพื่อดูรายละเอียดต่อการ์ด (คะแนน เวลาที่ใช้) กรองตามสำรับหรือโหมด แผนภูมิการกระจายคะแนนจะจัดกลุ่มตามโหมด (การทบทวนแบบเว้นระยะ / ทั่วไป / อัดเข้าหัว)"
        },
        "deckProgress": {
          "title": "ความก้าวหน้าสำรับ",
          "body": "การ์ดความก้าวหน้าสำรับจะปรากฏด้านบนของประวัติการเรียน ดูอัตราความสำเร็จและจำนวนการ์ดตามสถานะ (ใหม่/กำลังเรียน/ทบทวน) ได้ในมุมมองเดียว"
        },
        "dashboardStats": {
          "title": "สถิติแดชบอร์ด",
          "body": "สลับระหว่างแท็บช่วงเวลา (1 วัน/1 สัปดาห์/1 เดือน/3 เดือน/6 เดือน/1 ปี/2 ปี/5 ปี) บนแดชบอร์ดเพื่อดูฮีทแมปการเรียน แผนภูมิปริมาณการเรียนรายวัน และพยากรณ์การทบทวน"
        }
      }
    },
    "settings": {
      "title": "ตั้งค่า",
      "items": {
        "profile": {
          "title": "โปรไฟล์",
          "body": "ตั้งชื่อที่แสดงของคุณ อีเมลไม่สามารถเปลี่ยนได้"
        },
        "srsLimit": {
          "title": "จำกัดการ์ดใหม่ SRS",
          "body": "ตั้งจำนวนสูงสุดของการ์ดใหม่ที่เพิ่มต่อเซสชัน SRS การ์ดทบทวนไม่ได้รับผลกระทบจากขีดจำกัดนี้ ปรับเพื่อควบคุมปริมาณการเรียนของคุณ"
        },
        "answerMode": {
          "title": "โหมดตอบคำถาม (ปุ่ม/ปัด)",
          "body": "โหมดปุ่ม: ให้คะแนนโดยกดปุ่มด้านล่าง โหมด SRS แสดง 4 ปุ่ม (Again/Hard/Good/Easy) โหมดทั่วไปแสดง 2 ปุ่ม (ไม่รู้/รู้แล้ว) และอัดเข้าหัวแสดง 2 ปุ่ม (พลาด/จำได้)\nโหมดปัด: ให้คะแนนโดยปัดการ์ดซ้ายหรือขวา ใน SRS: ← Again / → Good ในโหมดอื่น: ← ไม่รู้ / → รู้แล้ว"
        },
        "autoTts": {
          "title": "TTS อัตโนมัติ",
          "body": "อ่านออกเสียงฟิลด์ที่เปิด TTS อัตโนมัติเมื่อพลิกการ์ด แม้ปิดอยู่ ปุ่มลำโพงสำหรับเล่นด้วยตนเองจะพร้อมใช้เสมอ"
        },
        "apiKey": {
          "title": "API Key",
          "body": "สร้าง API key เพื่อเข้าถึงข้อมูล ReeeeecallStudy จากเครื่องมือภายนอก (สคริปต์ แอป) คีย์จะแสดงเพียงครั้งเดียว — อย่าลืมคัดลอก อนุญาตสูงสุด 1 คีย์"
        }
      }
    },
    "api": {
      "title": "คู่มือ API (สร้างการ์ดอัตโนมัติด้วย AI)",
      "items": {
        "whatSimple": {
          "title": "API คืออะไร? (อธิบายง่ายๆ)",
          "body": "API คือ \"วิธีที่โปรแกรมคุยกัน\"\n\nเช่นเดียวกับที่คุณกดปุ่มในแอปเพื่อสร้างการ์ด API ช่วยให้คุณทำสิ่งเดียวกันด้วยคำสั่งข้อความ\n\nลองนึกภาพเหมือนร้านอาหาร:\n• เมนู = เอกสาร API (อธิบายคำขอที่คุณสามารถทำได้)\n• สั่งอาหาร = คำขอ API (\"แสดงสำรับของฉัน\" \"เพิ่ม 100 การ์ด\")\n• ได้อาหาร = ตอบรับ API (ข้อมูลหรือผลลัพธ์ที่คุณร้องขอ)\n\nที่ดีที่สุดคือ คุณสามารถขอให้เครื่องมือ AI เช่น ChatGPT, Gemini หรือ Claude ส่งคำสั่งเหล่านี้ให้คุณ!\nAI จะสร้างเนื้อหาการ์ดและลงทะเบียนผ่าน API อัตโนมัติ"
        },
        "whyApi": {
          "title": "ทำไมต้องใช้ API?",
          "body": "เปรียบเทียบการสร้างการ์ดทีละใบ vs การใช้ API:\n\nด้วยมือ: 30 วินาทีต่อการ์ด x 100 การ์ด = ~50 นาที\nAPI + AI: 100 การ์ดในครั้งเดียว = ~3-5 นาที\n\nสิ่งที่คุณทำได้กับ API:\n• บอก AI \"สร้างการ์ดคำศัพท์ TOEIC 100 ใบ\" และพวกมันจะถูกสร้างทันที\n• \"สร้างการ์ดคันจิ JLPT N3 50 ใบ\" — เสร็จในคำขอเดียว\n• อัปโหลดข้อมูลจาก Excel หรือไฟล์ข้อความเป็นกลุ่ม\n• ไม่ต้องเขียนโปรแกรม — แค่แชทกับ AI!\n\nทำตามคู่มือนี้ ทุกคนสามารถสร้าง 100 การ์ดใน 5 นาที"
        },
        "getKey": {
          "title": "รับ API Key ของคุณ",
          "body": "ในการใช้ API คุณต้องมี API key ก่อน มันเหมือนรหัสผ่านที่ให้คุณเข้าถึง API จากบัญชีของคุณ\n\nวิธีรับ:\n1. เข้าสู่ระบบแอป ReeeeecallStudy\n2. ไปที่ \"ตั้งค่า\" จากเมนูด้านบนขวา\n3. เลื่อนลงไปที่ส่วน \"API Key\"\n4. คลิก \"สร้างคีย์ใหม่\"\n5. กรอกชื่อสำหรับคีย์ของคุณ (เช่น \"My AI Integration\")\n6. คีย์ที่ขึ้นต้นด้วย rc_ จะแสดง\n\nสำคัญ: คีย์จะแสดงเพียงครั้งเดียวบนหน้าจอนี้!\nอย่าลืมคัดลอกและบันทึกไว้ในที่ปลอดภัย\n\nAPI key ของคุณเหมือนรหัสผ่าน อย่าแชร์กับคนอื่น"
        },
        "step1Prepare": {
          "title": "ขั้นตอนที่ 1: เตรียมสำรับและเทมเพลตการ์ด",
          "body": "ก่อนเพิ่มการ์ดผ่าน API ให้สร้างสำรับและเทมเพลตการ์ดในแอปก่อน\n\n1. สร้างสำรับ\n• ในแอป ไปที่ \"สำรับ\" → \"สร้างสำรับใหม่\"\n• กรอกชื่อ (เช่น \"คำศัพท์ TOEIC\")\n• กรอกคำอธิบาย (เช่น \"คำศัพท์ TOEIC ที่จำเป็น\")\n\n2. สร้างเทมเพลตการ์ด\n• ไปที่ \"เทมเพลต\" → \"เทมเพลตใหม่\"\n• กรอกชื่อ (เช่น \"รายละเอียดคำศัพท์\")\n• เพิ่มฟิลด์:\n  - word: ประเภทข้อความ\n  - meaning: ประเภทข้อความ\n  - example: ประเภทข้อความ\n• วาง \"word\" บนเลย์เอาต์ด้านหน้า\n• วาง \"meaning\" และ \"example\" บนเลย์เอาต์ด้านหลัง\n\n3. ตั้งเทมเพลตเริ่มต้นสำหรับสำรับ\n• ในหน้าแก้ไขสำรับ เลือกเทมเพลตที่สร้างเป็นค่าเริ่มต้น\n\nเคล็ดลับ: จำชื่อคีย์ฟิลด์ (word, meaning, example)!\nคุณจะใช้คีย์เหล่านี้เมื่อสร้างการ์ดผ่าน API"
        },
        "step2Query": {
          "title": "ขั้นตอนที่ 2: ค้นหา ID สำรับ/เทมเพลตด้วย AI",
          "body": "ในการเพิ่มการ์ด คุณต้องมี ID สำรับและ ID เทมเพลต\nมาขอให้ AI ค้นหาให้!\n\nเปิด ChatGPT, Gemini หรือ Claude แล้ววางข้อความต่อไปนี้:\n\n─────────────────────────────\nฉันใช้แอปแฟลชการ์ดชื่อ ReeeeecallStudy\nนี่คือข้อมูล API ของฉัน:\n• API URL: https://reeeeecallstudy.xyz/api/v1\n• API Key: rc_วาง_API_KEY_ของคุณ_ที่นี่\n\nกรุณาทำคำขอสองรายการนี้:\n1. แสดงรายการสำรับ: GET https://reeeeecallstudy.xyz/api/v1/decks\n2. แสดงรายการเทมเพลต: GET https://reeeeecallstudy.xyz/api/v1/templates\n\nใส่ header: Authorization: Bearer rc_วาง_API_KEY_ของคุณ_ที่นี่\nแสดง id และ name ของแต่ละสำรับ และ id, name, fields ของแต่ละเทมเพลต\n─────────────────────────────\n\nแทนที่ \"rc_วาง_API_KEY_ของคุณ_ที่นี่\" ด้วย API key จริงของคุณ!\n\nAI จะแสดงข้อมูลเช่น:\n• Deck ID: a1b2c3d4-xxxx-xxxx-xxxx-xxxxxxxxxxxx\n• ชื่อสำรับ: คำศัพท์ TOEIC\n• Template ID: e5f6g7h8-xxxx-xxxx-xxxx-xxxxxxxxxxxx\n• ฟิลด์เทมเพลต: word, meaning, example\n\nคัดลอก ID เหล่านี้ — คุณจะต้องใช้ในขั้นตอนถัดไป!"
        },
        "step3AiGenerate": {
          "title": "ขั้นตอนที่ 3: ขอให้ AI สร้างและลงทะเบียนการ์ด",
          "body": "นี่คือขั้นตอนสำคัญ! ขอให้ AI สร้างการ์ดและลงทะเบียนโดยตรง\n\nคัดลอกพรอมต์ด้านล่าง แทนที่ส่วนที่ทำเครื่องหมายด้วยข้อมูลของคุณ แล้วส่งให้ AI:\n\n─────────────────────────────\nสร้างแฟลชการ์ดโดยใช้ ReeeeecallStudy API\n\nข้อมูล API:\n• Base URL: https://reeeeecallstudy.xyz/api/v1\n• API Key: (วาง API key ของคุณที่นี่)\n• Deck ID: (วาง deck ID จากขั้นตอนที่ 2)\n• Template ID: (วาง template ID จากขั้นตอนที่ 2)\n\nEndpoint สร้างการ์ด:\nPOST https://reeeeecallstudy.xyz/api/v1/decks/(deck ID)/cards\nHeaders:\n  Authorization: Bearer (API key)\n  Content-Type: application/json\nBody (JSON array, สูงสุด 100):\n[\n  {\n    \"template_id\": \"(template ID)\",\n    \"field_values\": {\n      \"word\": \"คำภาษาอังกฤษ\",\n      \"meaning\": \"คำนิยาม\",\n      \"example\": \"ประโยคตัวอย่าง\"\n    },\n    \"tags\": [\"แท็ก\"]\n  }\n]\n\nคำขอ:\nสร้างการ์ดคำศัพท์ TOEIC ที่จำเป็น 50 ใบและลงทะเบียนผ่าน API ด้านบน\nแต่ละการ์ดควรมี:\n• word: คำภาษาอังกฤษ\n• meaning: คำนิยามสั้นๆ\n• example: ประโยคตัวอย่างหนึ่งประโยคที่ใช้คำ\n• tags: ระดับความยาก (beginner / intermediate / advanced)\n─────────────────────────────\n\nเปลี่ยน \"การ์ดคำศัพท์ TOEIC ที่จำเป็น 50 ใบ\" เป็นหัวข้อที่คุณต้องการ!\nตัวอย่าง:\n• \"การ์ดคันจิ JLPT N3 30 ใบ\"\n• \"วลีท่องเที่ยวสเปนพื้นฐาน 40 ใบ\"\n• \"เหตุการณ์ไทม์ไลน์ประวัติศาสตร์โลก 50 ใบ\"\n• \"คำศัพท์การเขียนโปรแกรม Python 30 ใบ\"\n• \"คำศัพท์กายวิภาคทางการแพทย์ 50 ใบ\"\n\nต้องการการ์ดเพิ่ม? แค่พูดว่า \"สร้างเพิ่มอีก 50 ใบโดยไม่ซ้ำ!\""
        },
        "aiExamples": {
          "title": "เคล็ดลับสำหรับแต่ละ AI (ChatGPT / Gemini / Claude)",
          "body": "แต่ละ AI มีจุดเด่นต่างกันเล็กน้อย เลือกใช้ที่ดีที่สุดตามความต้องการ!\n\nChatGPT (chat.openai.com)\n• สามารถรันโค้ดเพื่อเรียก API โดยตรงผ่าน Code Interpreter\n• เคล็ดลับ: พูดว่า \"รันโค้ด Python เพื่อเรียก API โดยตรง\" แล้วมันจะรันโค้ดจริงเพื่อลงทะเบียนการ์ด\n• เหมาะสำหรับ: เรียก API โดยตรง\n\nGoogle Gemini (gemini.google.com)\n• ผสมผสานกับ Google Search สำหรับข้อมูลล่าสุด\n• เคล็ดลับ: เหมาะสำหรับการ์ดที่ต้องการข้อมูลปัจจุบัน เช่น \"คำศัพท์เหตุการณ์ปัจจุบัน 2025\"\n• เหมาะสำหรับ: การ์ดที่ต้องการข้อมูลล่าสุด\n\nClaude (claude.ai)\n• เก่งในการจัดการข้อความยาวและสร้าง JSON ที่ถูกต้อง\n• เคล็ดลับ: สามารถสร้าง 100 การ์ดในครั้งเดียวโดยไม่ทำรูปแบบ JSON เสีย\n• เหมาะสำหรับ: สร้างจำนวนมาก โครงสร้างการ์ดที่ซับซ้อน\n\nเคล็ดลับทั่วไป:\n• ถ้า AI ไม่สามารถเรียก API ได้ → ขอว่า \"แค่แสดง JSON data ให้ฉัน\" จากนั้นคัดลอกและใช้วิธีลงทะเบียนด้วยตนเอง (ดูส่วนถัดไป)\n• พูดว่า \"สร้างเพิ่มอีก 50 ใบโดยไม่ซ้ำกับที่ทำไว้\" สำหรับการเพิ่มต่อเนื่อง\n• สูงสุด 100 การ์ดต่อคำขอ สำหรับมากกว่านั้น แบ่งเป็นหลายคำขอ"
        },
        "step4Manual": {
          "title": "เมื่อ AI ไม่สามารถเรียก API โดยตรง (วิธีด้วยตนเอง)",
          "body": "ถ้า AI ไม่สามารถเรียก API โดยตรง ไม่ต้องกังวล!\nแค่คัดลอก JSON data ที่ AI สร้างแล้วส่งเอง\n\nวิธีที่ 1: Swagger UI (ง่ายที่สุด แนะนำ)\n1. เปิด https://reeeeecallstudy.xyz/api/ui ในเบราว์เซอร์\n2. คลิก \"Authorize\" ด้านบน → กรอก API key → ยืนยัน\n3. ค้นหาและขยาย POST /v1/decks/{deckId}/cards\n4. คลิก \"Try it out\"\n5. กรอก deck ID ในฟิลด์ deckId\n6. วาง JSON array จาก AI ลงใน Request body\n7. คลิก \"Execute\" → เสร็จ!\n\nวิธีที่ 2: Terminal / Command Prompt\nเปิด Terminal (Mac) หรือ PowerShell (Windows) แล้วรัน:\n\ncurl -X POST \"https://reeeeecallstudy.xyz/api/v1/decks/YOUR_DECK_ID/cards\" \\\n  -H \"Authorization: Bearer rc_YOUR_API_KEY\" \\\n  -H \"Content-Type: application/json\" \\\n  -d '[{\"template_id\":\"YOUR_TEMPLATE_ID\",\"field_values\":{\"word\":\"apple\",\"meaning\":\"a round fruit\",\"example\":\"I eat an apple every day.\"},\"tags\":[\"beginner\"]}]'\n\nสำหรับ JSON ยาว บันทึกเป็นไฟล์ก่อน:\ncurl -X POST \"https://reeeeecallstudy.xyz/api/v1/decks/YOUR_DECK_ID/cards\" \\\n  -H \"Authorization: Bearer rc_YOUR_API_KEY\" \\\n  -H \"Content-Type: application/json\" \\\n  -d @cards.json\n\nสูงสุด 100 การ์ดต่อคำขอ"
        },
        "docsPage": {
          "title": "เอกสาร API ฉบับเต็ม",
          "body": "สำหรับข้อมูล API ที่ละเอียดยิ่งขึ้น:\n\n• เอกสาร API ในแอป: \"API\" ในเมนูด้านบนหรือ /api-docs\n• Swagger UI (ทดสอบแบบโต้ตอบ): https://reeeeecallstudy.xyz/api/ui\n• เอกสาร API สาธารณะ: https://reeeeecallstudy.xyz/docs/api\n\n Endpoint ที่พร้อมใช้ทั้งหมด:\n• Deck API: รายการ รายละเอียด สร้าง\n• Card API: รายการ รายละเอียด สร้าง (รองรับสร้างเป็นกลุ่ม) อัปเดต ลบ\n• Template API: รายการ รายละเอียด สร้าง อัปเดต ลบ\n• Study API: การ์ดครบกำหนด ประวัติการเรียน สถิติ\n• Marketplace API: รายการ เผยแพร่ ลบ\n• Sharing API: สร้างการแชร์ ยอมรับคำเชิญ รายการ เพิกถอน"
        },
        "rateLimits": {
          "title": "ขีดจำกัดอัตราคำขอ (ดีที่จะรู้)",
          "body": "จำนวนคำขอถูกจำกัดเพื่อเสถียรภาพของ API\n\nระดับฟรี:\n• คำขอ API รายวัน: 1,000\n• การเรียก API ต่อนาที: 60\n• การสร้างการ์ดต่อนาที: 30\n\nการเกินขีดจำกัดจะได้ 429 Too Many Requests\nรอสักครู่แล้วลองอีกครั้ง\n\nหมายเหตุ: 100 การ์ดนับเป็นแค่ 1 การเรียก API (สร้างเป็นกลุ่ม)\nด้วยคำขอรายวัน 1,000 ครั้ง คุณสามารถสร้างได้ถึง 100,000 การ์ดต่อวัน!"
        }
      }
    },
    "tips": {
      "title": "เคล็ดลับการเรียน",
      "items": {
        "daily": {
          "title": "เรียนนิดหน่อยทุกวัน",
          "body": "SRS มีประสิทธิภาพสูงสุดเมื่อเรียนสม่ำเสมอทุกวัน 10-20 นาทีต่อวันก็เพียงพอ เติมฮีทแมปการเรียนบนแดชบอร์ดของคุณ!"
        },
        "again": {
          "title": "อย่ากลัว Again",
          "body": "ใน SRS 'Again' ไม่ใช่ความล้มเหลว การทำเครื่องหมายการ์ดที่จำไม่ได้ว่า 'Again' อย่างซื่อสัตย์ช่วยให้ระบบแสดงในเวลาที่เหมาะสม การฝืนกด 'Good' จะลดประสิทธิภาพจริงๆ"
        },
        "concise": {
          "title": "ทำการ์ดให้กระชับ",
          "body": "ใส่แนวคิดเดียวต่อการ์ด การ์ดสั้นๆ ชัดเจน เช่น 'apple = แอปเปิล' มีประสิทธิภาพมากกว่า 'apple, pear, grape, strawberry...' มาก"
        },
        "tags": {
          "title": "ใช้แท็ก",
          "body": "เพิ่มแท็กเพื่อกรองอย่างรวดเร็วในภายหลัง ตัวอย่าง: 'grammar', 'verbs', 'Chapter1' เป็นต้น"
        }
      }
    }
  }
}
